------------------------------------------------------------------------------------------------------------------------------------------------------
      name:  <unnamed>
       log:  C:\Users\istei\Google Drive\Promotion\1_Projects\PES_Colombia\analysis/scripts/logs/2022.03.01-09.13.15.log.txt
  log type:  text
 opened on:   1 Mar 2022, 09:13:15

. 
. di "Begin date and time: $S_DATE $S_TIME"
Begin date and time:  1 Mar 2022 09:13:15

. di "Stata version: `c(stata_version)'"
Stata version: 16.1

. di "Updated as of: `c(born_date)'"
Updated as of: 19 Nov 2020

. di "Variant:       `=cond( c(MP),"MP",cond(c(SE),"SE",c(flavor)) )'"
Variant:       MP

. di "Processors:    `c(processors)'"
Processors:    2

. di "OS:            `c(os)' `c(osdtl)'"
OS:            Windows 64-bit

. di "Machine type:  `c(machine_type)'"
Machine type:  PC (64-bit x86-64)

. 
. *   Analyses were run on Windows using Stata version 16
. version 16              // Set Version number for backward compatibility

. 
. * All required Stata packages are available in the /libraries/stata folder
. tokenize `"$S_ADO"', parse(";")

. while `"`1'"' != "" {
  2.   if `"`1'"'!="BASE" cap adopath - `"`1'"'
  3.   macro shift
  4. }

. adopath ++ "$working_ANALYSIS/scripts/libraries/stata"
  [1]              "C:\Users\istei\Google Drive\Promotion\1_Projects\PES_Colombia\analysis/scripts/libraries/stata"
  [2]  (BASE)      "C:\Program Files\Stata16\ado\base/"

. mata: mata mlib index
.mlib libraries to be searched are now
    lmatabase;lmataado;lmataerm;lmatafc;lmatagsem;lmatalasso;lmatamcmc;lmatameta;lmatami;lmatamixlog;lmatanumlib;lmataopt;lmatapath;lmatapostest;lmata
> pss;lmatasem;lmatasp;lmatasvy;lmatatab;lcolrspace

. sysdir set PERSONAL "$working_ANALYSIS/scripts/libraries/stata"

. 
. * Create directories for output files
. cap mkdir "$working_ANALYSIS/processed"

. cap mkdir "$working_ANALYSIS/results"

. cap mkdir "$working_ANALYSIS/results/intermediate"

. cap mkdir "$working_ANALYSIS/results/tables"

. cap mkdir "$working_ANALYSIS/results/figures"

. 
. * Set general graph style
. set scheme swift_red //select one scheme as reference scheme to work with

. grstyle init 

. {
. *Background color
. grstyle set color white: background plotregion graphregion legend box textbox //
. 
. *Main colors (note: swift_red only defines 8 colors. Multiplying the color, that is "xx yy zz*0.5" reduces/increases intensity and "xx yy zz%50" red
> uces transparency)
. grstyle set color       "100 143 255" "120 94 240" "220 38 127" "254 97 0" "255 176 0" /// 5 main colors
>                                         "100 143 255*0.4" "120 94 240*0.4" "220 38 127*0.4" "254 97 0*0.4" "255 176 0*0.4" ///
>                                         "100 143 255*1.7" "120 94 240*1.7" "220 38 127*1.7" "254 97 0*1.7" "255 176 0*1.7" ///
>                                         : p# p#line p#lineplot p#bar p#area p#arealine p#pie histogram 
. 
. *Font size
. grstyle set size 10pt: heading //titles
. grstyle set size 8pt: subheading axis_title //axis titles
. grstyle set size 8pt: p#label p#boxlabel body small_body text_option axis_label tick_label minortick_label key_label //all other text
. 
. }

. * -------------------------------------------------
. 
end of do-file

. tab household_income
no variables defined
r(111);

. do "C:\Users\istei\AppData\Local\Temp\STDcbc_000000.tmp"

. *--------------------------------------------------------------------------------------
. * SCRIPT: 01_clean_generate.do
. * PURPOSE: cleans the raw excel data and generates additional variables for analysis
. *--------------------------------------------------------------------------------------
. 
. *----------------------------
. * 1) Import excel dataset and cleaning
. *----------------------------
. import excel  "$working_ANALYSIS/data/psa_data.xlsx", firstrow
(106 vars, 203 obs)

. 
end of do-file

. do "C:\Users\istei\AppData\Local\Temp\STDcbc_000000.tmp"

. *Correcting data entry errors with help of colombian team
. replace farms_n =. if id==96
(1 real change made, 1 to missing)

. replace farm1_size =. if id==10 
(1 real change made, 1 to missing)

. replace farm1_size =. if id==235
(1 real change made, 1 to missing)

. replace farm2_unit =1 if id==221
(1 real change made)

. replace payment_n =. if id==15
(1 real change made, 1 to missing)

. replace donation_n = 0 if donation_n==.
(14 real changes made)

. replace income_n = 18000 if id==172
(1 real change made)

. replace income_n = 18000 if id==411 & donation_n==2000
(1 real change made)

. replace household_income=. if id==10
(1 real change made, 1 to missing)

. replace household_income=. if id==96
(1 real change made, 1 to missing)

. replace household_income=500000 if id==97
(1 real change made)

. replace household_income=. if id==142
(1 real change made, 1 to missing)

. replace household_income=. if id==226 & treatment_d==2
(1 real change made, 1 to missing)

. 
. 
. *redefine data (adjust unit size)
. replace farm1_size = farm1_size/10000 if farm1_unit==2
(5 real changes made)

. replace farm1_size = farm1_size*0.64 if farm1_unit==3
(71 real changes made)

. replace farm1_size = farm1_size*0.64 if farm1_unit==4
(0 real changes made)

. replace farm2_size = farm2_size/10000 if farm2_unit==2
(2 real changes made)

. replace farm2_size = farm2_size*0.64 if farm2_unit==3
(32 real changes made)

. replace farm2_size = farm2_size*0.64 if farm2_unit==4
(0 real changes made)

. replace farm2_size =. if farm2_size==0
(1 real change made, 1 to missing)

. replace farm3_size = farm3_size/10000 if farm3_unit==2
(4 real changes made)

. replace farm3_size = farm3_size*0.64 if farm3_unit==3
(14 real changes made)

. replace farm3_size = farm3_size*0.64 if farm3_unit==4
(0 real changes made)

. replace farm3_size =. if farm3_size==0
(1 real change made, 1 to missing)

. replace farm4_size = farm4_size/10000 if farm4_unit==2
(1 real change made)

. replace farm4_size = farm4_size*0.64 if farm4_unit==3
(8 real changes made)

. replace farm4_size = farm4_size*0.64 if farm4_unit==4
(0 real changes made)

. 
end of do-file

. tab household_income

household_i |
      ncome |      Freq.     Percent        Cum.
------------+-----------------------------------
          0 |          2        1.01        1.01
     100000 |         10        5.03        6.03
     150000 |          1        0.50        6.53
     200000 |         18        9.05       15.58
     240000 |          1        0.50       16.08
     300000 |         15        7.54       23.62
     350000 |          2        1.01       24.62
     400000 |          7        3.52       28.14
     450000 |          1        0.50       28.64
     500000 |         13        6.53       35.18
     600000 |         12        6.03       41.21
     679000 |          1        0.50       41.71
     700000 |          3        1.51       43.22
     720000 |          2        1.01       44.22
     750000 |          1        0.50       44.72
     770000 |          1        0.50       45.23
     780000 |          4        2.01       47.24
     787600 |          3        1.51       48.74
     787700 |          1        0.50       49.25
     800000 |          9        4.52       53.77
     900000 |          1        0.50       54.27
    1000000 |         14        7.04       61.31
    1200000 |          4        2.01       63.32
    1300000 |          3        1.51       64.82
    1500000 |         15        7.54       72.36
    1600000 |          1        0.50       72.86
    1800000 |          3        1.51       74.37
    2000000 |          7        3.52       77.89
    2500000 |          4        2.01       79.90
    2800000 |          1        0.50       80.40
    3000000 |          4        2.01       82.41
    3300000 |          1        0.50       82.91
    3500000 |          3        1.51       84.42
    4000000 |          5        2.51       86.93
    4500000 |          4        2.01       88.94
    5000000 |          5        2.51       91.46
    6000000 |          4        2.01       93.47
    7000000 |          3        1.51       94.97
   1.00e+07 |          7        3.52       98.49
   1.50e+07 |          1        0.50       98.99
   2.00e+07 |          2        1.01      100.00
------------+-----------------------------------
      Total |        199      100.00

. tab community_activ3
variable community_activ3 not found
r(111);

. tab community_activ

community_a |
       ctiv |      Freq.     Percent        Cum.
------------+-----------------------------------
          1 |         94       46.31       46.31
          2 |          1        0.49       46.80
          3 |         15        7.39       54.19
          4 |         25       12.32       66.50
          5 |         68       33.50      100.00
------------+-----------------------------------
      Total |        203      100.00

. tab community_activ_1

community_a |
     ctiv_1 |      Freq.     Percent        Cum.
------------+-----------------------------------
          0 |          1        1.30        1.30
          1 |         70       90.91       92.21
          2 |          6        7.79      100.00
------------+-----------------------------------
      Total |         77      100.00

. tab community_activ_3

community_a |
     ctiv_3 |      Freq.     Percent        Cum.
------------+-----------------------------------
          1 |         10      100.00      100.00
------------+-----------------------------------
      Total |         10      100.00

. tab community_activ_1

community_a |
     ctiv_1 |      Freq.     Percent        Cum.
------------+-----------------------------------
          0 |          1        1.30        1.30
          1 |         70       90.91       92.21
          2 |          6        7.79      100.00
------------+-----------------------------------
      Total |         77      100.00

. tab community_activ

community_a |
       ctiv |      Freq.     Percent        Cum.
------------+-----------------------------------
          1 |         94       46.31       46.31
          2 |          1        0.49       46.80
          3 |         15        7.39       54.19
          4 |         25       12.32       66.50
          5 |         68       33.50      100.00
------------+-----------------------------------
      Total |        203      100.00

. tab know_nonpart

know_nonpar |
          t |      Freq.     Percent        Cum.
------------+-----------------------------------
          0 |        178       87.68       87.68
          1 |         25       12.32      100.00
------------+-----------------------------------
      Total |        203      100.00

. do "C:\Users\istei\AppData\Local\Temp\STDcbc_000000.tmp"

. *--------------------------------------------------------------------------------------
. * SCRIPT: 01_clean_generate.do
. * PURPOSE: cleans the raw excel data and generates additional variables for analysis
. *--------------------------------------------------------------------------------------
. 
. *----------------------------
. * 1) Import excel dataset and cleaning
. *----------------------------
. import excel  "$working_ANALYSIS/data/psa_data.xlsx", firstrow
no; data in memory would be lost
r(4);

end of do-file

r(4);

. do "C:\Users\istei\AppData\Local\Temp\STDcbc_000000.tmp"

. *--------------------------------------------------------------------------------------
. 
. *----------------------------
. * 1) Import excel dataset and cleaning
. *----------------------------
. clear

. import excel  "$working_ANALYSIS/data/psa_data.xlsx", firstrow
(106 vars, 203 obs)

. 
. *Correcting data entry errors with help of colombian team
. replace farms_n =. if id==96
(1 real change made, 1 to missing)

. replace farm1_size =. if id==10 
(1 real change made, 1 to missing)

. replace farm1_size =. if id==235
(1 real change made, 1 to missing)

. replace farm2_unit =1 if id==221
(1 real change made)

. replace payment_n =. if id==15
(1 real change made, 1 to missing)

. replace donation_n = 0 if donation_n==.
(14 real changes made)

. replace income_n = 18000 if id==172
(1 real change made)

. replace income_n = 18000 if id==411 & donation_n==2000
(1 real change made)

. replace household_income=. if id==10
(1 real change made, 1 to missing)

. replace household_income=. if id==96
(1 real change made, 1 to missing)

. replace household_income=500000 if id==97
(1 real change made)

. replace household_income=. if id==142
(1 real change made, 1 to missing)

. replace household_income=. if id==226 & treatment_d==2
(1 real change made, 1 to missing)

. 
. 
. *redefine data (adjust unit size)
. replace farm1_size = farm1_size/10000 if farm1_unit==2
(5 real changes made)

. replace farm1_size = farm1_size*0.64 if farm1_unit==3
(71 real changes made)

. replace farm1_size = farm1_size*0.64 if farm1_unit==4
(0 real changes made)

. replace farm2_size = farm2_size/10000 if farm2_unit==2
(2 real changes made)

. replace farm2_size = farm2_size*0.64 if farm2_unit==3
(32 real changes made)

. replace farm2_size = farm2_size*0.64 if farm2_unit==4
(0 real changes made)

. replace farm2_size =. if farm2_size==0
(1 real change made, 1 to missing)

. replace farm3_size = farm3_size/10000 if farm3_unit==2
(4 real changes made)

. replace farm3_size = farm3_size*0.64 if farm3_unit==3
(14 real changes made)

. replace farm3_size = farm3_size*0.64 if farm3_unit==4
(0 real changes made)

. replace farm3_size =. if farm3_size==0
(1 real change made, 1 to missing)

. replace farm4_size = farm4_size/10000 if farm4_unit==2
(1 real change made)

. replace farm4_size = farm4_size*0.64 if farm4_unit==3
(8 real changes made)

. replace farm4_size = farm4_size*0.64 if farm4_unit==4
(0 real changes made)

. 
. *label variables
. lab var assistant "Name of the assistant performing the survey"

. lab var date "Date the survey was taken"

. lab var treatment_d "Treatment participants was assigned to"

. lab def treat_lab 1 "Treatment 1" 2 "Treatment 2" 4 "Control", replace

. lab val treatment_d treat_lab

. lab var phase_d "Which phase of the PES did the participant complete?"

. lab def phase_lab 1 "Phase 1" 2 "Phase 2" 8 "None", replace

. lab val phase_d phase_lab

. var panel_d "Panel data on motivations available"
"Panel data on motivations available invalid name
r(198);

end of do-file

r(198);

. do "C:\Users\istei\AppData\Local\Temp\STDcbc_000000.tmp"

. * SCRIPT: 01_clean_generate.do
. * PURPOSE: cleans the raw excel data and generates additional variables for analysis
. *--------------------------------------------------------------------------------------
. 
. *----------------------------
. * 1) Import excel dataset and cleaning
. *----------------------------
. clear

. import excel  "$working_ANALYSIS/data/psa_data.xlsx", firstrow
(106 vars, 203 obs)

. 
. *Correcting data entry errors with help of colombian team
. replace farms_n =. if id==96
(1 real change made, 1 to missing)

. replace farm1_size =. if id==10 
(1 real change made, 1 to missing)

. replace farm1_size =. if id==235
(1 real change made, 1 to missing)

. replace farm2_unit =1 if id==221
(1 real change made)

. replace payment_n =. if id==15
(1 real change made, 1 to missing)

. replace donation_n = 0 if donation_n==.
(14 real changes made)

. replace income_n = 18000 if id==172
(1 real change made)

. replace income_n = 18000 if id==411 & donation_n==2000
(1 real change made)

. replace household_income=. if id==10
(1 real change made, 1 to missing)

. replace household_income=. if id==96
(1 real change made, 1 to missing)

. replace household_income=500000 if id==97
(1 real change made)

. replace household_income=. if id==142
(1 real change made, 1 to missing)

. replace household_income=. if id==226 & treatment_d==2
(1 real change made, 1 to missing)

. 
. 
. *redefine data (adjust unit size)
. replace farm1_size = farm1_size/10000 if farm1_unit==2
(5 real changes made)

. replace farm1_size = farm1_size*0.64 if farm1_unit==3
(71 real changes made)

. replace farm1_size = farm1_size*0.64 if farm1_unit==4
(0 real changes made)

. replace farm2_size = farm2_size/10000 if farm2_unit==2
(2 real changes made)

. replace farm2_size = farm2_size*0.64 if farm2_unit==3
(32 real changes made)

. replace farm2_size = farm2_size*0.64 if farm2_unit==4
(0 real changes made)

. replace farm2_size =. if farm2_size==0
(1 real change made, 1 to missing)

. replace farm3_size = farm3_size/10000 if farm3_unit==2
(4 real changes made)

. replace farm3_size = farm3_size*0.64 if farm3_unit==3
(14 real changes made)

. replace farm3_size = farm3_size*0.64 if farm3_unit==4
(0 real changes made)

. replace farm3_size =. if farm3_size==0
(1 real change made, 1 to missing)

. replace farm4_size = farm4_size/10000 if farm4_unit==2
(1 real change made)

. replace farm4_size = farm4_size*0.64 if farm4_unit==3
(8 real changes made)

. replace farm4_size = farm4_size*0.64 if farm4_unit==4
(0 real changes made)

. 
. *label variables
. lab var assistant "Name of the assistant performing the survey"

. lab var date "Date the survey was taken"

. lab var treatment_d "Treatment participants was assigned to"

. lab def treat_lab 1 "Treatment 1" 2 "Treatment 2" 4 "Control", replace

. lab val treatment_d treat_lab

. lab var phase_d "Which phase of the PES did the participant complete?"

. lab def phase_lab 1 "Phase 1" 2 "Phase 2" 8 "None", replace

. lab val phase_d phase_lab

. lab var panel_d "Panel data on motivations available"

. lab var time "Time of the survey"
variable time not found
r(111);

end of do-file

r(111);

. do "C:\Users\istei\AppData\Local\Temp\STDcbc_000000.tmp"

. *--------------------------------------------------------------------------------------
. * SCRIPT: 01_clean_generate.do
. * PURPOSE: cleans the raw excel data and generates additional variables for analysis
. *--------------------------------------------------------------------------------------
. 
. *----------------------------
. * 1) Import excel dataset and cleaning
. *----------------------------
. clear

. import excel  "$working_ANALYSIS/data/psa_data.xlsx", firstrow
(106 vars, 203 obs)

. 
. *Correcting data entry errors with help of colombian team
. replace farms_n =. if id==96
(1 real change made, 1 to missing)

. replace farm1_size =. if id==10 
(1 real change made, 1 to missing)

. replace farm1_size =. if id==235
(1 real change made, 1 to missing)

. replace farm2_unit =1 if id==221
(1 real change made)

. replace payment_n =. if id==15
(1 real change made, 1 to missing)

. replace donation_n = 0 if donation_n==.
(14 real changes made)

. replace income_n = 18000 if id==172
(1 real change made)

. replace income_n = 18000 if id==411 & donation_n==2000
(1 real change made)

. replace household_income=. if id==10
(1 real change made, 1 to missing)

. replace household_income=. if id==96
(1 real change made, 1 to missing)

. replace household_income=500000 if id==97
(1 real change made)

. replace household_income=. if id==142
(1 real change made, 1 to missing)

. replace household_income=. if id==226 & treatment_d==2
(1 real change made, 1 to missing)

. 
. 
. *redefine data (adjust unit size)
. replace farm1_size = farm1_size/10000 if farm1_unit==2
(5 real changes made)

. replace farm1_size = farm1_size*0.64 if farm1_unit==3
(71 real changes made)

. replace farm1_size = farm1_size*0.64 if farm1_unit==4
(0 real changes made)

. replace farm2_size = farm2_size/10000 if farm2_unit==2
(2 real changes made)

. replace farm2_size = farm2_size*0.64 if farm2_unit==3
(32 real changes made)

. replace farm2_size = farm2_size*0.64 if farm2_unit==4
(0 real changes made)

. replace farm2_size =. if farm2_size==0
(1 real change made, 1 to missing)

. replace farm3_size = farm3_size/10000 if farm3_unit==2
(4 real changes made)

. replace farm3_size = farm3_size*0.64 if farm3_unit==3
(14 real changes made)

. replace farm3_size = farm3_size*0.64 if farm3_unit==4
(0 real changes made)

. replace farm3_size =. if farm3_size==0
(1 real change made, 1 to missing)

. replace farm4_size = farm4_size/10000 if farm4_unit==2
(1 real change made)

. replace farm4_size = farm4_size*0.64 if farm4_unit==3
(8 real changes made)

. replace farm4_size = farm4_size*0.64 if farm4_unit==4
(0 real changes made)

. 
. *label variables
. lab var assistant "Name of the assistant performing the survey"

. lab var date "Date the survey was taken"

. lab var treatment_d "Treatment participants was assigned to"

. lab def treat_lab 1 "Treatment 1" 2 "Treatment 2" 4 "Control", replace

. lab val treatment_d treat_lab

. lab var phase_d "Which phase of the PES did the participant complete?"

. lab def phase_lab 1 "Phase 1" 2 "Phase 2" 8 "None", replace

. lab val phase_d phase_lab

. lab var panel_d "Panel data on motivations available"

. lab var time "Time of the survey"
variable time not found
r(111);

end of do-file

r(111);

. tab year

       year |      Freq.     Percent        Cum.
------------+-----------------------------------
       2018 |        203      100.00      100.00
------------+-----------------------------------
      Total |        203      100.00

. do "C:\Users\istei\AppData\Local\Temp\STDcbc_000000.tmp"

. *--------------------------------------------------------------------------------------
. * SCRIPT: 01_clean_generate.do
. * PURPOSE: cleans the raw excel data and generates additional variables for analysis
. *--------------------------------------------------------------------------------------
. 
. *----------------------------
. * 1) Import excel dataset and cleaning
. *----------------------------
. clear

. import excel  "$working_ANALYSIS/data/psa_data.xlsx", firstrow
(106 vars, 203 obs)

. 
. *Correcting data entry errors with help of colombian team
. replace farms_n =. if id==96
(1 real change made, 1 to missing)

. replace farm1_size =. if id==10 
(1 real change made, 1 to missing)

. replace farm1_size =. if id==235
(1 real change made, 1 to missing)

. replace farm2_unit =1 if id==221
(1 real change made)

. replace payment_n =. if id==15
(1 real change made, 1 to missing)

. replace donation_n = 0 if donation_n==.
(14 real changes made)

. replace income_n = 18000 if id==172
(1 real change made)

. replace income_n = 18000 if id==411 & donation_n==2000
(1 real change made)

. replace household_income=. if id==10
(1 real change made, 1 to missing)

. replace household_income=. if id==96
(1 real change made, 1 to missing)

. replace household_income=500000 if id==97
(1 real change made)

. replace household_income=. if id==142
(1 real change made, 1 to missing)

. replace household_income=. if id==226 & treatment_d==2
(1 real change made, 1 to missing)

. 
. 
. *redefine data (adjust unit size)
. replace farm1_size = farm1_size/10000 if farm1_unit==2
(5 real changes made)

. replace farm1_size = farm1_size*0.64 if farm1_unit==3
(71 real changes made)

. replace farm1_size = farm1_size*0.64 if farm1_unit==4
(0 real changes made)

. replace farm2_size = farm2_size/10000 if farm2_unit==2
(2 real changes made)

. replace farm2_size = farm2_size*0.64 if farm2_unit==3
(32 real changes made)

. replace farm2_size = farm2_size*0.64 if farm2_unit==4
(0 real changes made)

. replace farm2_size =. if farm2_size==0
(1 real change made, 1 to missing)

. replace farm3_size = farm3_size/10000 if farm3_unit==2
(4 real changes made)

. replace farm3_size = farm3_size*0.64 if farm3_unit==3
(14 real changes made)

. replace farm3_size = farm3_size*0.64 if farm3_unit==4
(0 real changes made)

. replace farm3_size =. if farm3_size==0
(1 real change made, 1 to missing)

. replace farm4_size = farm4_size/10000 if farm4_unit==2
(1 real change made)

. replace farm4_size = farm4_size*0.64 if farm4_unit==3
(8 real changes made)

. replace farm4_size = farm4_size*0.64 if farm4_unit==4
(0 real changes made)

. 
. *label variables
. lab var assistant "Name of the assistant performing the survey"

. lab var date "Date the survey was taken"

. lab var treatment_d "Treatment participants was assigned to"

. lab def treat_lab 1 "Treatment 1" 2 "Treatment 2" 4 "Control", replace

. lab val treatment_d treat_lab

. lab var phase_d "Which phase of the PES did the participant complete?"

. lab def phase_lab 1 "Phase 1" 2 "Phase 2" 8 "None", replace

. lab val phase_d phase_lab

. lab var panel_d "Panel data on motivations available"

. lab var place_survey "Place where the survey was performed"

. lab var remember_d "remember_d=1 if the participant remembers participating in the PES programme"

. lab var land_mun "Municipality on which the land that participated in the programme is located"

. lab var payment_rem_d "payment_rem=1 if the participan recalls the amount of payments he/she recived"

. lab var payment_n "The number of payments given to the participant during the programme."

. lab var payment_t "Total amount of money payed to the participant during the porgramme"

. lab var payment_u "For what did the participant use the money"

. lab var know_part "know_part=1 if the person knows other people that have participated in the programme"
note: label truncated to 80 characters

. lab var know_part_n "Number of people that the participan knows that have participated too in the programme"
note: label truncated to 80 characters

. lab var participate_w "Way of Participation in the programme design/adjustment"

. lab var participate_o_d "participate_o=1 if the person knows that there are other people still receiving the programme benefits."
note: label truncated to 80 characters

. lab var selection_op "Opinion on the selection of participants of the programme. (open ended)"

. lab var selection_f "Perceived fairness of participant selection process."

. lab def selection_lab 1 "Not fair" 2 "" 3 "" 4 "totally fair" 5 "Don't know", replace

. lab val selection_f selection_lab

. lab var p_satisfaction "Satisfaction with the programme."

. lab def satisfaction_lab 1 "Not satisfied" 2 "" 3 "" 4 "totally satisfied" 5 "Don't know", replace

. lab val p_satisfaction satisfaction_lab

. lab var p_people_d "Knows people currently in the pregramme"

. lab var p_people_n "Number of people known who are currently in the programme."

. lab var donation_d "donation_d=1 if the person wants to do a donation"

. lab var donation_org "Donation Organisation"

. lab def donation_lab 1 "TropenBos" 2 "Gaia" 3 "Omacha" 4 "Random", replace

. lab val donation_org donation_lab

. lab var donation_org_r "Randomly chosen Donation Organisation."

. lab def donation_rdm_lab 1 "TrompenBos" 2 "Gaia" 3 "Omacha", replace

. lab val donation_org_r donation_rdm_lab

. lab var donation_n "Amount donated by the person to the selected organisation"

. lab var donation_tot "Amount the organisation receives as a donation = (donation_n *2)"

. lab var income_n "Amount of money the person keeps after donation."

. lab var tropenbos_d "tropenbos_d=1 if the person knows about TropenBos"

. lab var tropenbos_1 "What does the person knows about TropenBos?"

. lab var gaia_d "gaia_d=1 if the person knows about Gaia"

. lab var gaia_1 "What does the person knows about Gaia?"

. lab var omacha_d "omacha_d=1 if the person knows about Omacha"

. lab var omacha_1 "What does the person knows about Omacha?"

. lab var donation_ngo "Donation to NGO"

. lab def donation_lab 1 "Never" 2 "Once" 3 "Many times", replace

. lab val donation_ngo donation_lab

. lab var donation_40k_d "donation_40k_d=1 if they would have donated all if given 40000 instead of 20000"

. lab var donation_80k_d "donation_80k_d=1 if they would have donated all if given 80000 instead of 20000"

. lab var donation_100k_d "donation_100k_d=1 if they would have donated all if given 100000 instead of 20000"
note: label truncated to 80 characters

. lab var regret_forest "Regret if I damage the forest"

. lab def agree_disagree 1 "Totally disagree" 2 "Disagree" 3 "Agree" 4 "Totally agree", replace

. lab val regret_forest agree_disagree

. lab var deforestation "There is very little we can do to reduce deforestation."

. lab val deforestation agree_disagree

. lab var farms_n "Total number of farms owned by the person"

. lab var farm1_size "Size of farm 1"

. lab var farm1_unit "Units of famr1_size"

. lab def unit_lab 1 "ha" 2 "m2" 3 "fanegada" 4 "cuadras" 5 "Don't know", replace

. lab val farm1_unit unit_lab

. lab var farm2_size "Size of farm 2"

. lab var farm2_unit "Units of famr2_size"

. lab val farm2_unit unit_lab

. lab var farm3_size "Size of farm 3"

. lab var farm3_unit "Units of famr3_size"

. lab val farm3_unit unit_lab

. lab var farm4_size "Size of farm 4"

. lab var farm4_unit "Units of famr4_size"

. lab val farm4_unit unit_lab

. lab var cut_trees_d "cut_trees_d=1 if the person  has cut trees or forest after leaving the programme"

. lab var cut_trees_n "amount of trees or ha of forest cut"

. lab var cut_trees_u "Units of cut_trees_n"

. lab var enjoy_care "Joy from taking care of the Forest"

. lab val enjoy_care agree_disagree

. lab var polspace "Political and community participation"

. lab val residence "Current Residence of the participant"
"Current Residence of the participant invalid name
r(198);

end of do-file

r(198);

. do "C:\Users\istei\AppData\Local\Temp\STDcbc_000000.tmp"

. lab var residence "Current Residence of the participant"

. lab def residence_lab 1 "Farm (payments)" 2 "City" 3 "Town" 4 "Other farm(no payments)", replace

. lab val residence residence_lab

. lab var neighbors "The people closest to me would be upset with me if I knock down the forest."

. lab val neighbors agree_disagree

. lab var econ_activity "Main economic activity"

. lab def income_lab 1 "Agriculture" 2 "Cattlemen" 3 "Merchant" 4 "Employee" 5 "Laborer" 6 "Other", replace

. lab val econ_activity income_lab

. lab var econ_activity_6 "Economic activity of the person if econ_activity==6 (Other)"

. lab var econ_depend "Number of persons economically dependent of him/her"

. lab var control_publicw "Control over public workers"

. lab val control_publicw agree_disagree

. lab var id_age "Age of the participant"

. lab var id_sex "id_sex=1 woman"

. lab var proud_forest "I feel proud to take care of the forest."

. lab val proud_forest agree_disagree

. lab var id_educ_household "The highest level of education achieved by the people in the household"

. lab def edu_lab 1 "None" 2 "Incomplete primary" 3 "Complete primary" 4 "Incomplete secondary" 5 "Complete secondary" 6 "Incomplete technical" 7 "Com
> plete technical" 8 "Incomplete professional" 9 "Complete professional" 10 "Incomplete graduate" 11 "Complete graduate", replace

. lab val id_educ_household edu_lab

. lab var id_educ "The highest level of education achieved by the person"

. lab val id_educ edu_lab

. lab var care_forest "Take care of the forest only if paid."

. lab val care_forest agree_disagree

. lab var civicorg_d "Civic Organisation Participation (Dummy)"

. lab var civicorg "Description of which civic organisation the person participates in"

. lab var civicorg_y "Year since the person has been participating in the civic organisation."

. lab var civicorg_part "Civic Organisation Participation"

. lab def org_lab 1 "very little" 2 "a little" 3 "actively" 4 "very actively", replace

. lab val civicorg_part org_lab

. lab var pruductiveorg_d "Productive Organisation Participation (Dummy)"

. lab var pruductiveorg "Description of which productive organisation the person participates in"

. lab var pruductiveorg_y "Year since the person has been participating in the productive organisation."

. lab var pruductiveorg_part "Productive Organisation Participation"

. lab val pruductiveorg_part org_lab

. lab var guilt_forest "Guilt from damaging the forest"

. lab val guilt_forest agree_disagree

. lab var neighbors_critic "My neighbors would criticize me if I damage the forest."

. lab val neighbors_critic agree_disagree

. lab var household_income "Household monthly income in COP"

. lab var responsibility_gov "I believe that in the long term, citizens are responsible for bad government at national and local levels"
note: label truncated to 80 characters

. lab val responsibility_gov agree_disagree

. lab var activity_income "Activity that produces the highest income"

. lab var fine_forest "I do not damage the forest for fear of fines that the environmental authority can give me."
note: label truncated to 80 characters

. lab val fine_forest agree_disagree

. lab var noprotect_forest "There is no point in protecting the forest."

. lab val noprotect_forest agree_disagree

. lab var trust_people "You can trust most people."

. lab def likert5 1 "Strongly disagree" 2 "Disagree" 3 "Neither" 4 "Agree" 5 "Strongly agree", replace

. lab val trust_people likert5

. lab var trust_townpeople "Trust in people from town/neighborhood"

. lab val trust_townpeople likert5

. lab var trust_family "Trust people from family only"
variable trust_family not found
r(111);

end of do-file

r(111);

. do "C:\Users\istei\AppData\Local\Temp\STDcbc_000000.tmp"

. lab var trust_familiy "Trust people from family only"

. lab val trust_family likert5
variable trust_family not found
r(111);

end of do-file

r(111);

. do "C:\Users\istei\AppData\Local\Temp\STDcbc_000000.tmp"

. lab val trust_familiy likert5

. lab var community_activ "Participation in Community activities"

. lab def ca_lab 1 "Never" 2 "Everyday" 3 "Once a week" 4 "Once a month" 5 "Couple times a year", replace

. lab val community_activ ca_lab

. lab var community_activ_1 "community_activ_1=1 if the participation mas VOLUNTARY"

. lab var community_activ_2 "community_activ_2=1 if the participation mas VOLUNTARY"

. lab var community_activ_3 "community_activ_3=1 if the participation mas VOLUNTARY"

. lab var cedula "Cedula (National ID)"
variable cedula not found
r(111);

end of do-file

r(111);

. do "C:\Users\istei\AppData\Local\Temp\STDcbc_000000.tmp"

. lab var id_cedula "Cedula (National ID)"

. lab var know_nonpart "know_nonpart=1 if he/she knows a person with farms/land that have not participated in the program"
note: label truncated to 80 characters

. lab var know_prog_d "know_prog_d=1 if the person knows the programme"

. lab var know_prog "What does the person knows about the programme (open text)"

. lab var apply_prog_d "apply_prog_d=1 if the person applied to the programme"

. lab var prog_selection "Reason why the person did not get selected into the programme, according to them. (open text)"
note: label truncated to 80 characters

. lab var noapply_prog "Reason for not applying to the programme"

. lab def reason_lab 1 "Did not know" 2 "Did not meet requirements" 3 "Application process very difficult" 4 "found out too late" 5 "no trust" 6 "not 
> interestest" 7 "other"

. lab noapply_prog_1  "Reason for not applying to the programme: the person did not know the programme"
invalid syntax
r(198);

end of do-file

r(198);

. do "C:\Users\istei\AppData\Local\Temp\STDcbc_000000.tmp"

. lab var noapply_prog_1  "Reason for not applying to the programme: the person did not know the programme"

. lab var noapply_prog_2  "Reason for not applying to the programme: the person did not meet the requirements"
note: label truncated to 80 characters

. lab var noapply_prog_3  "Reason for not applying to the programme: 'The application or the process was very difficult'"
note: label truncated to 80 characters

. lab var noapply_prog_4  "Reason for not applying to the programme: the person found out when it was too late."
note: label truncated to 80 characters

. lab var noapply_prog_5  "Reason for not applying to the programme: the person did NOT trust the programme"

. lab var noapply_prog_6  "Reason for not applying to the programme: the person was NOT interested in the programme"
note: label truncated to 80 characters

. lab var noapply_prog_7  "Reason for not applying to the programme: Other"

. 
. 
end of do-file

. do "C:\Users\istei\AppData\Local\Temp\STDcbc_000000.tmp"

. *--------------------------------------------------------------------------------------
. * SCRIPT: 01_clean_generate.do
. * PURPOSE: cleans the raw excel data and generates additional variables for analysis
. *--------------------------------------------------------------------------------------
. 
. *----------------------------
. * 1) Import excel dataset and cleaning
. *----------------------------
. clear

. import excel  "$working_ANALYSIS/data/psa_data.xlsx", firstrow
(106 vars, 203 obs)

. 
. *Correcting data entry errors with help of colombian team
. replace farms_n =. if id==96
(1 real change made, 1 to missing)

. replace farm1_size =. if id==10 
(1 real change made, 1 to missing)

. replace farm1_size =. if id==235
(1 real change made, 1 to missing)

. replace farm2_unit =1 if id==221
(1 real change made)

. replace payment_n =. if id==15
(1 real change made, 1 to missing)

. replace donation_n = 0 if donation_n==.
(14 real changes made)

. replace income_n = 18000 if id==172
(1 real change made)

. replace income_n = 18000 if id==411 & donation_n==2000
(1 real change made)

. replace household_income=. if id==10
(1 real change made, 1 to missing)

. replace household_income=. if id==96
(1 real change made, 1 to missing)

. replace household_income=500000 if id==97
(1 real change made)

. replace household_income=. if id==142
(1 real change made, 1 to missing)

. replace household_income=. if id==226 & treatment_d==2
(1 real change made, 1 to missing)

. 
. 
. *redefine data (adjust unit size)
. replace farm1_size = farm1_size/10000 if farm1_unit==2
(5 real changes made)

. replace farm1_size = farm1_size*0.64 if farm1_unit==3
(71 real changes made)

. replace farm1_size = farm1_size*0.64 if farm1_unit==4
(0 real changes made)

. replace farm2_size = farm2_size/10000 if farm2_unit==2
(2 real changes made)

. replace farm2_size = farm2_size*0.64 if farm2_unit==3
(32 real changes made)

. replace farm2_size = farm2_size*0.64 if farm2_unit==4
(0 real changes made)

. replace farm2_size =. if farm2_size==0
(1 real change made, 1 to missing)

. replace farm3_size = farm3_size/10000 if farm3_unit==2
(4 real changes made)

. replace farm3_size = farm3_size*0.64 if farm3_unit==3
(14 real changes made)

. replace farm3_size = farm3_size*0.64 if farm3_unit==4
(0 real changes made)

. replace farm3_size =. if farm3_size==0
(1 real change made, 1 to missing)

. replace farm4_size = farm4_size/10000 if farm4_unit==2
(1 real change made)

. replace farm4_size = farm4_size*0.64 if farm4_unit==3
(8 real changes made)

. replace farm4_size = farm4_size*0.64 if farm4_unit==4
(0 real changes made)

. 
. *label variables
. lab var assistant "Name of the assistant performing the survey"

. lab var date "Date the survey was taken"

. lab var treatment_d "Treatment participants was assigned to"

. lab def treat_lab 1 "Treatment 1" 2 "Treatment 2" 4 "Control", replace

. lab val treatment_d treat_lab

. lab var phase_d "Which phase of the PES did the participant complete?"

. lab def phase_lab 1 "Phase 1" 2 "Phase 2" 8 "None", replace

. lab val phase_d phase_lab

. lab var panel_d "Panel data on motivations available"

. lab var place_survey "Place where the survey was performed"

. lab var remember_d "remember_d=1 if the participant remembers participating in the PES programme"

. lab var land_mun "Municipality on which the land that participated in the programme is located"

. lab var payment_rem_d "payment_rem=1 if the participan recalls the amount of payments he/she recived"

. lab var payment_n "The number of payments given to the participant during the programme."

. lab var payment_t "Total amount of money payed to the participant during the porgramme"

. lab var payment_u "For what did the participant use the money"

. lab var know_part "know_part=1 if the person knows other people that have participated in the programme"
note: label truncated to 80 characters

. lab var know_part_n "Number of people that the participan knows that have participated too in the programme"
note: label truncated to 80 characters

. lab var participate_w "Way of Participation in the programme design/adjustment"

. lab var participate_o_d "participate_o=1 if the person knows that there are other people still receiving the programme benefits."
note: label truncated to 80 characters

. lab var selection_op "Opinion on the selection of participants of the programme. (open ended)"

. lab var selection_f "Perceived fairness of participant selection process."

. lab def selection_lab 1 "Not fair" 2 "" 3 "" 4 "totally fair" 5 "Don't know", replace

. lab val selection_f selection_lab

. lab var p_satisfaction "Satisfaction with the programme."

. lab def satisfaction_lab 1 "Not satisfied" 2 "" 3 "" 4 "totally satisfied" 5 "Don't know", replace

. lab val p_satisfaction satisfaction_lab

. lab var p_people_d "Knows people currently in the pregramme"

. lab var p_people_n "Number of people known who are currently in the programme."

. lab var donation_d "donation_d=1 if the person wants to do a donation"

. lab var donation_org "Donation Organisation"

. lab def donation_lab 1 "TropenBos" 2 "Gaia" 3 "Omacha" 4 "Random", replace

. lab val donation_org donation_lab

. lab var donation_org_r "Randomly chosen Donation Organisation."

. lab def donation_rdm_lab 1 "TrompenBos" 2 "Gaia" 3 "Omacha", replace

. lab val donation_org_r donation_rdm_lab

. lab var donation_n "Amount donated by the person to the selected organisation"

. lab var donation_tot "Amount the organisation receives as a donation = (donation_n *2)"

. lab var income_n "Amount of money the person keeps after donation."

. lab var tropenbos_d "tropenbos_d=1 if the person knows about TropenBos"

. lab var tropenbos_1 "What does the person knows about TropenBos?"

. lab var gaia_d "gaia_d=1 if the person knows about Gaia"

. lab var gaia_1 "What does the person knows about Gaia?"

. lab var omacha_d "omacha_d=1 if the person knows about Omacha"

. lab var omacha_1 "What does the person knows about Omacha?"

. lab var donation_ngo "Donation to NGO"

. lab def donation_lab 1 "Never" 2 "Once" 3 "Many times", replace

. lab val donation_ngo donation_lab

. lab var donation_40k_d "donation_40k_d=1 if they would have donated all if given 40000 instead of 20000"

. lab var donation_80k_d "donation_80k_d=1 if they would have donated all if given 80000 instead of 20000"

. lab var donation_100k_d "donation_100k_d=1 if they would have donated all if given 100000 instead of 20000"
note: label truncated to 80 characters

. lab var regret_forest "Regret if I damage the forest"

. lab def agree_disagree 1 "Totally disagree" 2 "Disagree" 3 "Agree" 4 "Totally agree", replace

. lab val regret_forest agree_disagree

. lab var deforestation "There is very little we can do to reduce deforestation."

. lab val deforestation agree_disagree

. lab var farms_n "Total number of farms owned by the person"

. lab var farm1_size "Size of farm 1"

. lab var farm1_unit "Units of famr1_size"

. lab def unit_lab 1 "ha" 2 "m2" 3 "fanegada" 4 "cuadras" 5 "Don't know", replace

. lab val farm1_unit unit_lab

. lab var farm2_size "Size of farm 2"

. lab var farm2_unit "Units of famr2_size"

. lab val farm2_unit unit_lab

. lab var farm3_size "Size of farm 3"

. lab var farm3_unit "Units of famr3_size"

. lab val farm3_unit unit_lab

. lab var farm4_size "Size of farm 4"

. lab var farm4_unit "Units of famr4_size"

. lab val farm4_unit unit_lab

. lab var cut_trees_d "cut_trees_d=1 if the person  has cut trees or forest after leaving the programme"

. lab var cut_trees_n "amount of trees or ha of forest cut"

. lab var cut_trees_u "Units of cut_trees_n"

. lab var enjoy_care "Joy from taking care of the Forest"

. lab val enjoy_care agree_disagree

. lab var polspace "Political and community participation"

. lab var residence "Current Residence of the participant"

. lab def residence_lab 1 "Farm (payments)" 2 "City" 3 "Town" 4 "Other farm(no payments)", replace

. lab val residence residence_lab

. lab var neighbors "The people closest to me would be upset with me if I knock down the forest."

. lab val neighbors agree_disagree

. lab var econ_activity "Main economic activity"

. lab def income_lab 1 "Agriculture" 2 "Cattlemen" 3 "Merchant" 4 "Employee" 5 "Laborer" 6 "Other", replace

. lab val econ_activity income_lab

. lab var econ_activity_6 "Economic activity of the person if econ_activity==6 (Other)"

. lab var econ_depend "Number of persons economically dependent of him/her"

. lab var control_publicw "Control over public workers"

. lab val control_publicw agree_disagree

. lab var id_age "Age of the participant"

. lab var id_sex "id_sex=1 woman"

. lab var proud_forest "I feel proud to take care of the forest."

. lab val proud_forest agree_disagree

. lab var id_educ_household "The highest level of education achieved by the people in the household"

. lab def edu_lab 1 "None" 2 "Incomplete primary" 3 "Complete primary" 4 "Incomplete secondary" 5 "Complete secondary" 6 "Incomplete technical" 7 "Com
> plete technical" 8 "Incomplete professional" 9 "Complete professional" 10 "Incomplete graduate" 11 "Complete graduate", replace

. lab val id_educ_household edu_lab

. lab var id_educ "The highest level of education achieved by the person"

. lab val id_educ edu_lab

. lab var care_forest "Take care of the forest only if paid."

. lab val care_forest agree_disagree

. lab var civicorg_d "Civic Organisation Participation (Dummy)"

. lab var civicorg "Description of which civic organisation the person participates in"

. lab var civicorg_y "Year since the person has been participating in the civic organisation."

. lab var civicorg_part "Civic Organisation Participation"

. lab def org_lab 1 "very little" 2 "a little" 3 "actively" 4 "very actively", replace

. lab val civicorg_part org_lab

. lab var pruductiveorg_d "Productive Organisation Participation (Dummy)"

. lab var pruductiveorg "Description of which productive organisation the person participates in"

. lab var pruductiveorg_y "Year since the person has been participating in the productive organisation."

. lab var pruductiveorg_part "Productive Organisation Participation"

. lab val pruductiveorg_part org_lab

. lab var guilt_forest "Guilt from damaging the forest"

. lab val guilt_forest agree_disagree

. lab var neighbors_critic "My neighbors would criticize me if I damage the forest."

. lab val neighbors_critic agree_disagree

. lab var household_income "Household monthly income in COP"

. lab var responsibility_gov "I believe that in the long term, citizens are responsible for bad government at national and local levels"
note: label truncated to 80 characters

. lab val responsibility_gov agree_disagree

. lab var activity_income "Activity that produces the highest income"

. lab var fine_forest "I do not damage the forest for fear of fines that the environmental authority can give me."
note: label truncated to 80 characters

. lab val fine_forest agree_disagree

. lab var noprotect_forest "There is no point in protecting the forest."

. lab val noprotect_forest agree_disagree

. lab var trust_people "You can trust most people."

. lab def likert5 1 "Strongly disagree" 2 "Disagree" 3 "Neither" 4 "Agree" 5 "Strongly agree", replace

. lab val trust_people likert5

. lab var trust_townpeople "Trust in people from town/neighborhood"

. lab val trust_townpeople likert5

. lab var trust_familiy "Trust people from family only"

. lab val trust_familiy likert5

. lab var community_activ "Participation in Community activities"

. lab def ca_lab 1 "Never" 2 "Everyday" 3 "Once a week" 4 "Once a month" 5 "Couple times a year", replace

. lab val community_activ ca_lab

. lab var community_activ_1 "community_activ_1=1 if the participation mas VOLUNTARY"

. lab var community_activ_2 "community_activ_2=1 if the participation mas VOLUNTARY"

. lab var community_activ_3 "community_activ_3=1 if the participation mas VOLUNTARY"

. lab var id_cedula "Cedula (National ID)"

. lab var know_nonpart "know_nonpart=1 if he/she knows a person with farms/land that have not participated in the program"
note: label truncated to 80 characters

. lab var know_prog_d "know_prog_d=1 if the person knows the programme"

. lab var know_prog "What does the person knows about the programme (open text)"

. lab var apply_prog_d "apply_prog_d=1 if the person applied to the programme"

. lab var prog_selection "Reason why the person did not get selected into the programme, according to them. (open text)"
note: label truncated to 80 characters

. lab var noapply_prog "Reason for not applying to the programme"

. lab def reason_lab 1 "Did not know" 2 "Did not meet requirements" 3 "Application process very difficult" 4 "found out too late" 5 "no trust" 6 "not 
> interestest" 7 "other"

. lab var noapply_prog_1  "Reason for not applying to the programme: the person did not know the programme"

. lab var noapply_prog_2  "Reason for not applying to the programme: the person did not meet the requirements"
note: label truncated to 80 characters

. lab var noapply_prog_3  "Reason for not applying to the programme: 'The application or the process was very difficult'"
note: label truncated to 80 characters

. lab var noapply_prog_4  "Reason for not applying to the programme: the person found out when it was too late."
note: label truncated to 80 characters

. lab var noapply_prog_5  "Reason for not applying to the programme: the person did NOT trust the programme"

. lab var noapply_prog_6  "Reason for not applying to the programme: the person was NOT interested in the programme"
note: label truncated to 80 characters

. lab var noapply_prog_7  "Reason for not applying to the programme: Other"

. 
end of do-file

. do "C:\Users\istei\AppData\Local\Temp\STDcbc_000000.tmp"

. lab var id "Unique identifier"

. 
end of do-file

. tab id_name

                                id_name |      Freq.     Percent        Cum.
----------------------------------------+-----------------------------------
                      Abel Ral Perilla |          1        0.49        0.49
                      Adolfo Urrea Daz |          1        0.49        0.99
                     Afranio gil romero |          1        0.49        1.48
                         Alba Pearanda |          1        0.49        1.97
                     Alcibades Malaver |          1        0.49        2.46
                          Alcira Garzn |          1        0.49        2.96
                            Alejandrina |          1        0.49        3.45
                       Alexander Cantor |          1        0.49        3.94
                       Alfonso Martnez |          1        0.49        4.43
              Alirio Romn Rojas Tellez |          1        0.49        4.93
                      Ana Isabel Ovalle |          1        0.49        5.42
                    Ana Lilia Rodrguez |          1        0.49        5.91
         Ana Osoria Beltrn De Velandia |          1        0.49        6.40
          Ana Patricia Cuervo Rodrguez |          1        0.49        6.90
               Andrs Fernando Caldern |          1        0.49        7.39
                         Andrs di mate |          1        0.49        7.88
             Argemiro Ramrez Gutirrez |          1        0.49        8.37
                       Argemiro Saldaa |          1        0.49        8.87
                      Aura Mara Garzn |          1        0.49        9.36
                         Aurora beltran |          1        0.49        9.85
                        Beatriz Morales |          1        0.49       10.34
            Blanca Aurora Pea de Rojas |          1        0.49       10.84
                 Blanca Beatriz Mancera |          1        0.49       11.33
         Blanca Edilma Duarte Velasquez |          1        0.49       11.82
                    Camilo de Francisco |          1        0.49       12.32
                 Carlos Arturo preciado |          1        0.49       12.81
Carlos Castillo en representacin de .. |          1        0.49       13.30
        Carlos Hiplito Vargas Espinoza |          1        0.49       13.79
                Carlos Julio Avellaneda |          1        0.49       14.29
                     Carlos Julio Gmez |          1        0.49       14.78
                     Carlos Julio Rueda |          1        0.49       15.27
            Carlos abel Martnez opegui |          1        0.49       15.76
                  Carmen Elvira Andrade |          1        0.49       16.26
                     Carmen Lilia Gmez |          1        0.49       16.75
                         Cesar Apolinar |          1        0.49       17.24
         Cesar Francisco Salazar Molina |          1        0.49       17.73
  Ciro Daz Lunares hijo Fortunato Daz |          1        0.49       18.23
               Clemente Fajardo Jimnez |          1        0.49       18.72
          Cristian Javier orjuela vento |          1        0.49       19.21
                       Cristina Herrera |          1        0.49       19.70
              Cristbal Villamil Pachn |          1        0.49       20.20
                   Daro Prez Esguerra |          1        0.49       20.69
                        Dionisio Torres |          1        0.49       21.18
                        Domingo Penagos |          1        0.49       21.67
               Doris Margarita Gonzlez |          1        0.49       22.17
                 Dubia Castillo Ramirez |          1        0.49       22.66
           Dustano Jess Beltrn Corts |          1        0.49       23.15
                    Edgar Ruiz Martnez |          1        0.49       23.65
                             Edgar pea |          1        0.49       24.14
                   Elebardo diaz romero |          1        0.49       24.63
                       Elibardo Linares |          1        0.49       25.12
                   Elisabeth gil espejo |          1        0.49       25.62
                        Elver Garibello |          1        0.49       26.11
                         Elas Castillo |          1        0.49       26.60
                             Emma Gmez |          1        0.49       27.09
                Erasmo Pealoza Vasquez |          1        0.49       27.59
                      Ernesto Gutierrez |          1        0.49       28.08
              Euclides Casallas Pedraza |          1        0.49       28.57
                   Fabio Daz Rodrguez |          1        0.49       29.06
         Fabin Dayan Cifuentes Delgado |          1        0.49       29.56
             Fanny Ligia Molina de Cruz |          1        0.49       30.05
        Fernando Arturo Salgado Salgado |          1        0.49       30.54
               Fernando Cortes Martnez |          1        0.49       31.03
           Fidel Angel Caro Castiblanco |          1        0.49       31.53
                         Flaminio Lpez |          1        0.49       32.02
                       Floral o Clavijo |          1        0.49       32.51
                      Florentino Ardila |          1        0.49       33.00
                Gabriel Alberto Flechas |          1        0.49       33.50
             Gerardino Guerrero barrera |          1        0.49       33.99
                         Germn Snchez |          1        0.49       34.48
                   Gladis Borda Palacio |          1        0.49       34.98
                Gladis Novoa de Snchez |          1        0.49       35.47
Gladys Romero en representacin de Fe.. |          1        0.49       35.96
           Gloria Marina Parada  Bustos |          1        0.49       36.45
                         Gonzalo Porras |          1        0.49       36.95
                      Gonzalo Rodrguez |          1        0.49       37.44
                           Gonzalo pea |          1        0.49       37.93
                     Guillermo Buitrago |          1        0.49       38.42
                       Gustavo Chamorro |          1        0.49       38.92
                        Gustavo parraga |          1        0.49       39.41
                  Gustavo prieto santos |          1        0.49       39.90
                      Hernando bejarano |          1        0.49       40.39
                 Hilda pablina Cardenas |          1        0.49       40.89
              Hugo Giovanni Torres Pea |          1        0.49       41.38
              Humberto Torres Rodrguez |          1        0.49       41.87
                        Hctor Gonzlez |          1        0.49       42.36
                          Irma Bejarano |          1        0.49       42.86
                          Irma Bermudez |          1        0.49       43.35
                  Isidoro Romero Vargas |          1        0.49       43.84
                          Ismael Flores |          1        0.49       44.33
                   Jairo Vargas Giraldo |          1        0.49       44.83
                          Javier Romero |          1        0.49       45.32
                   Jess Alfonso Garzn |          1        0.49       45.81
                    John henry guerrero |          1        0.49       46.31
                 Jorge Alejandro Moreno |          1        0.49       46.80
                    Jorge Enrique pardo |          1        0.49       47.29
         Jorge Reneth Hernndez Bonilla |          1        0.49       47.78
               Jose reyes Ramrez das. |          1        0.49       48.28
                   Josu Barrero Gamboa |          1        0.49       48.77
                   Jos Armando Subieta |          1        0.49       49.26
                    Jos Avelino Urrego |          1        0.49       49.75
                          Jos Buitrago |          1        0.49       50.25
                   Jos Daniel Gonzlez |          1        0.49       50.74
                     Jos Danilo Pineda |          1        0.49       51.23
                    Jos Danilo Trivio |          1        0.49       51.72
                   Jos Efran Gonzlez |          1        0.49       52.22
                  Jos Guillermo prieto |          1        0.49       52.71
                   Jos Ignacio Jimnez |          1        0.49       53.20
                    Jos Ignacio Rivera |          1        0.49       53.69
                       Jos Joel Acosta |          1        0.49       54.19
            Jos Manuel Rodrguez ngel |          1        0.49       54.68
                     Jos Reyes Snchez |          1        0.49       55.17
          Jos de Jess Pedraza Herrera |          1        0.49       55.67
                       Jos lucio Borda |          1        0.49       56.16
                     Jos lvaro Garzn |          1        0.49       56.65
                      Juan Camilo Rocha |          1        0.49       57.14
                     Juan Leguzamo roa |          1        0.49       57.64
               Juan Manuel Beltrn diaz |          1        0.49       58.13
                Juan de la cruz Morales |          1        0.49       58.62
               Judith Morales Gutirrez |          1        0.49       59.11
                      Julia Elsa Pulido |          1        0.49       59.61
                           Julia Ovalle |          1        0.49       60.10
                           Julio flrez |          1        0.49       60.59
                     Kristine von arnim |          1        0.49       61.08
                          Laura Rugeles |          1        0.49       61.58
                         Laureano Parra |          1        0.49       62.07
                  Leonardo Nieto Acosta |          1        0.49       62.56
                    Leopoldo Pez Bello |          1        0.49       63.05
                  Luis Alberto Castillo |          1        0.49       63.55
                    Luis Alberto pinzn |          1        0.49       64.04
                   Luis Alfonso Quiroga |          1        0.49       64.53
                    Luis Alonso Otalora |          1        0.49       65.02
                  Luis Antonio Gonzlez |          1        0.49       65.52
                     Luis Antonio Matiz |          1        0.49       66.01
               Luis Antonio Vega Castro |          1        0.49       66.50
             Luis Francisco Castiblanco |          1        0.49       67.00
                   Luis gregorio flrez |          1        0.49       67.49
                     Luis lvaro Segura |          1        0.49       67.98
                      Luz Marina Moreno |          1        0.49       68.47
                 Luz Mary moreno correa |          1        0.49       68.97
                     Luz Neli Rodrguez |          1        0.49       69.46
                      Luz miriam romero |          1        0.49       69.95
           Manuel Alberto Gmez Herrera |          1        0.49       70.44
                   Manuel Antonio Ramos |          1        0.49       70.94
                   Manuel Enrique Pardo |          1        0.49       71.43
                          Manuel Rincn |          1        0.49       71.92
                    Margarita Gutirrez |          1        0.49       72.41
                         Marinela Arias |          1        0.49       72.91
                Martha Isabel Rodrguez |          1        0.49       73.40
                         Martha Quiroga |          1        0.49       73.89
                          Martn Chacon |          1        0.49       74.38
        Mara Elena Bejarano de Snchez |          1        0.49       74.88
                       Mara Genis Daz |          1        0.49       75.37
         Mara Guillermina Rojas Torres |          1        0.49       75.86
    Mara Rosalba Rodrguez de Gonzales |          1        0.49       76.35
                   Mara Teresa Arvalo |          1        0.49       76.85
                           Mara Torres |          1        0.49       77.34
                           Mauro Romero |          1        0.49       77.83
                  Maximo Israel Ramrez |          1        0.49       78.33
                Miguel Alberto Palencia |          1        0.49       78.82
          Miguel Alfonso Beltrn urrego |          1        0.49       79.31
             Miguel ngel Aguilar Arias |          1        0.49       79.80
                  Mireya Salcedo Garzn |          1        0.49       80.30
       Miriam Yaneth Martnez Baracaldo |          1        0.49       80.79
          Mnica Rosa Cullar Bouraglia |          1        0.49       81.28
               Nelson Joaqun Rodriguez |          1        0.49       81.77
Nestor chavarrio en representacin An.. |          1        0.49       82.27
                         Nohora Artavia |          1        0.49       82.76
       Nstor Alberto Benavides Caicedo |          1        0.49       83.25
                        Olga Montenegro |          1        0.49       83.74
                  Oliverio parra prieto |          1        0.49       84.24
           Omar Antnio Gonzlez Rivera |          1        0.49       84.73
Orlando Cubillos hermano de Sonia Cub.. |          1        0.49       85.22
                  Oscar Alberto Camacho |          1        0.49       85.71
                    Pablo Emilio Moreno |          1        0.49       86.21
                   Pedro Antonio Acosta |          1        0.49       86.70
            Pedro Antonio Pardo Machado |          1        0.49       87.19
                           Pedro Flores |          1        0.49       87.68
                     Pedro Mara Ortega |          1        0.49       88.18
             Pedro Pablo bonilla pulido |          1        0.49       88.67
            Plinio Vidal Garcia Beltrn |          1        0.49       89.16
      Rafael Heraclio Bermudez Gonzales |          1        0.49       89.66
               Rafael Jimenez Velazquez |          1        0.49       90.15
                          Rebeca Moreno |          1        0.49       90.64
                        Ricardo Agudelo |          1        0.49       91.13
    Rigoberto Enrique Hernndez bonilla |          1        0.49       91.63
                         Rosalba Ovalle |          1        0.49       92.12
                      Rosalba Rodrguez |          1        0.49       92.61
                 Samuel Fajardo Gimnez |          1        0.49       93.10
                        Saul colmenares |          1        0.49       93.60
                           Sal Morales |          1        0.49       94.09
                           Serafn Mora |          1        0.49       94.58
                  Sonia Elina Gutierrez |          1        0.49       95.07
               Victor Rodrguez Beltrn |          1        0.49       95.57
               Vitalino Bohrquez Bello |          1        0.49       96.06
            Wiesner Daro Snchez Chaco |          1        0.49       96.55
            William encizar cruz limate |          1        0.49       97.04
                    Wilmer Andrs Gmez |          1        0.49       97.54
                          Wilson pineda |          1        0.49       98.03
                    Yolanda Sosa Torres |          1        0.49       98.52
                    Yury Paola Gonzalez |          1        0.49       99.01
                  lvaro bejarano smith |          1        0.49       99.51
               ngel Gilberto Velzquez |          1        0.49      100.00
----------------------------------------+-----------------------------------
                                  Total |        203      100.00

. tab treatment_d

  Treatment |
participant |
      s was |
assigned to |      Freq.     Percent        Cum.
------------+-----------------------------------
Treatment 1 |         60       29.56       29.56
Treatment 2 |         63       31.03       60.59
    Control |         80       39.41      100.00
------------+-----------------------------------
      Total |        203      100.00

. tab participate_d

participate |
         _d |      Freq.     Percent        Cum.
------------+-----------------------------------
          0 |        118       95.93       95.93
          1 |          5        4.07      100.00
------------+-----------------------------------
      Total |        123      100.00

. do "C:\Users\istei\AppData\Local\Temp\STDcbc_000000.tmp"

. lab var participate_d "participate_d=1 if the person participated in the programme design or adjustment"

. 
end of do-file

. tab donation_all

donation_al |
          l |      Freq.     Percent        Cum.
------------+-----------------------------------
          0 |         36       41.86       41.86
          1 |         50       58.14      100.00
------------+-----------------------------------
      Total |         86      100.00

. do "C:\Users\istei\AppData\Local\Temp\STDcbc_000000.tmp"

. lab var donation_all "donation_all=1 if the person donated all th money given to him/her"

. 
end of do-file

. do "C:\Users\istei\AppData\Local\Temp\STDcbc_000000.tmp"

. gen all =0

. replace all=1 if donation_n == 20000
(50 real changes made)

. 
end of do-file

. do "C:\Users\istei\AppData\Local\Temp\STDcbc_000000.tmp"

. tab all donation_all

           | donation_all=1 if the
           | person donated all th
           |    money given to
           |        him/her
       all |         0          1 |     Total
-----------+----------------------+----------
         0 |        36          0 |        36 
         1 |         0         50 |        50 
-----------+----------------------+----------
     Total |        36         50 |        86 

. 
end of do-file

. do "C:\Users\istei\AppData\Local\Temp\STDcbc_000000.tmp"

. *--------------------------------------------------------------------------------------
. * SCRIPT: 01_clean_generate.do
. * PURPOSE: cleans the raw excel data and generates additional variables for analysis
. *--------------------------------------------------------------------------------------
. 
. *----------------------------
. * 1) Import excel dataset and cleaning
. *----------------------------
. clear

. import excel  "$working_ANALYSIS/data/psa_data.xlsx", firstrow
(106 vars, 203 obs)

. 
. *Correcting data entry errors with help of colombian team
. replace farms_n =. if id==96
(1 real change made, 1 to missing)

. replace farm1_size =. if id==10 
(1 real change made, 1 to missing)

. replace farm1_size =. if id==235
(1 real change made, 1 to missing)

. replace farm2_unit =1 if id==221
(1 real change made)

. replace payment_n =. if id==15
(1 real change made, 1 to missing)

. replace donation_n = 0 if donation_n==.
(14 real changes made)

. replace income_n = 18000 if id==172
(1 real change made)

. replace income_n = 18000 if id==411 & donation_n==2000
(1 real change made)

. replace household_income=. if id==10
(1 real change made, 1 to missing)

. replace household_income=. if id==96
(1 real change made, 1 to missing)

. replace household_income=500000 if id==97
(1 real change made)

. replace household_income=. if id==142
(1 real change made, 1 to missing)

. replace household_income=. if id==226 & treatment_d==2
(1 real change made, 1 to missing)

. 
. 
. *redefine data (adjust unit size)
. replace farm1_size = farm1_size/10000 if farm1_unit==2
(5 real changes made)

. replace farm1_size = farm1_size*0.64 if farm1_unit==3
(71 real changes made)

. replace farm1_size = farm1_size*0.64 if farm1_unit==4
(0 real changes made)

. replace farm2_size = farm2_size/10000 if farm2_unit==2
(2 real changes made)

. replace farm2_size = farm2_size*0.64 if farm2_unit==3
(32 real changes made)

. replace farm2_size = farm2_size*0.64 if farm2_unit==4
(0 real changes made)

. replace farm2_size =. if farm2_size==0
(1 real change made, 1 to missing)

. replace farm3_size = farm3_size/10000 if farm3_unit==2
(4 real changes made)

. replace farm3_size = farm3_size*0.64 if farm3_unit==3
(14 real changes made)

. replace farm3_size = farm3_size*0.64 if farm3_unit==4
(0 real changes made)

. replace farm3_size =. if farm3_size==0
(1 real change made, 1 to missing)

. replace farm4_size = farm4_size/10000 if farm4_unit==2
(1 real change made)

. replace farm4_size = farm4_size*0.64 if farm4_unit==3
(8 real changes made)

. replace farm4_size = farm4_size*0.64 if farm4_unit==4
(0 real changes made)

. 
. *label variables
. lab var id "Unique identifier"

. lab var id_name "Participant name"

. lab var assistant "Name of the assistant performing the survey"

. lab var date "Date the survey was taken"

. lab var treatment_d "Treatment participants was assigned to"

. lab def treat_lab 1 "Treatment 1" 2 "Treatment 2" 4 "Control", replace

. lab val treatment_d treat_lab

. lab var phase_d "Which phase of the PES did the participant complete?"

. lab def phase_lab 1 "Phase 1" 2 "Phase 2" 8 "None", replace

. lab val phase_d phase_lab

. lab var panel_d "Panel data on motivations available"

. lab var place_survey "Place where the survey was performed"

. lab var remember_d "remember_d=1 if the participant remembers participating in the PES programme"

. lab var land_mun "Municipality on which the land that participated in the programme is located"

. lab var payment_rem_d "payment_rem=1 if the participan recalls the amount of payments he/she recived"

. lab var payment_n "The number of payments given to the participant during the programme."

. lab var payment_t "Total amount of money payed to the participant during the porgramme"

. lab var payment_u "For what did the participant use the money"

. lab var know_part "know_part=1 if the person knows other people that have participated in the programme"
note: label truncated to 80 characters

. lab var know_part_n "Number of people that the participan knows that have participated too in the programme"
note: label truncated to 80 characters

. lab var participate_d "participate_d=1 if the person participated in the programme design or adjustment"

. lab var participate_w "Way of Participation in the programme design/adjustment"

. lab var participate_o_d "participate_o=1 if the person knows that there are other people still receiving the programme benefits."
note: label truncated to 80 characters

. lab var selection_op "Opinion on the selection of participants of the programme. (open ended)"

. lab var selection_f "Perceived fairness of participant selection process."

. lab def selection_lab 1 "Not fair" 2 "" 3 "" 4 "totally fair" 5 "Don't know", replace

. lab val selection_f selection_lab

. lab var p_satisfaction "Satisfaction with the programme."

. lab def satisfaction_lab 1 "Not satisfied" 2 "" 3 "" 4 "totally satisfied" 5 "Don't know", replace

. lab val p_satisfaction satisfaction_lab

. lab var p_people_d "Knows people currently in the pregramme"

. lab var p_people_n "Number of people known who are currently in the programme."

. lab var donation_d "donation_d=1 if the person wants to do a donation"

. lab var donation_org "Donation Organisation"

. lab def donation_lab 1 "TropenBos" 2 "Gaia" 3 "Omacha" 4 "Random", replace

. lab val donation_org donation_lab

. lab var donation_org_r "Randomly chosen Donation Organisation."

. lab def donation_rdm_lab 1 "TrompenBos" 2 "Gaia" 3 "Omacha", replace

. lab val donation_org_r donation_rdm_lab

. lab var donation_n "Amount donated by the person to the selected organisation"

. lab var donation_tot "Amount the organisation receives as a donation = (donation_n *2)"

. lab var income_n "Amount of money the person keeps after donation."

. lab var tropenbos_d "tropenbos_d=1 if the person knows about TropenBos"

. lab var tropenbos_1 "What does the person knows about TropenBos?"

. lab var gaia_d "gaia_d=1 if the person knows about Gaia"

. lab var gaia_1 "What does the person knows about Gaia?"

. lab var omacha_d "omacha_d=1 if the person knows about Omacha"

. lab var omacha_1 "What does the person knows about Omacha?"

. lab var donation_ngo "Donation to NGO"

. lab def donation_lab 1 "Never" 2 "Once" 3 "Many times", replace

. lab val donation_ngo donation_lab

. lab var donation_all "donation_all=1 if the person donated all th money given to him/her"

. lab var donation_40k_d "donation_40k_d=1 if they would have donated all if given 40000 instead of 20000"

. lab var donation_80k_d "donation_80k_d=1 if they would have donated all if given 80000 instead of 20000"

. lab var donation_100k_d "donation_100k_d=1 if they would have donated all if given 100000 instead of 20000"
note: label truncated to 80 characters

. lab var regret_forest "Regret if I damage the forest"

. lab def agree_disagree 1 "Totally disagree" 2 "Disagree" 3 "Agree" 4 "Totally agree", replace

. lab val regret_forest agree_disagree

. lab var deforestation "There is very little we can do to reduce deforestation."

. lab val deforestation agree_disagree

. lab var farms_n "Total number of farms owned by the person"

. lab var farm1_size "Size of farm 1"

. lab var farm1_unit "Units of famr1_size"

. lab def unit_lab 1 "ha" 2 "m2" 3 "fanegada" 4 "cuadras" 5 "Don't know", replace

. lab val farm1_unit unit_lab

. lab var farm2_size "Size of farm 2"

. lab var farm2_unit "Units of famr2_size"

. lab val farm2_unit unit_lab

. lab var farm3_size "Size of farm 3"

. lab var farm3_unit "Units of famr3_size"

. lab val farm3_unit unit_lab

. lab var farm4_size "Size of farm 4"

. lab var farm4_unit "Units of famr4_size"

. lab val farm4_unit unit_lab

. lab var cut_trees_d "cut_trees_d=1 if the person  has cut trees or forest after leaving the programme"

. lab var cut_trees_n "amount of trees or ha of forest cut"

. lab var cut_trees_u "Units of cut_trees_n"

. lab var enjoy_care "Joy from taking care of the Forest"

. lab val enjoy_care agree_disagree

. lab var polspace "Political and community participation"

. lab var residence "Current Residence of the participant"

. lab def residence_lab 1 "Farm (payments)" 2 "City" 3 "Town" 4 "Other farm(no payments)", replace

. lab val residence residence_lab

. lab var neighbors "The people closest to me would be upset with me if I knock down the forest."

. lab val neighbors agree_disagree

. lab var econ_activity "Main economic activity"

. lab def income_lab 1 "Agriculture" 2 "Cattlemen" 3 "Merchant" 4 "Employee" 5 "Laborer" 6 "Other", replace

. lab val econ_activity income_lab

. lab var econ_activity_6 "Economic activity of the person if econ_activity==6 (Other)"

. lab var econ_depend "Number of persons economically dependent of him/her"

. lab var control_publicw "Control over public workers"

. lab val control_publicw agree_disagree

. lab var id_age "Age of the participant"

. lab var id_sex "id_sex=1 woman"

. lab var proud_forest "I feel proud to take care of the forest."

. lab val proud_forest agree_disagree

. lab var id_educ_household "The highest level of education achieved by the people in the household"

. lab def edu_lab 1 "None" 2 "Incomplete primary" 3 "Complete primary" 4 "Incomplete secondary" 5 "Complete secondary" 6 "Incomplete technical" 7 "Com
> plete technical" 8 "Incomplete professional" 9 "Complete professional" 10 "Incomplete graduate" 11 "Complete graduate", replace

. lab val id_educ_household edu_lab

. lab var id_educ "The highest level of education achieved by the person"

. lab val id_educ edu_lab

. lab var care_forest "Take care of the forest only if paid."

. lab val care_forest agree_disagree

. lab var civicorg_d "Civic Organisation Participation (Dummy)"

. lab var civicorg "Description of which civic organisation the person participates in"

. lab var civicorg_y "Year since the person has been participating in the civic organisation."

. lab var civicorg_part "Civic Organisation Participation"

. lab def org_lab 1 "very little" 2 "a little" 3 "actively" 4 "very actively", replace

. lab val civicorg_part org_lab

. lab var pruductiveorg_d "Productive Organisation Participation (Dummy)"

. lab var pruductiveorg "Description of which productive organisation the person participates in"

. lab var pruductiveorg_y "Year since the person has been participating in the productive organisation."

. lab var pruductiveorg_part "Productive Organisation Participation"

. lab val pruductiveorg_part org_lab

. lab var guilt_forest "Guilt from damaging the forest"

. lab val guilt_forest agree_disagree

. lab var neighbors_critic "My neighbors would criticize me if I damage the forest."

. lab val neighbors_critic agree_disagree

. lab var household_income "Household monthly income in COP"

. lab var responsibility_gov "I believe that in the long term, citizens are responsible for bad government at national and local levels"
note: label truncated to 80 characters

. lab val responsibility_gov agree_disagree

. lab var activity_income "Activity that produces the highest income"

. lab var fine_forest "I do not damage the forest for fear of fines that the environmental authority can give me."
note: label truncated to 80 characters

. lab val fine_forest agree_disagree

. lab var noprotect_forest "There is no point in protecting the forest."

. lab val noprotect_forest agree_disagree

. lab var trust_people "You can trust most people."

. lab def likert5 1 "Strongly disagree" 2 "Disagree" 3 "Neither" 4 "Agree" 5 "Strongly agree", replace

. lab val trust_people likert5

. lab var trust_townpeople "Trust in people from town/neighborhood"

. lab val trust_townpeople likert5

. lab var trust_familiy "Trust people from family only"

. lab val trust_familiy likert5

. lab var community_activ "Participation in Community activities"

. lab def ca_lab 1 "Never" 2 "Everyday" 3 "Once a week" 4 "Once a month" 5 "Couple times a year", replace

. lab val community_activ ca_lab

. lab var community_activ_1 "community_activ_1=1 if the participation mas VOLUNTARY"

. lab var community_activ_2 "community_activ_2=1 if the participation mas VOLUNTARY"

. lab var community_activ_3 "community_activ_3=1 if the participation mas VOLUNTARY"

. lab var id_cedula "Cedula (National ID)"

. lab var know_nonpart "know_nonpart=1 if he/she knows a person with farms/land that have not participated in the program"
note: label truncated to 80 characters

. lab var know_prog_d "know_prog_d=1 if the person knows the programme"

. lab var know_prog "What does the person knows about the programme (open text)"

. lab var apply_prog_d "apply_prog_d=1 if the person applied to the programme"

. lab var prog_selection "Reason why the person did not get selected into the programme, according to them. (open text)"
note: label truncated to 80 characters

. lab var noapply_prog "Reason for not applying to the programme"

. lab def reason_lab 1 "Did not know" 2 "Did not meet requirements" 3 "Application process very difficult" 4 "found out too late" 5 "no trust" 6 "not 
> interestest" 7 "other"

. lab var noapply_prog_1  "Reason for not applying to the programme: the person did not know the programme"

. lab var noapply_prog_2  "Reason for not applying to the programme: the person did not meet the requirements"
note: label truncated to 80 characters

. lab var noapply_prog_3  "Reason for not applying to the programme: 'The application or the process was very difficult'"
note: label truncated to 80 characters

. lab var noapply_prog_4  "Reason for not applying to the programme: the person found out when it was too late."
note: label truncated to 80 characters

. lab var noapply_prog_5  "Reason for not applying to the programme: the person did NOT trust the programme"

. lab var noapply_prog_6  "Reason for not applying to the programme: the person was NOT interested in the programme"
note: label truncated to 80 characters

. lab var noapply_prog_7  "Reason for not applying to the programme: Other"

. 
. 
. 
. 
. *----------------------------------
. * 2) Generate additional variables
. *----------------------------------
. *total land size if farmer has more farms
. gen land_size = farm1_size if farms_n==1
(79 missing values generated)

. replace land_size = farm1_size + farm2_size  if farms_n==2
(38 real changes made)

. replace land_size = farm1_size + farm2_size + farm3_size  if farms_n==3
(18 real changes made)

. replace land_size = farm1_size + farm2_size + farm3_size + farm4_size  if farms_n>=4
(20 real changes made)

. 
. *female dummy
. gen female =0

. replace female =1 if id_sex==1
(57 real changes made)

. 
. *priming dummy
. gen primed =0

. replace primed =1 if treatment_d==1
(60 real changes made)

. 
. *PES participation dummies
. gen participant=0

. replace participant=1 if phase_d==1 | phase_d==2
(123 real changes made)

. 
. gen phase1 =0

. replace phase1=1 if phase_d==1
(56 real changes made)

. 
. gen phase2 =0

. replace phase2 =1 if phase_d==2
(67 real changes made)

. 
. *interaction phase and treatment
. gen phase1primed = phase1*primed

. 
. gen phase2primed = phase2*primed

. 
. *dummies for all professions and education levels
. gen agricultor =0

. replace agricultor =1 if econ_activity ==1
(66 real changes made)

. gen cattlemen =0

. replace cattlemen =1 if econ_activity ==2
(35 real changes made)

. gen merchant =0

. replace merchant =1 if econ_activity ==3
(12 real changes made)

. gen employee =0

. replace employee =1 if econ_activity ==4
(37 real changes made)

. gen laborer =0

. replace laborer =1 if econ_activity ==5
(2 real changes made)

. gen othereconactivity =0

. replace othereconactivity =1 if econ_activity ==6
(51 real changes made)

. gen housholdnoeducation =0

. replace housholdnoeducation =1 if id_educ_household==1
(1 real change made)

. gen housholdincompleteprim =0

. replace housholdincompleteprim =1 if id_educ_household==2
(9 real changes made)

. gen housholdcompleteprim =0

. replace housholdcompleteprim =1 if id_educ_household==3
(18 real changes made)

. gen housholdincompletesec =0

. replace housholdincompletesec =1 if id_educ_household==4
(11 real changes made)

. gen housholdcompletesec =0

. replace housholdcompletesec =1 if id_educ_household==5
(48 real changes made)

. gen housholdincompletetec =0

. replace housholdincompletetec =1 if id_educ_household==6
(1 real change made)

. gen housholdcompletetec =0

. replace housholdcompletetec =1 if id_educ_household==7
(10 real changes made)

. gen housholdincompleteprof =0

. replace housholdincompleteprof =1 if id_educ_household==8
(18 real changes made)

. gen housholdcompleteprof =0

. replace housholdcompleteprof =1 if id_educ_household==9
(46 real changes made)

. gen housholdincompletegrad =0

. replace housholdincompletegrad =1 if id_educ_household==10
(3 real changes made)

. gen housholdcompletegrad =0

. replace housholdcompletegrad =1 if id_educ_household==11
(38 real changes made)

. gen noeducation =0

. replace noeducation =1 if id_educ==1
(1 real change made)

. gen incompleteprim =0

. replace incompleteprim =1 if id_educ==2
(49 real changes made)

. gen completeprim =0

. replace completeprim =1 if id_educ==3
(43 real changes made)

. gen incompletesec =0

. replace incompletesec =1 if id_educ==4
(23 real changes made)

. gen completesec =0

. replace completesec =1 if id_educ==5
(17 real changes made)

. gen incompletetec =0

. replace incompletetec =1 if id_educ==6
(3 real changes made)

. gen completetec =0

. replace completetec =1 if id_educ==7
(18 real changes made)

. gen incompleteprof =0

. replace incompleteprof =1 if id_educ==8
(3 real changes made)

. gen completeprof =0

. replace completeprof =1 if id_educ==9
(24 real changes made)

. gen incompletegrad =0

. replace incompletegrad =1 if id_educ==10
(1 real change made)

. gen completegrad =0

. replace completegrad =1 if id_educ==11
(21 real changes made)

. 
. *donation experience
. gen donnever=0

. replace donnever = 1 if donation_ngo==1
(155 real changes made)

. gen dononce=0

. replace dononce = 1 if donation_ngo==2
(19 real changes made)

. gen donmany=0

. replace donmany = 1 if donation_ngo==3
(29 real changes made)

. gen knowsNGO =0

. replace knowsNGO =1 if tropenbos_d==1 | gaia_d==1 | omacha_d==1
(33 real changes made)

. gen donatedbefore =0

. replace donatedbefore=1 if donation_ngo==2 | donation_ngo==3
(48 real changes made)

. 
. 
. *dummies on selection fairness
. gen selectionnotfair =0

. replace selectionnotfair = 1 if selection_f==1
(19 real changes made)

. gen selectionnotveryfair =0

. replace selectionnotveryfair = 1 if selection_f==2
(19 real changes made)

. gen selectionfair =0

. replace selectionfair = 1 if selection_f==3
(24 real changes made)

. gen selectiontotallyfair =0

. replace selectiontotallyfair = 1 if selection_f==4
(41 real changes made)

. gen selectionna=0

. replace selectionna = 1 if selection_f==5
(20 real changes made)

. gen satisfactionnotatall=0

. replace satisfactionnotatall = 1 if p_satisfaction==1
(15 real changes made)

. gen satisfactionnot=0

. replace satisfactionnot = 1 if p_satisfaction==2
(24 real changes made)

. gen satisfactionyes=0

. replace satisfactionyes = 1 if p_satisfaction==3
(34 real changes made)

. gen satisfactiontotally=0

. replace satisfactiontotally = 1 if p_satisfaction==4
(48 real changes made)

. gen satisfactionna=0

. replace satisfactionna = 1 if p_satisfaction==5
(2 real changes made)

. 
. *pooled
. gen satisfied =0

. replace satisfied=1 if p_satisfaction ==3 | p_satisfaction ==4
(82 real changes made)

. gen fairselection =0

. replace fairselection=1 if selection_f ==3 | selection_f ==4
(65 real changes made)

. 
. 
. *dummies for the organisations where subjects want to donate
. gen TropenBos=0

. replace TropenBos=1 if donation_org==1
(53 real changes made)

. gen Gaia=0

. replace Gaia=1 if donation_org==2
(85 real changes made)

. gen Omacha=0

. replace Omacha=1 if donation_org==3
(37 real changes made)

. gen Any=0

. replace Any=1 if donation_org==4
(14 real changes made)

. 
. *pooling different education levels to basic and high education
. gen basiceducation =0

. replace basiceducation =1 if id_educ <=5
(133 real changes made)

. gen higheducation =0

. replace higheducation =1 if id_educ >=6
(70 real changes made)

. gen higheducationprimed = higheducation*primed

. gen basiceductionprimed = basiceducation*primed

. 
. *split subjects by income level
. gen lowincome =0

. replace lowincome=1 if household_income<1000000
(108 real changes made)

. 
. 
. * Save dataset
. save "$working_ANALYSIS/processed/psa_colombia_rdy.dta", replace
(note: file C:\Users\istei\Google Drive\Promotion\1_Projects\PES_Colombia\analysis/processed/psa_colombia_rdy.dta not found)
file C:\Users\istei\Google Drive\Promotion\1_Projects\PES_Colombia\analysis/processed/psa_colombia_rdy.dta saved

. 
. 
. 
. 
.  
. ** EOF
. 
end of do-file

. do "C:\Users\istei\AppData\Local\Temp\STDcbc_000000.tmp"

. *--------------------------------------------------------------------
. * SCRIPT: 02_analysis.do
. * PURPOSE: replicates the tables and figures and saves the results
. *--------------------------------------------------------------------
. 
. *--------------------------------------------------
. * STRUCTURE OF THE DO-FILE
. /*
> 
>         1) Analysis Main Manuscript
>         2) Analysis Supplementary Online Materials
> 
> */
. *--------------------------------------------------
. * Load cleaned dataset
. clear

. use "$working_ANALYSIS/processed/psa_colombia_rdy.dta"

. 
. 
. 
end of do-file

. do "C:\Users\istei\AppData\Local\Temp\STDcbc_000000.tmp"

. hist household_income
(bin=14, start=0, width=1428571.4)

. 
end of do-file

. sum household_income

    Variable |        Obs        Mean    Std. Dev.       Min        Max
-------------+---------------------------------------------------------
household_~e |        199     1934922     3014523          0   2.00e+07

. sum household_income, detail

               Household monthly income in COP
-------------------------------------------------------------
      Percentiles      Smallest
 1%            0              0
 5%       100000              0
10%       200000         100000       Obs                 199
25%       400000         100000       Sum of Wgt.         199

50%       800000                      Mean            1934922
                        Largest       Std. Dev.       3014523
75%      2000000       1.00e+07
90%      5000000       1.50e+07       Variance       9.09e+12
95%     1.00e+07       2.00e+07       Skewness       3.367925
99%     2.00e+07       2.00e+07       Kurtosis       16.97734

. do "C:\Users\istei\AppData\Local\Temp\STDcbc_000000.tmp"

. gen income_hh_ppp = household_income / 1322,16
option 16 not allowed
r(198);

end of do-file

r(198);

. do "C:\Users\istei\AppData\Local\Temp\STDcbc_000000.tmp"

. gen income_hh_ppp = household_income / 1322.16
(4 missing values generated)

. 
end of do-file

. tab income_hh_ppp

income_hh_p |
         pp |      Freq.     Percent        Cum.
------------+-----------------------------------
          0 |          2        1.01        1.01
   75.63381 |         10        5.03        6.03
   113.4507 |          1        0.50        6.53
   151.2676 |         18        9.05       15.58
   181.5211 |          1        0.50       16.08
   226.9014 |         15        7.54       23.62
   264.7184 |          2        1.01       24.62
   302.5352 |          7        3.52       28.14
   340.3521 |          1        0.50       28.64
   378.1691 |         13        6.53       35.18
   453.8029 |         12        6.03       41.21
   513.5536 |          1        0.50       41.71
   529.4367 |          3        1.51       43.22
   544.5634 |          2        1.01       44.22
   567.2536 |          1        0.50       44.72
   582.3804 |          1        0.50       45.23
   589.9437 |          4        2.01       47.24
   595.6919 |          3        1.51       48.74
   595.7675 |          1        0.50       49.25
   605.0705 |          9        4.52       53.77
   680.7043 |          1        0.50       54.27
   756.3381 |         14        7.04       61.31
   907.6057 |          4        2.01       63.32
   983.2396 |          3        1.51       64.82
   1134.507 |         15        7.54       72.36
   1210.141 |          1        0.50       72.86
   1361.409 |          3        1.51       74.37
   1512.676 |          7        3.52       77.89
   1890.845 |          4        2.01       79.90
   2117.747 |          1        0.50       80.40
   2269.014 |          4        2.01       82.41
   2495.916 |          1        0.50       82.91
   2647.183 |          3        1.51       84.42
   3025.353 |          5        2.51       86.93
   3403.521 |          4        2.01       88.94
   3781.691 |          5        2.51       91.46
   4538.029 |          4        2.01       93.47
   5294.367 |          3        1.51       94.97
   7563.381 |          7        3.52       98.49
   11345.07 |          1        0.50       98.99
   15126.76 |          2        1.01      100.00
------------+-----------------------------------
      Total |        199      100.00

. tab household_income

  Household |
    monthly |
  income in |
        COP |      Freq.     Percent        Cum.
------------+-----------------------------------
          0 |          2        1.01        1.01
     100000 |         10        5.03        6.03
     150000 |          1        0.50        6.53
     200000 |         18        9.05       15.58
     240000 |          1        0.50       16.08
     300000 |         15        7.54       23.62
     350000 |          2        1.01       24.62
     400000 |          7        3.52       28.14
     450000 |          1        0.50       28.64
     500000 |         13        6.53       35.18
     600000 |         12        6.03       41.21
     679000 |          1        0.50       41.71
     700000 |          3        1.51       43.22
     720000 |          2        1.01       44.22
     750000 |          1        0.50       44.72
     770000 |          1        0.50       45.23
     780000 |          4        2.01       47.24
     787600 |          3        1.51       48.74
     787700 |          1        0.50       49.25
     800000 |          9        4.52       53.77
     900000 |          1        0.50       54.27
    1000000 |         14        7.04       61.31
    1200000 |          4        2.01       63.32
    1300000 |          3        1.51       64.82
    1500000 |         15        7.54       72.36
    1600000 |          1        0.50       72.86
    1800000 |          3        1.51       74.37
    2000000 |          7        3.52       77.89
    2500000 |          4        2.01       79.90
    2800000 |          1        0.50       80.40
    3000000 |          4        2.01       82.41
    3300000 |          1        0.50       82.91
    3500000 |          3        1.51       84.42
    4000000 |          5        2.51       86.93
    4500000 |          4        2.01       88.94
    5000000 |          5        2.51       91.46
    6000000 |          4        2.01       93.47
    7000000 |          3        1.51       94.97
   1.00e+07 |          7        3.52       98.49
   1.50e+07 |          1        0.50       98.99
   2.00e+07 |          2        1.01      100.00
------------+-----------------------------------
      Total |        199      100.00

. do "C:\Users\istei\AppData\Local\Temp\STDcbc_000000.tmp"

. gen income_hh_ppp_median = 1 if income_hh_ppp >= aux_income_hh_ppp
aux_income_hh_ppp not found
r(111);

end of do-file

r(111);

. do "C:\Users\istei\AppData\Local\Temp\STDcbc_000000.tmp"

. egen aux_income_hh_ppp = median(income_hh_ppp)

. 
end of do-file

. do "C:\Users\istei\AppData\Local\Temp\STDcbc_000000.tmp"

. gen income_hh_ppp_median = 1 if income_hh_ppp >= aux_income_hh_ppp
(98 missing values generated)

.         replace income_hh_ppp_median = 0 if income_hh_ppp < aux_income_hh_ppp 
(98 real changes made)

.         drop aux_income_hh_ppp

. 
end of do-file

. tab income_hh_ppp_median

income_hh_p |
  pp_median |      Freq.     Percent        Cum.
------------+-----------------------------------
          0 |         98       48.28       48.28
          1 |        105       51.72      100.00
------------+-----------------------------------
      Total |        203      100.00

. do "C:\Users\istei\AppData\Local\Temp\STDcbc_000000.tmp"

. *high socioeconomic dummy
. egen aux_income_hh_ppp = median(income_hh_ppp)

. gen high_SES = 1 if income_hh_ppp >= aux_income_hh_ppp
(98 missing values generated)

. replace high_SES = 0 if income_hh_ppp < aux_income_hh_ppp 
(98 real changes made)

. 
end of do-file

. tab aux_income_hh_ppp

aux_income_ |
     hh_ppp |      Freq.     Percent        Cum.
------------+-----------------------------------
   605.0705 |        203      100.00      100.00
------------+-----------------------------------
      Total |        203      100.00

. do "C:\Users\istei\AppData\Local\Temp\STDcbc_000000.tmp"

. drop aux_income_hh_ppp

. 
end of do-file

. do "C:\Users\istei\AppData\Local\Temp\STDcbc_000000.tmp"

. lab var high_SES "Above median household income." 

. 
end of do-file

. tab income_hh_ppp_median

income_hh_p |
  pp_median |      Freq.     Percent        Cum.
------------+-----------------------------------
          0 |         98       48.28       48.28
          1 |        105       51.72      100.00
------------+-----------------------------------
      Total |        203      100.00

. do "C:\Users\istei\Google Drive\Promotion\1_Projects\PES_Colombia\analysis\scripts\01_clean_generate.do"

. *--------------------------------------------------------------------------------------
. * SCRIPT: 01_clean_generate.do
. * PURPOSE: cleans the raw excel data and generates additional variables for analysis
. *--------------------------------------------------------------------------------------
. 
. *----------------------------
. * 1) Import excel dataset and cleaning
. *----------------------------
. clear

. import excel  "$working_ANALYSIS/data/psa_data.xlsx", firstrow
(106 vars, 203 obs)

. 
. *Correcting data entry errors with help of colombian team
. replace farms_n =. if id==96
(1 real change made, 1 to missing)

. replace farm1_size =. if id==10 
(1 real change made, 1 to missing)

. replace farm1_size =. if id==235
(1 real change made, 1 to missing)

. replace farm2_unit =1 if id==221
(1 real change made)

. replace payment_n =. if id==15
(1 real change made, 1 to missing)

. replace donation_n = 0 if donation_n==.
(14 real changes made)

. replace income_n = 18000 if id==172
(1 real change made)

. replace income_n = 18000 if id==411 & donation_n==2000
(1 real change made)

. replace household_income=. if id==10
(1 real change made, 1 to missing)

. replace household_income=. if id==96
(1 real change made, 1 to missing)

. replace household_income=500000 if id==97
(1 real change made)

. replace household_income=. if id==142
(1 real change made, 1 to missing)

. replace household_income=. if id==226 & treatment_d==2
(1 real change made, 1 to missing)

. 
. 
. *redefine data (adjust unit size)
. replace farm1_size = farm1_size/10000 if farm1_unit==2
(5 real changes made)

. replace farm1_size = farm1_size*0.64 if farm1_unit==3
(71 real changes made)

. replace farm1_size = farm1_size*0.64 if farm1_unit==4
(0 real changes made)

. replace farm2_size = farm2_size/10000 if farm2_unit==2
(2 real changes made)

. replace farm2_size = farm2_size*0.64 if farm2_unit==3
(32 real changes made)

. replace farm2_size = farm2_size*0.64 if farm2_unit==4
(0 real changes made)

. replace farm2_size =. if farm2_size==0
(1 real change made, 1 to missing)

. replace farm3_size = farm3_size/10000 if farm3_unit==2
(4 real changes made)

. replace farm3_size = farm3_size*0.64 if farm3_unit==3
(14 real changes made)

. replace farm3_size = farm3_size*0.64 if farm3_unit==4
(0 real changes made)

. replace farm3_size =. if farm3_size==0
(1 real change made, 1 to missing)

. replace farm4_size = farm4_size/10000 if farm4_unit==2
(1 real change made)

. replace farm4_size = farm4_size*0.64 if farm4_unit==3
(8 real changes made)

. replace farm4_size = farm4_size*0.64 if farm4_unit==4
(0 real changes made)

. 
. *label variables
. lab var id "Unique identifier"

. lab var id_name "Participant name"

. lab var assistant "Name of the assistant performing the survey"

. lab var date "Date the survey was taken"

. lab var treatment_d "Treatment participants was assigned to"

. lab def treat_lab 1 "Treatment 1" 2 "Treatment 2" 4 "Control", replace

. lab val treatment_d treat_lab

. lab var phase_d "Which phase of the PES did the participant complete?"

. lab def phase_lab 1 "Phase 1" 2 "Phase 2" 8 "None", replace

. lab val phase_d phase_lab

. lab var panel_d "Panel data on motivations available"

. lab var place_survey "Place where the survey was performed"

. lab var remember_d "remember_d=1 if the participant remembers participating in the PES programme"

. lab var land_mun "Municipality on which the land that participated in the programme is located"

. lab var payment_rem_d "payment_rem=1 if the participan recalls the amount of payments he/she recived"

. lab var payment_n "The number of payments given to the participant during the programme."

. lab var payment_t "Total amount of money payed to the participant during the porgramme"

. lab var payment_u "For what did the participant use the money"

. lab var know_part "know_part=1 if the person knows other people that have participated in the programme"
note: label truncated to 80 characters

. lab var know_part_n "Number of people that the participan knows that have participated too in the programme"
note: label truncated to 80 characters

. lab var participate_d "participate_d=1 if the person participated in the programme design or adjustment"

. lab var participate_w "Way of Participation in the programme design/adjustment"

. lab var participate_o_d "participate_o=1 if the person knows that there are other people still receiving the programme benefits."
note: label truncated to 80 characters

. lab var selection_op "Opinion on the selection of participants of the programme. (open ended)"

. lab var selection_f "Perceived fairness of participant selection process."

. lab def selection_lab 1 "Not fair" 2 "" 3 "" 4 "totally fair" 5 "Don't know", replace

. lab val selection_f selection_lab

. lab var p_satisfaction "Satisfaction with the programme."

. lab def satisfaction_lab 1 "Not satisfied" 2 "" 3 "" 4 "totally satisfied" 5 "Don't know", replace

. lab val p_satisfaction satisfaction_lab

. lab var p_people_d "Knows people currently in the pregramme"

. lab var p_people_n "Number of people known who are currently in the programme."

. lab var donation_d "donation_d=1 if the person wants to do a donation"

. lab var donation_org "Donation Organisation"

. lab def donation_lab 1 "TropenBos" 2 "Gaia" 3 "Omacha" 4 "Random", replace

. lab val donation_org donation_lab

. lab var donation_org_r "Randomly chosen Donation Organisation."

. lab def donation_rdm_lab 1 "TrompenBos" 2 "Gaia" 3 "Omacha", replace

. lab val donation_org_r donation_rdm_lab

. lab var donation_n "Amount donated by the person to the selected organisation"

. lab var donation_tot "Amount the organisation receives as a donation = (donation_n *2)"

. lab var income_n "Amount of money the person keeps after donation."

. lab var tropenbos_d "tropenbos_d=1 if the person knows about TropenBos"

. lab var tropenbos_1 "What does the person knows about TropenBos?"

. lab var gaia_d "gaia_d=1 if the person knows about Gaia"

. lab var gaia_1 "What does the person knows about Gaia?"

. lab var omacha_d "omacha_d=1 if the person knows about Omacha"

. lab var omacha_1 "What does the person knows about Omacha?"

. lab var donation_ngo "Donation to NGO"

. lab def donation_lab 1 "Never" 2 "Once" 3 "Many times", replace

. lab val donation_ngo donation_lab

. lab var donation_all "donation_all=1 if the person donated all th money given to him/her"

. lab var donation_40k_d "donation_40k_d=1 if they would have donated all if given 40000 instead of 20000"

. lab var donation_80k_d "donation_80k_d=1 if they would have donated all if given 80000 instead of 20000"

. lab var donation_100k_d "donation_100k_d=1 if they would have donated all if given 100000 instead of 20000"
note: label truncated to 80 characters

. lab var regret_forest "Regret if I damage the forest"

. lab def agree_disagree 1 "Totally disagree" 2 "Disagree" 3 "Agree" 4 "Totally agree", replace

. lab val regret_forest agree_disagree

. lab var deforestation "There is very little we can do to reduce deforestation."

. lab val deforestation agree_disagree

. lab var farms_n "Total number of farms owned by the person"

. lab var farm1_size "Size of farm 1"

. lab var farm1_unit "Units of famr1_size"

. lab def unit_lab 1 "ha" 2 "m2" 3 "fanegada" 4 "cuadras" 5 "Don't know", replace

. lab val farm1_unit unit_lab

. lab var farm2_size "Size of farm 2"

. lab var farm2_unit "Units of famr2_size"

. lab val farm2_unit unit_lab

. lab var farm3_size "Size of farm 3"

. lab var farm3_unit "Units of famr3_size"

. lab val farm3_unit unit_lab

. lab var farm4_size "Size of farm 4"

. lab var farm4_unit "Units of famr4_size"

. lab val farm4_unit unit_lab

. lab var cut_trees_d "cut_trees_d=1 if the person  has cut trees or forest after leaving the programme"

. lab var cut_trees_n "amount of trees or ha of forest cut"

. lab var cut_trees_u "Units of cut_trees_n"

. lab var enjoy_care "Joy from taking care of the Forest"

. lab val enjoy_care agree_disagree

. lab var polspace "Political and community participation"

. lab var residence "Current Residence of the participant"

. lab def residence_lab 1 "Farm (payments)" 2 "City" 3 "Town" 4 "Other farm(no payments)", replace

. lab val residence residence_lab

. lab var neighbors "The people closest to me would be upset with me if I knock down the forest."

. lab val neighbors agree_disagree

. lab var econ_activity "Main economic activity"

. lab def income_lab 1 "Agriculture" 2 "Cattlemen" 3 "Merchant" 4 "Employee" 5 "Laborer" 6 "Other", replace

. lab val econ_activity income_lab

. lab var econ_activity_6 "Economic activity of the person if econ_activity==6 (Other)"

. lab var econ_depend "Number of persons economically dependent of him/her"

. lab var control_publicw "Control over public workers"

. lab val control_publicw agree_disagree

. lab var id_age "Age of the participant"

. lab var id_sex "id_sex=1 woman"

. lab var proud_forest "I feel proud to take care of the forest."

. lab val proud_forest agree_disagree

. lab var id_educ_household "The highest level of education achieved by the people in the household"

. lab def edu_lab 1 "None" 2 "Incomplete primary" 3 "Complete primary" 4 "Incomplete secondary" 5 "Complete secondary" 6 "Incomplete technical" 7 "Com
> plete technical" 8 "Incomplete professional" 9 "Complete professional" 10 "Incomplete graduate" 11 "Complete graduate", replace

. lab val id_educ_household edu_lab

. lab var id_educ "The highest level of education achieved by the person"

. lab val id_educ edu_lab

. lab var care_forest "Take care of the forest only if paid."

. lab val care_forest agree_disagree

. lab var civicorg_d "Civic Organisation Participation (Dummy)"

. lab var civicorg "Description of which civic organisation the person participates in"

. lab var civicorg_y "Year since the person has been participating in the civic organisation."

. lab var civicorg_part "Civic Organisation Participation"

. lab def org_lab 1 "very little" 2 "a little" 3 "actively" 4 "very actively", replace

. lab val civicorg_part org_lab

. lab var pruductiveorg_d "Productive Organisation Participation (Dummy)"

. lab var pruductiveorg "Description of which productive organisation the person participates in"

. lab var pruductiveorg_y "Year since the person has been participating in the productive organisation."

. lab var pruductiveorg_part "Productive Organisation Participation"

. lab val pruductiveorg_part org_lab

. lab var guilt_forest "Guilt from damaging the forest"

. lab val guilt_forest agree_disagree

. lab var neighbors_critic "My neighbors would criticize me if I damage the forest."

. lab val neighbors_critic agree_disagree

. lab var household_income "Household monthly income in COP"

. lab var responsibility_gov "I believe that in the long term, citizens are responsible for bad government at national and local levels"
note: label truncated to 80 characters

. lab val responsibility_gov agree_disagree

. lab var activity_income "Activity that produces the highest income"

. lab var fine_forest "I do not damage the forest for fear of fines that the environmental authority can give me."
note: label truncated to 80 characters

. lab val fine_forest agree_disagree

. lab var noprotect_forest "There is no point in protecting the forest."

. lab val noprotect_forest agree_disagree

. lab var trust_people "You can trust most people."

. lab def likert5 1 "Strongly disagree" 2 "Disagree" 3 "Neither" 4 "Agree" 5 "Strongly agree", replace

. lab val trust_people likert5

. lab var trust_townpeople "Trust in people from town/neighborhood"

. lab val trust_townpeople likert5

. lab var trust_familiy "Trust people from family only"

. lab val trust_familiy likert5

. lab var community_activ "Participation in Community activities"

. lab def ca_lab 1 "Never" 2 "Everyday" 3 "Once a week" 4 "Once a month" 5 "Couple times a year", replace

. lab val community_activ ca_lab

. lab var community_activ_1 "community_activ_1=1 if the participation mas VOLUNTARY"

. lab var community_activ_2 "community_activ_2=1 if the participation mas VOLUNTARY"

. lab var community_activ_3 "community_activ_3=1 if the participation mas VOLUNTARY"

. lab var id_cedula "Cedula (National ID)"

. lab var know_nonpart "know_nonpart=1 if he/she knows a person with farms/land that have not participated in the program"
note: label truncated to 80 characters

. lab var know_prog_d "know_prog_d=1 if the person knows the programme"

. lab var know_prog "What does the person knows about the programme (open text)"

. lab var apply_prog_d "apply_prog_d=1 if the person applied to the programme"

. lab var prog_selection "Reason why the person did not get selected into the programme, according to them. (open text)"
note: label truncated to 80 characters

. lab var noapply_prog "Reason for not applying to the programme"

. lab def reason_lab 1 "Did not know" 2 "Did not meet requirements" 3 "Application process very difficult" 4 "found out too late" 5 "no trust" 6 "not 
> interestest" 7 "other"

. lab var noapply_prog_1  "Reason for not applying to the programme: the person did not know the programme"

. lab var noapply_prog_2  "Reason for not applying to the programme: the person did not meet the requirements"
note: label truncated to 80 characters

. lab var noapply_prog_3  "Reason for not applying to the programme: 'The application or the process was very difficult'"
note: label truncated to 80 characters

. lab var noapply_prog_4  "Reason for not applying to the programme: the person found out when it was too late."
note: label truncated to 80 characters

. lab var noapply_prog_5  "Reason for not applying to the programme: the person did NOT trust the programme"

. lab var noapply_prog_6  "Reason for not applying to the programme: the person was NOT interested in the programme"
note: label truncated to 80 characters

. lab var noapply_prog_7  "Reason for not applying to the programme: Other"

. 
. 
. 
. 
. *----------------------------------
. * 2) Generate additional variables
. *----------------------------------
. *total land size if farmer has more farms
. gen land_size = farm1_size if farms_n==1
(79 missing values generated)

. replace land_size = farm1_size + farm2_size  if farms_n==2
(38 real changes made)

. replace land_size = farm1_size + farm2_size + farm3_size  if farms_n==3
(18 real changes made)

. replace land_size = farm1_size + farm2_size + farm3_size + farm4_size  if farms_n>=4
(20 real changes made)

. 
. *female dummy
. gen female =0

. replace female =1 if id_sex==1
(57 real changes made)

. 
. *priming dummy
. gen primed =0

. replace primed =1 if treatment_d==1
(60 real changes made)

. 
. *PES participation dummies
. gen participant=0

. replace participant=1 if phase_d==1 | phase_d==2
(123 real changes made)

. 
. gen phase1 =0

. replace phase1=1 if phase_d==1
(56 real changes made)

. 
. gen phase2 =0

. replace phase2 =1 if phase_d==2
(67 real changes made)

. 
. *interaction phase and treatment
. gen phase1primed = phase1*primed

. 
. gen phase2primed = phase2*primed

. 
. *dummies for all professions and education levels
. gen agricultor =0

. replace agricultor =1 if econ_activity ==1
(66 real changes made)

. gen cattlemen =0

. replace cattlemen =1 if econ_activity ==2
(35 real changes made)

. gen merchant =0

. replace merchant =1 if econ_activity ==3
(12 real changes made)

. gen employee =0

. replace employee =1 if econ_activity ==4
(37 real changes made)

. gen laborer =0

. replace laborer =1 if econ_activity ==5
(2 real changes made)

. gen othereconactivity =0

. replace othereconactivity =1 if econ_activity ==6
(51 real changes made)

. gen housholdnoeducation =0

. replace housholdnoeducation =1 if id_educ_household==1
(1 real change made)

. gen housholdincompleteprim =0

. replace housholdincompleteprim =1 if id_educ_household==2
(9 real changes made)

. gen housholdcompleteprim =0

. replace housholdcompleteprim =1 if id_educ_household==3
(18 real changes made)

. gen housholdincompletesec =0

. replace housholdincompletesec =1 if id_educ_household==4
(11 real changes made)

. gen housholdcompletesec =0

. replace housholdcompletesec =1 if id_educ_household==5
(48 real changes made)

. gen housholdincompletetec =0

. replace housholdincompletetec =1 if id_educ_household==6
(1 real change made)

. gen housholdcompletetec =0

. replace housholdcompletetec =1 if id_educ_household==7
(10 real changes made)

. gen housholdincompleteprof =0

. replace housholdincompleteprof =1 if id_educ_household==8
(18 real changes made)

. gen housholdcompleteprof =0

. replace housholdcompleteprof =1 if id_educ_household==9
(46 real changes made)

. gen housholdincompletegrad =0

. replace housholdincompletegrad =1 if id_educ_household==10
(3 real changes made)

. gen housholdcompletegrad =0

. replace housholdcompletegrad =1 if id_educ_household==11
(38 real changes made)

. gen noeducation =0

. replace noeducation =1 if id_educ==1
(1 real change made)

. gen incompleteprim =0

. replace incompleteprim =1 if id_educ==2
(49 real changes made)

. gen completeprim =0

. replace completeprim =1 if id_educ==3
(43 real changes made)

. gen incompletesec =0

. replace incompletesec =1 if id_educ==4
(23 real changes made)

. gen completesec =0

. replace completesec =1 if id_educ==5
(17 real changes made)

. gen incompletetec =0

. replace incompletetec =1 if id_educ==6
(3 real changes made)

. gen completetec =0

. replace completetec =1 if id_educ==7
(18 real changes made)

. gen incompleteprof =0

. replace incompleteprof =1 if id_educ==8
(3 real changes made)

. gen completeprof =0

. replace completeprof =1 if id_educ==9
(24 real changes made)

. gen incompletegrad =0

. replace incompletegrad =1 if id_educ==10
(1 real change made)

. gen completegrad =0

. replace completegrad =1 if id_educ==11
(21 real changes made)

. 
. *donation experience
. gen donnever=0

. replace donnever = 1 if donation_ngo==1
(155 real changes made)

. gen dononce=0

. replace dononce = 1 if donation_ngo==2
(19 real changes made)

. gen donmany=0

. replace donmany = 1 if donation_ngo==3
(29 real changes made)

. gen knowsNGO =0

. replace knowsNGO =1 if tropenbos_d==1 | gaia_d==1 | omacha_d==1
(33 real changes made)

. gen donatedbefore =0

. replace donatedbefore=1 if donation_ngo==2 | donation_ngo==3
(48 real changes made)

. 
. 
. *dummies on selection fairness
. gen selectionnotfair =0

. replace selectionnotfair = 1 if selection_f==1
(19 real changes made)

. gen selectionnotveryfair =0

. replace selectionnotveryfair = 1 if selection_f==2
(19 real changes made)

. gen selectionfair =0

. replace selectionfair = 1 if selection_f==3
(24 real changes made)

. gen selectiontotallyfair =0

. replace selectiontotallyfair = 1 if selection_f==4
(41 real changes made)

. gen selectionna=0

. replace selectionna = 1 if selection_f==5
(20 real changes made)

. gen satisfactionnotatall=0

. replace satisfactionnotatall = 1 if p_satisfaction==1
(15 real changes made)

. gen satisfactionnot=0

. replace satisfactionnot = 1 if p_satisfaction==2
(24 real changes made)

. gen satisfactionyes=0

. replace satisfactionyes = 1 if p_satisfaction==3
(34 real changes made)

. gen satisfactiontotally=0

. replace satisfactiontotally = 1 if p_satisfaction==4
(48 real changes made)

. gen satisfactionna=0

. replace satisfactionna = 1 if p_satisfaction==5
(2 real changes made)

. 
. *pooled
. gen satisfied =0

. replace satisfied=1 if p_satisfaction ==3 | p_satisfaction ==4
(82 real changes made)

. gen fairselection =0

. replace fairselection=1 if selection_f ==3 | selection_f ==4
(65 real changes made)

. 
. 
. *dummies for the organisations where subjects want to donate
. gen TropenBos=0

. replace TropenBos=1 if donation_org==1
(53 real changes made)

. gen Gaia=0

. replace Gaia=1 if donation_org==2
(85 real changes made)

. gen Omacha=0

. replace Omacha=1 if donation_org==3
(37 real changes made)

. gen Any=0

. replace Any=1 if donation_org==4
(14 real changes made)

. 
. *pooling different education levels to basic and high education
. gen basiceducation =0

. replace basiceducation =1 if id_educ <=5
(133 real changes made)

. gen higheducation =0

. replace higheducation =1 if id_educ >=6
(70 real changes made)

. gen higheducationprimed = higheducation*primed

. gen basiceductionprimed = basiceducation*primed

. 
. *check income levels and convert to PPP
. sum household_income, detail

               Household monthly income in COP
-------------------------------------------------------------
      Percentiles      Smallest
 1%            0              0
 5%       100000              0
10%       200000         100000       Obs                 199
25%       400000         100000       Sum of Wgt.         199

50%       800000                      Mean            1934922
                        Largest       Std. Dev.       3014523
75%      2000000       1.00e+07
90%      5000000       1.50e+07       Variance       9.09e+12
95%     1.00e+07       2.00e+07       Skewness       3.367925
99%     2.00e+07       2.00e+07       Kurtosis       16.97734

. *PPP conversion factor from World Bank for Colombia in 2018 = 1322,16
. gen income_hh_ppp = household_income / 1322.16
(4 missing values generated)

. 
. *high socioeconomic dummy
. egen aux_income_hh_ppp = median(income_hh_ppp)

. gen high_SES = 1 if income_hh_ppp >= aux_income_hh_ppp
(98 missing values generated)

. replace high_SES = 0 if income_hh_ppp < aux_income_hh_ppp
(98 real changes made)

. lab var high_SES "Above median household income." 

. drop aux_income_hh_ppp

. 
. * Save dataset
. save "$working_ANALYSIS/processed/psa_colombia_rdy.dta", replace
file C:\Users\istei\Google Drive\Promotion\1_Projects\PES_Colombia\analysis/processed/psa_colombia_rdy.dta saved

. 
. 
. 
. 
.  
. ** EOF
. 
end of do-file

. do "C:\Users\istei\AppData\Local\Temp\STDcbc_000000.tmp"

. *--------------------------------------------------------------------
. * SCRIPT: 02_analysis.do
. * PURPOSE: replicates the tables and figures and saves the results
. *--------------------------------------------------------------------
. 
. *--------------------------------------------------
. * STRUCTURE OF THE DO-FILE
. /*
> 
>         1) Analysis Main Manuscript
>         2) Analysis Supplementary Online Materials
> 
> */
. *--------------------------------------------------
. * Load cleaned dataset
. clear

. use "$working_ANALYSIS/processed/psa_colombia_rdy.dta"

. 
. 
. 
end of do-file

. do "C:\Users\istei\AppData\Local\Temp\STDcbc_000000.tmp"

. hist income_hh_ppp
(bin=14, start=0, width=1080.483)

. 
end of do-file

. do "C:\Users\istei\AppData\Local\Temp\STDcbc_000000.tmp"

. *--------------------------------------------------------------------------------------
. * SCRIPT: 01_clean_generate.do
. * PURPOSE: cleans the raw excel data and generates additional variables for analysis
. *--------------------------------------------------------------------------------------
. 
. *----------------------------
. * 1) Import excel dataset and cleaning
. *----------------------------
. clear

. import excel  "$working_ANALYSIS/data/psa_data.xlsx", firstrow
(106 vars, 203 obs)

. 
. *Correcting data entry errors with help of colombian team
. replace farms_n =. if id==96
(1 real change made, 1 to missing)

. replace farm1_size =. if id==10 
(1 real change made, 1 to missing)

. replace farm1_size =. if id==235
(1 real change made, 1 to missing)

. replace farm2_unit =1 if id==221
(1 real change made)

. replace payment_n =. if id==15
(1 real change made, 1 to missing)

. replace donation_n = 0 if donation_n==.
(14 real changes made)

. replace income_n = 18000 if id==172
(1 real change made)

. replace income_n = 18000 if id==411 & donation_n==2000
(1 real change made)

. replace household_income=. if id==10
(1 real change made, 1 to missing)

. replace household_income=. if id==96
(1 real change made, 1 to missing)

. replace household_income=500000 if id==97
(1 real change made)

. replace household_income=. if id==142
(1 real change made, 1 to missing)

. replace household_income=. if id==226 & treatment_d==2
(1 real change made, 1 to missing)

. 
. 
. *redefine data (adjust unit size)
. replace farm1_size = farm1_size/10000 if farm1_unit==2
(5 real changes made)

. replace farm1_size = farm1_size*0.64 if farm1_unit==3
(71 real changes made)

. replace farm1_size = farm1_size*0.64 if farm1_unit==4
(0 real changes made)

. replace farm2_size = farm2_size/10000 if farm2_unit==2
(2 real changes made)

. replace farm2_size = farm2_size*0.64 if farm2_unit==3
(32 real changes made)

. replace farm2_size = farm2_size*0.64 if farm2_unit==4
(0 real changes made)

. replace farm2_size =. if farm2_size==0
(1 real change made, 1 to missing)

. replace farm3_size = farm3_size/10000 if farm3_unit==2
(4 real changes made)

. replace farm3_size = farm3_size*0.64 if farm3_unit==3
(14 real changes made)

. replace farm3_size = farm3_size*0.64 if farm3_unit==4
(0 real changes made)

. replace farm3_size =. if farm3_size==0
(1 real change made, 1 to missing)

. replace farm4_size = farm4_size/10000 if farm4_unit==2
(1 real change made)

. replace farm4_size = farm4_size*0.64 if farm4_unit==3
(8 real changes made)

. replace farm4_size = farm4_size*0.64 if farm4_unit==4
(0 real changes made)

. 
. *label variables
. lab var id "Unique identifier"

. lab var id_name "Participant name"

. lab var assistant "Name of the assistant performing the survey"

. lab var date "Date the survey was taken"

. lab var treatment_d "Treatment participants was assigned to"

. lab def treat_lab 1 "Treatment 1" 2 "Treatment 2" 4 "Control", replace

. lab val treatment_d treat_lab

. lab var phase_d "Which phase of the PES did the participant complete?"

. lab def phase_lab 1 "Phase 1" 2 "Phase 2" 8 "None", replace

. lab val phase_d phase_lab

. lab var panel_d "Panel data on motivations available"

. lab var place_survey "Place where the survey was performed"

. lab var remember_d "remember_d=1 if the participant remembers participating in the PES programme"

. lab var land_mun "Municipality on which the land that participated in the programme is located"

. lab var payment_rem_d "payment_rem=1 if the participan recalls the amount of payments he/she recived"

. lab var payment_n "The number of payments given to the participant during the programme."

. lab var payment_t "Total amount of money payed to the participant during the porgramme"

. lab var payment_u "For what did the participant use the money"

. lab var know_part "know_part=1 if the person knows other people that have participated in the programme"
note: label truncated to 80 characters

. lab var know_part_n "Number of people that the participan knows that have participated too in the programme"
note: label truncated to 80 characters

. lab var participate_d "participate_d=1 if the person participated in the programme design or adjustment"

. lab var participate_w "Way of Participation in the programme design/adjustment"

. lab var participate_o_d "participate_o=1 if the person knows that there are other people still receiving the programme benefits."
note: label truncated to 80 characters

. lab var selection_op "Opinion on the selection of participants of the programme. (open ended)"

. lab var selection_f "Perceived fairness of participant selection process."

. lab def selection_lab 1 "Not fair" 2 "" 3 "" 4 "totally fair" 5 "Don't know", replace

. lab val selection_f selection_lab

. lab var p_satisfaction "Satisfaction with the programme."

. lab def satisfaction_lab 1 "Not satisfied" 2 "" 3 "" 4 "totally satisfied" 5 "Don't know", replace

. lab val p_satisfaction satisfaction_lab

. lab var p_people_d "Knows people currently in the pregramme"

. lab var p_people_n "Number of people known who are currently in the programme."

. lab var donation_d "donation_d=1 if the person wants to do a donation"

. lab var donation_org "Donation Organisation"

. lab def donation_lab 1 "TropenBos" 2 "Gaia" 3 "Omacha" 4 "Random", replace

. lab val donation_org donation_lab

. lab var donation_org_r "Randomly chosen Donation Organisation."

. lab def donation_rdm_lab 1 "TrompenBos" 2 "Gaia" 3 "Omacha", replace

. lab val donation_org_r donation_rdm_lab

. lab var donation_n "Amount donated by the person to the selected organisation"

. lab var donation_tot "Amount the organisation receives as a donation = (donation_n *2)"

. lab var income_n "Amount of money the person keeps after donation."

. lab var tropenbos_d "tropenbos_d=1 if the person knows about TropenBos"

. lab var tropenbos_1 "What does the person knows about TropenBos?"

. lab var gaia_d "gaia_d=1 if the person knows about Gaia"

. lab var gaia_1 "What does the person knows about Gaia?"

. lab var omacha_d "omacha_d=1 if the person knows about Omacha"

. lab var omacha_1 "What does the person knows about Omacha?"

. lab var donation_ngo "Donation to NGO"

. lab def donation_lab 1 "Never" 2 "Once" 3 "Many times", replace

. lab val donation_ngo donation_lab

. lab var donation_all "donation_all=1 if the person donated all th money given to him/her"

. lab var donation_40k_d "donation_40k_d=1 if they would have donated all if given 40000 instead of 20000"

. lab var donation_80k_d "donation_80k_d=1 if they would have donated all if given 80000 instead of 20000"

. lab var donation_100k_d "donation_100k_d=1 if they would have donated all if given 100000 instead of 20000"
note: label truncated to 80 characters

. lab var regret_forest "Regret if I damage the forest"

. lab def agree_disagree 1 "Totally disagree" 2 "Disagree" 3 "Agree" 4 "Totally agree", replace

. lab val regret_forest agree_disagree

. lab var deforestation "There is very little we can do to reduce deforestation."

. lab val deforestation agree_disagree

. lab var farms_n "Total number of farms owned by the person"

. lab var farm1_size "Size of farm 1"

. lab var farm1_unit "Units of famr1_size"

. lab def unit_lab 1 "ha" 2 "m2" 3 "fanegada" 4 "cuadras" 5 "Don't know", replace

. lab val farm1_unit unit_lab

. lab var farm2_size "Size of farm 2"

. lab var farm2_unit "Units of famr2_size"

. lab val farm2_unit unit_lab

. lab var farm3_size "Size of farm 3"

. lab var farm3_unit "Units of famr3_size"

. lab val farm3_unit unit_lab

. lab var farm4_size "Size of farm 4"

. lab var farm4_unit "Units of famr4_size"

. lab val farm4_unit unit_lab

. lab var cut_trees_d "cut_trees_d=1 if the person  has cut trees or forest after leaving the programme"

. lab var cut_trees_n "amount of trees or ha of forest cut"

. lab var cut_trees_u "Units of cut_trees_n"

. lab var enjoy_care "Joy from taking care of the Forest"

. lab val enjoy_care agree_disagree

. lab var polspace "Political and community participation"

. lab var residence "Current Residence of the participant"

. lab def residence_lab 1 "Farm (payments)" 2 "City" 3 "Town" 4 "Other farm(no payments)", replace

. lab val residence residence_lab

. lab var neighbors "The people closest to me would be upset with me if I knock down the forest."

. lab val neighbors agree_disagree

. lab var econ_activity "Main economic activity"

. lab def income_lab 1 "Agriculture" 2 "Cattlemen" 3 "Merchant" 4 "Employee" 5 "Laborer" 6 "Other", replace

. lab val econ_activity income_lab

. lab var econ_activity_6 "Economic activity of the person if econ_activity==6 (Other)"

. lab var econ_depend "Number of persons economically dependent of him/her"

. lab var control_publicw "Control over public workers"

. lab val control_publicw agree_disagree

. lab var id_age "Age of the participant"

. lab var id_sex "id_sex=1 woman"

. lab var proud_forest "I feel proud to take care of the forest."

. lab val proud_forest agree_disagree

. lab var id_educ_household "The highest level of education achieved by the people in the household"

. lab def edu_lab 1 "None" 2 "Incomplete primary" 3 "Complete primary" 4 "Incomplete secondary" 5 "Complete secondary" 6 "Incomplete technical" 7 "Com
> plete technical" 8 "Incomplete professional" 9 "Complete professional" 10 "Incomplete graduate" 11 "Complete graduate", replace

. lab val id_educ_household edu_lab

. lab var id_educ "The highest level of education achieved by the person"

. lab val id_educ edu_lab

. lab var care_forest "Take care of the forest only if paid."

. lab val care_forest agree_disagree

. lab var civicorg_d "Civic Organisation Participation (Dummy)"

. lab var civicorg "Description of which civic organisation the person participates in"

. lab var civicorg_y "Year since the person has been participating in the civic organisation."

. lab var civicorg_part "Civic Organisation Participation"

. lab def org_lab 1 "very little" 2 "a little" 3 "actively" 4 "very actively", replace

. lab val civicorg_part org_lab

. lab var pruductiveorg_d "Productive Organisation Participation (Dummy)"

. lab var pruductiveorg "Description of which productive organisation the person participates in"

. lab var pruductiveorg_y "Year since the person has been participating in the productive organisation."

. lab var pruductiveorg_part "Productive Organisation Participation"

. lab val pruductiveorg_part org_lab

. lab var guilt_forest "Guilt from damaging the forest"

. lab val guilt_forest agree_disagree

. lab var neighbors_critic "My neighbors would criticize me if I damage the forest."

. lab val neighbors_critic agree_disagree

. lab var household_income "Household monthly income in COP"

. lab var responsibility_gov "I believe that in the long term, citizens are responsible for bad government at national and local levels"
note: label truncated to 80 characters

. lab val responsibility_gov agree_disagree

. lab var activity_income "Activity that produces the highest income"

. lab var fine_forest "I do not damage the forest for fear of fines that the environmental authority can give me."
note: label truncated to 80 characters

. lab val fine_forest agree_disagree

. lab var noprotect_forest "There is no point in protecting the forest."

. lab val noprotect_forest agree_disagree

. lab var trust_people "You can trust most people."

. lab def likert5 1 "Strongly disagree" 2 "Disagree" 3 "Neither" 4 "Agree" 5 "Strongly agree", replace

. lab val trust_people likert5

. lab var trust_townpeople "Trust in people from town/neighborhood"

. lab val trust_townpeople likert5

. lab var trust_familiy "Trust people from family only"

. lab val trust_familiy likert5

. lab var community_activ "Participation in Community activities"

. lab def ca_lab 1 "Never" 2 "Everyday" 3 "Once a week" 4 "Once a month" 5 "Couple times a year", replace

. lab val community_activ ca_lab

. lab var community_activ_1 "community_activ_1=1 if the participation mas VOLUNTARY"

. lab var community_activ_2 "community_activ_2=1 if the participation mas VOLUNTARY"

. lab var community_activ_3 "community_activ_3=1 if the participation mas VOLUNTARY"

. lab var id_cedula "Cedula (National ID)"

. lab var know_nonpart "know_nonpart=1 if he/she knows a person with farms/land that have not participated in the program"
note: label truncated to 80 characters

. lab var know_prog_d "know_prog_d=1 if the person knows the programme"

. lab var know_prog "What does the person knows about the programme (open text)"

. lab var apply_prog_d "apply_prog_d=1 if the person applied to the programme"

. lab var prog_selection "Reason why the person did not get selected into the programme, according to them. (open text)"
note: label truncated to 80 characters

. lab var noapply_prog "Reason for not applying to the programme"

. lab def reason_lab 1 "Did not know" 2 "Did not meet requirements" 3 "Application process very difficult" 4 "found out too late" 5 "no trust" 6 "not 
> interestest" 7 "other"

. lab var noapply_prog_1  "Reason for not applying to the programme: the person did not know the programme"

. lab var noapply_prog_2  "Reason for not applying to the programme: the person did not meet the requirements"
note: label truncated to 80 characters

. lab var noapply_prog_3  "Reason for not applying to the programme: 'The application or the process was very difficult'"
note: label truncated to 80 characters

. lab var noapply_prog_4  "Reason for not applying to the programme: the person found out when it was too late."
note: label truncated to 80 characters

. lab var noapply_prog_5  "Reason for not applying to the programme: the person did NOT trust the programme"

. lab var noapply_prog_6  "Reason for not applying to the programme: the person was NOT interested in the programme"
note: label truncated to 80 characters

. lab var noapply_prog_7  "Reason for not applying to the programme: Other"

. 
. 
. 
. 
. *----------------------------------
. * 2) Generate additional variables
. *----------------------------------
. *total land size if farmer has more farms
. gen land_size = farm1_size if farms_n==1
(79 missing values generated)

. replace land_size = farm1_size + farm2_size  if farms_n==2
(38 real changes made)

. replace land_size = farm1_size + farm2_size + farm3_size  if farms_n==3
(18 real changes made)

. replace land_size = farm1_size + farm2_size + farm3_size + farm4_size  if farms_n>=4
(20 real changes made)

. 
. *female dummy
. gen female =0

. replace female =1 if id_sex==1
(57 real changes made)

. 
. *priming dummy
. gen primed =0

. replace primed =1 if treatment_d==1
(60 real changes made)

. 
. *PES participation dummies
. gen participant=0

. replace participant=1 if phase_d==1 | phase_d==2
(123 real changes made)

. 
. gen phase1 =0

. replace phase1=1 if phase_d==1
(56 real changes made)

. 
. gen phase2 =0

. replace phase2 =1 if phase_d==2
(67 real changes made)

. 
. *interaction phase and treatment
. gen phase1primed = phase1*primed

. 
. gen phase2primed = phase2*primed

. 
. *dummies for all professions and education levels
. gen agricultor =0

. replace agricultor =1 if econ_activity ==1
(66 real changes made)

. gen cattlemen =0

. replace cattlemen =1 if econ_activity ==2
(35 real changes made)

. gen merchant =0

. replace merchant =1 if econ_activity ==3
(12 real changes made)

. gen employee =0

. replace employee =1 if econ_activity ==4
(37 real changes made)

. gen laborer =0

. replace laborer =1 if econ_activity ==5
(2 real changes made)

. gen othereconactivity =0

. replace othereconactivity =1 if econ_activity ==6
(51 real changes made)

. gen housholdnoeducation =0

. replace housholdnoeducation =1 if id_educ_household==1
(1 real change made)

. gen housholdincompleteprim =0

. replace housholdincompleteprim =1 if id_educ_household==2
(9 real changes made)

. gen housholdcompleteprim =0

. replace housholdcompleteprim =1 if id_educ_household==3
(18 real changes made)

. gen housholdincompletesec =0

. replace housholdincompletesec =1 if id_educ_household==4
(11 real changes made)

. gen housholdcompletesec =0

. replace housholdcompletesec =1 if id_educ_household==5
(48 real changes made)

. gen housholdincompletetec =0

. replace housholdincompletetec =1 if id_educ_household==6
(1 real change made)

. gen housholdcompletetec =0

. replace housholdcompletetec =1 if id_educ_household==7
(10 real changes made)

. gen housholdincompleteprof =0

. replace housholdincompleteprof =1 if id_educ_household==8
(18 real changes made)

. gen housholdcompleteprof =0

. replace housholdcompleteprof =1 if id_educ_household==9
(46 real changes made)

. gen housholdincompletegrad =0

. replace housholdincompletegrad =1 if id_educ_household==10
(3 real changes made)

. gen housholdcompletegrad =0

. replace housholdcompletegrad =1 if id_educ_household==11
(38 real changes made)

. gen noeducation =0

. replace noeducation =1 if id_educ==1
(1 real change made)

. gen incompleteprim =0

. replace incompleteprim =1 if id_educ==2
(49 real changes made)

. gen completeprim =0

. replace completeprim =1 if id_educ==3
(43 real changes made)

. gen incompletesec =0

. replace incompletesec =1 if id_educ==4
(23 real changes made)

. gen completesec =0

. replace completesec =1 if id_educ==5
(17 real changes made)

. gen incompletetec =0

. replace incompletetec =1 if id_educ==6
(3 real changes made)

. gen completetec =0

. replace completetec =1 if id_educ==7
(18 real changes made)

. gen incompleteprof =0

. replace incompleteprof =1 if id_educ==8
(3 real changes made)

. gen completeprof =0

. replace completeprof =1 if id_educ==9
(24 real changes made)

. gen incompletegrad =0

. replace incompletegrad =1 if id_educ==10
(1 real change made)

. gen completegrad =0

. replace completegrad =1 if id_educ==11
(21 real changes made)

. 
. *donation experience
. gen donnever=0

. replace donnever = 1 if donation_ngo==1
(155 real changes made)

. gen dononce=0

. replace dononce = 1 if donation_ngo==2
(19 real changes made)

. gen donmany=0

. replace donmany = 1 if donation_ngo==3
(29 real changes made)

. gen knowsNGO =0

. replace knowsNGO =1 if tropenbos_d==1 | gaia_d==1 | omacha_d==1
(33 real changes made)

. gen donatedbefore =0

. replace donatedbefore=1 if donation_ngo==2 | donation_ngo==3
(48 real changes made)

. 
. 
. *dummies on selection fairness
. gen selectionnotfair =0

. replace selectionnotfair = 1 if selection_f==1
(19 real changes made)

. gen selectionnotveryfair =0

. replace selectionnotveryfair = 1 if selection_f==2
(19 real changes made)

. gen selectionfair =0

. replace selectionfair = 1 if selection_f==3
(24 real changes made)

. gen selectiontotallyfair =0

. replace selectiontotallyfair = 1 if selection_f==4
(41 real changes made)

. gen selectionna=0

. replace selectionna = 1 if selection_f==5
(20 real changes made)

. gen satisfactionnotatall=0

. replace satisfactionnotatall = 1 if p_satisfaction==1
(15 real changes made)

. gen satisfactionnot=0

. replace satisfactionnot = 1 if p_satisfaction==2
(24 real changes made)

. gen satisfactionyes=0

. replace satisfactionyes = 1 if p_satisfaction==3
(34 real changes made)

. gen satisfactiontotally=0

. replace satisfactiontotally = 1 if p_satisfaction==4
(48 real changes made)

. gen satisfactionna=0

. replace satisfactionna = 1 if p_satisfaction==5
(2 real changes made)

. 
. *pooled
. gen satisfied =0

. replace satisfied=1 if p_satisfaction ==3 | p_satisfaction ==4
(82 real changes made)

. gen fairselection =0

. replace fairselection=1 if selection_f ==3 | selection_f ==4
(65 real changes made)

. 
. 
. *dummies for the organisations where subjects want to donate
. gen TropenBos=0

. replace TropenBos=1 if donation_org==1
(53 real changes made)

. gen Gaia=0

. replace Gaia=1 if donation_org==2
(85 real changes made)

. gen Omacha=0

. replace Omacha=1 if donation_org==3
(37 real changes made)

. gen Any=0

. replace Any=1 if donation_org==4
(14 real changes made)

. 
. *pooling different education levels to basic and high education
. gen basiceducation =0

. replace basiceducation =1 if id_educ <=5
(133 real changes made)

. gen higheducation =0

. replace higheducation =1 if id_educ >=6
(70 real changes made)

. gen higheducationprimed = higheducation*primed

. gen basiceductionprimed = basiceducation*primed

. 
. *check income levels and convert to PPP
. sum household_income, detail

               Household monthly income in COP
-------------------------------------------------------------
      Percentiles      Smallest
 1%            0              0
 5%       100000              0
10%       200000         100000       Obs                 199
25%       400000         100000       Sum of Wgt.         199

50%       800000                      Mean            1934922
                        Largest       Std. Dev.       3014523
75%      2000000       1.00e+07
90%      5000000       1.50e+07       Variance       9.09e+12
95%     1.00e+07       2.00e+07       Skewness       3.367925
99%     2.00e+07       2.00e+07       Kurtosis       16.97734

. *PPP conversion factor from World Bank for Colombia in 2018 = 1322,16
. gen income_hh_ppp = household_income / 1322.16
(4 missing values generated)

. lab var income_hh_ppp "PPP adjusted monthly household income"

. 
. *high socioeconomic dummy
. egen aux_income_hh_ppp = median(income_hh_ppp)

. gen high_SES = 1 if income_hh_ppp >= aux_income_hh_ppp
(98 missing values generated)

. replace high_SES = 0 if income_hh_ppp < aux_income_hh_ppp
(98 real changes made)

. lab var high_SES "Above median household income." 

. drop aux_income_hh_ppp

. 
. * Save dataset
. save "$working_ANALYSIS/processed/psa_colombia_rdy.dta", replace
file C:\Users\istei\Google Drive\Promotion\1_Projects\PES_Colombia\analysis/processed/psa_colombia_rdy.dta saved

. 
. 
. 
. 
.  
. ** EOF
. 
end of do-file

. do "C:\Users\istei\AppData\Local\Temp\STDcbc_000000.tmp"

. *--------------------------------------------------------------------
. * SCRIPT: 02_analysis.do
. * PURPOSE: replicates the tables and figures and saves the results
. *--------------------------------------------------------------------
. 
. *--------------------------------------------------
. * STRUCTURE OF THE DO-FILE
. /*
> 
>         1) Analysis Main Manuscript
>         2) Analysis Supplementary Online Materials
> 
> */
. *--------------------------------------------------
. * Load cleaned dataset
. clear

. use "$working_ANALYSIS/processed/psa_colombia_rdy.dta"

. 
. 
end of do-file

. do "C:\Users\istei\AppData\Local\Temp\STDcbc_000000.tmp"

. hist income_hh_ppp
(bin=14, start=0, width=1080.483)

. 
end of do-file

. do "C:\Users\istei\AppData\Local\Temp\STDcbc_000000.tmp"

. hist income_hh_ppp, by(phase_d)

. 
end of do-file

. do "C:\Users\istei\AppData\Local\Temp\STDcbc_000000.tmp"

. reg income_hh_ppp i.phase_d, vce(cluster hc3)
variable hc3 not found
r(111);

end of do-file

r(111);

. do "C:\Users\istei\AppData\Local\Temp\STDcbc_000000.tmp"

. reg income_hh_ppp i.phase_d, vce(hc3)

Linear regression                               Number of obs     =        199
                                                F(2, 196)         =       0.68
                                                Prob > F          =     0.5080
                                                R-squared         =     0.0083
                                                Root MSE          =       2282

------------------------------------------------------------------------------
             |             Robust HC3
income_hh_~p |      Coef.   Std. Err.      t    P>|t|     [95% Conf. Interval]
-------------+----------------------------------------------------------------
     phase_d |
    Phase 2  |  -320.5004   399.0969    -0.80   0.423    -1107.576    466.5751
       None  |  -515.9044   443.2686    -1.16   0.246    -1390.093    358.2839
             |
       _cons |    1775.54   337.5982     5.26   0.000     1109.749    2441.331
------------------------------------------------------------------------------

. 
end of do-file

. tab phase_d

Which phase |
 of the PES |
    did the |
participant |
  complete? |      Freq.     Percent        Cum.
------------+-----------------------------------
    Phase 1 |         56       27.59       27.59
    Phase 2 |         67       33.00       60.59
       None |         80       39.41      100.00
------------+-----------------------------------
      Total |        203      100.00

. help reg

. do "C:\Users\istei\AppData\Local\Temp\STDcbc_000000.tmp"

. gr twoway (scatter income_hh_ppp donation_n) (lfitci income_hh_ppp donation_n)

. 
end of do-file

. do "C:\Users\istei\AppData\Local\Temp\STDcbc_000000.tmp"

. gr twoway (scatter income_hh_ppp donation_n) (lfitci income_hh_ppp donation_n), by(phase_d)

. 
end of do-file

. do "C:\Users\istei\AppData\Local\Temp\STDcbc_000000.tmp"

. hist payment_n, by(phase_d)

. 
end of do-file

. do "C:\Users\istei\AppData\Local\Temp\STDcbc_000000.tmp"

. hist payment_n if phase_d <3, by(phase_d)

. 
end of do-file

. do "C:\Users\istei\AppData\Local\Temp\STDcbc_000000.tmp"

. hist payment_t if phase_d <3, by(phase_d)

. 
end of do-file

. do "C:\Users\istei\AppData\Local\Temp\STDcbc_000000.tmp"

. hist payment_n if phase_d <3, by(phase_d)

. 
end of do-file

. tab primed

     primed |      Freq.     Percent        Cum.
------------+-----------------------------------
          0 |        143       70.44       70.44
          1 |         60       29.56      100.00
------------+-----------------------------------
      Total |        203      100.00

. tab primed phase_d

           |  Which phase of the PES did the
           |      participant complete?
    primed |   Phase 1    Phase 2       None |     Total
-----------+---------------------------------+----------
         0 |        30         33         80 |       143 
         1 |        26         34          0 |        60 
-----------+---------------------------------+----------
     Total |        56         67         80 |       203 

. tab phase1primed

phase1prime |
          d |      Freq.     Percent        Cum.
------------+-----------------------------------
          0 |        177       87.19       87.19
          1 |         26       12.81      100.00
------------+-----------------------------------
      Total |        203      100.00

. tab id_cedula

     Cedula |
  (National |
        ID) |      Freq.     Percent        Cum.
------------+-----------------------------------
        166 |          1        0.49        0.49
     173032 |          1        0.49        0.99
     238015 |          1        0.49        1.48
     238399 |          1        0.49        1.97
     256207 |          1        0.49        2.46
     261243 |          1        0.49        2.96
     261899 |          1        0.49        3.45
     275714 |          1        0.49        3.94
     284423 |          1        0.49        4.43
     316583 |          1        0.49        4.93
     316866 |          1        0.49        5.42
     347518 |          1        0.49        5.91
     348643 |          1        0.49        6.40
     349316 |          1        0.49        6.90
     351097 |          1        0.49        7.39
     351103 |          1        0.49        7.88
     351410 |          1        0.49        8.37
     351923 |          1        0.49        8.87
     370607 |          1        0.49        9.36
     371743 |          1        0.49        9.85
     371820 |          1        0.49       10.34
     383693 |          1        0.49       10.84
     410550 |          1        0.49       11.33
     627034 |          1        0.49       11.82
    1138564 |          1        0.49       12.32
    2841832 |          1        0.49       12.81
    2842840 |          1        0.49       13.30
    2842889 |          1        0.49       13.79
    2843285 |          1        0.49       14.29
    2932702 |          1        0.49       14.78
    2940746 |          1        0.49       15.27
    2955664 |          1        0.49       15.76
    2964226 |          1        0.49       16.26
    2964298 |          1        0.49       16.75
    3002116 |          1        0.49       17.24
    3016564 |          1        0.49       17.73
    3017088 |          1        0.49       18.23
    3017171 |          1        0.49       18.72
    3026230 |          1        0.49       19.21
    3026508 |          1        0.49       19.70
    3027225 |          1        0.49       20.20
    3027586 |          1        0.49       20.69
    3028024 |          1        0.49       21.18
    3030272 |          1        0.49       21.67
    3032310 |          1        0.49       22.17
    3032348 |          1        0.49       22.66
    3032504 |          1        0.49       23.15
    3064534 |          1        0.49       23.65
    3064551 |          1        0.49       24.14
    3069181 |          1        0.49       24.63
    3090095 |          1        0.49       25.12
    3105425 |          1        0.49       25.62
    3108529 |          1        0.49       26.11
    3109553 |          1        0.49       26.60
    3128792 |          1        0.49       27.09
    3128944 |          1        0.49       27.59
    3129268 |          1        0.49       28.08
    3129369 |          1        0.49       28.57
    3151043 |          1        0.49       29.06
    3153377 |          1        0.49       29.56
    3153443 |          1        0.49       30.05
    3154511 |          1        0.49       30.54
    3154650 |          1        0.49       31.03
    3154745 |          1        0.49       31.53
    3155306 |          1        0.49       32.02
    3175723 |          1        0.49       32.51
    3180073 |          1        0.49       33.00
    3180386 |          1        0.49       33.50
    3195173 |          1        0.49       33.99
    3201509 |          1        0.49       34.48
    3208621 |          1        0.49       34.98
    3224085 |          1        0.49       35.47
    3245068 |          1        0.49       35.96
    3266906 |          1        0.49       36.45
    3268368 |          1        0.49       36.95
    4221583 |          1        0.49       37.44
    5641805 |          1        0.49       37.93
    5750884 |          1        0.49       38.42
    7650047 |          1        0.49       38.92
    8046988 |          1        0.49       39.41
    9320133 |          1        0.49       39.90
   1.05e+07 |          1        0.49       40.39
   1.12e+07 |          1        0.49       40.89
   1.12e+07 |          1        0.49       41.38
   1.13e+07 |          1        0.49       41.87
   1.14e+07 |          1        0.49       42.36
   1.14e+07 |          1        0.49       42.86
   1.14e+07 |          1        0.49       43.35
   1.14e+07 |          1        0.49       43.84
   1.14e+07 |          1        0.49       44.33
   1.14e+07 |          1        0.49       44.83
   1.14e+07 |          1        0.49       45.32
   1.14e+07 |          1        0.49       45.81
   1.14e+07 |          1        0.49       46.31
   1.42e+07 |          1        0.49       46.80
   1.70e+07 |          1        0.49       47.29
   1.71e+07 |          1        0.49       47.78
   1.72e+07 |          1        0.49       48.28
   1.72e+07 |          1        0.49       48.77
   1.72e+07 |          1        0.49       49.26
   1.72e+07 |          1        0.49       49.75
   1.73e+07 |          1        0.49       50.25
   1.91e+07 |          1        0.49       50.74
   1.92e+07 |          1        0.49       51.23
   1.92e+07 |          1        0.49       51.72
   1.92e+07 |          1        0.49       52.22
   1.92e+07 |          1        0.49       52.71
   1.93e+07 |          1        0.49       53.20
   1.93e+07 |          1        0.49       53.69
   1.93e+07 |          1        0.49       54.19
   1.93e+07 |          1        0.49       54.68
   1.94e+07 |          1        0.49       55.17
   1.94e+07 |          1        0.49       55.67
   1.94e+07 |          1        0.49       56.16
   2.01e+07 |          1        0.49       56.65
   2.04e+07 |          1        0.49       57.14
   2.05e+07 |          1        0.49       57.64
   2.06e+07 |          1        0.49       58.13
   2.06e+07 |          1        0.49       58.62
   2.06e+07 |          1        0.49       59.11
   2.06e+07 |          1        0.49       59.61
   2.06e+07 |          1        0.49       60.10
   2.06e+07 |          1        0.49       60.59
   2.06e+07 |          1        0.49       61.08
   2.07e+07 |          1        0.49       61.58
   2.07e+07 |          1        0.49       62.07
   2.07e+07 |          1        0.49       62.56
   2.07e+07 |          1        0.49       63.05
   2.07e+07 |          1        0.49       63.55
   2.07e+07 |          1        0.49       64.04
   2.07e+07 |          1        0.49       64.53
   2.07e+07 |          1        0.49       65.02
   2.07e+07 |          1        0.49       65.52
   2.08e+07 |          1        0.49       66.01
   2.08e+07 |          1        0.49       66.50
   2.08e+07 |          1        0.49       67.00
   2.09e+07 |          1        0.49       67.49
   2.09e+07 |          1        0.49       67.98
   2.09e+07 |          1        0.49       68.47
   2.09e+07 |          1        0.49       68.97
   2.09e+07 |          1        0.49       69.46
   2.09e+07 |          1        0.49       69.95
   2.09e+07 |          1        0.49       70.44
   2.09e+07 |          1        0.49       70.94
   2.10e+07 |          1        0.49       71.43
   2.10e+07 |          1        0.49       71.92
   2.10e+07 |          1        0.49       72.41
   2.11e+07 |          1        0.49       72.91
   3.07e+07 |          1        0.49       73.40
   3.20e+07 |          1        0.49       73.89
   3.54e+07 |          1        0.49       74.38
   3.54e+07 |          1        0.49       74.88
   3.55e+07 |          1        0.49       75.37
   3.55e+07 |          1        0.49       75.86
   3.55e+07 |          1        0.49       76.35
   3.55e+07 |          1        0.49       76.85
   3.77e+07 |          1        0.49       77.34
   3.95e+07 |          1        0.49       77.83
   3.96e+07 |          1        0.49       78.33
   3.96e+07 |          1        0.49       78.82
   3.98e+07 |          1        0.49       79.31
   3.98e+07 |          1        0.49       79.80
   4.13e+07 |          1        0.49       80.30
   4.14e+07 |          1        0.49       80.79
   4.14e+07 |          1        0.49       81.28
   4.15e+07 |          1        0.49       81.77
   4.15e+07 |          1        0.49       82.27
   5.04e+07 |          1        0.49       82.76
   5.17e+07 |          1        0.49       83.25
   5.22e+07 |          1        0.49       83.74
   5.23e+07 |          1        0.49       84.24
   5.23e+07 |          1        0.49       84.73
   7.90e+07 |          1        0.49       85.22
   7.90e+07 |          1        0.49       85.71
   7.91e+07 |          1        0.49       86.21
   7.91e+07 |          1        0.49       86.70
   7.92e+07 |          1        0.49       87.19
   7.92e+07 |          1        0.49       87.68
   7.92e+07 |          1        0.49       88.18
   7.93e+07 |          1        0.49       88.67
   7.94e+07 |          1        0.49       89.16
   7.95e+07 |          1        0.49       89.66
   7.97e+07 |          1        0.49       90.15
   7.99e+07 |          1        0.49       90.64
   8.01e+07 |          1        0.49       91.13
   8.02e+07 |          1        0.49       91.63
   8.04e+07 |          1        0.49       92.12
   8.04e+07 |          1        0.49       92.61
   8.04e+07 |          1        0.49       93.10
   8.04e+07 |          1        0.49       93.60
   8.05e+07 |          1        0.49       94.09
   8.05e+07 |          1        0.49       94.58
   8.05e+07 |          1        0.49       95.07
   9.13e+07 |          1        0.49       95.57
   1.71e+08 |          1        0.49       96.06
   1.72e+08 |          1        0.49       96.55
   1.02e+09 |          1        0.49       97.04
   1.07e+09 |          1        0.49       97.54
   1.07e+09 |          1        0.49       98.03
   1.07e+09 |          1        0.49       98.52
   1.07e+09 |          1        0.49       99.01
   1.07e+09 |          1        0.49       99.51
   1.11e+09 |          1        0.49      100.00
------------+-----------------------------------
      Total |        203      100.00

. tab 
varlist required
r(100);

. tab id_educ

   The highest level of |
  education achieved by |
             the person |      Freq.     Percent        Cum.
------------------------+-----------------------------------
                   None |          1        0.49        0.49
     Incomplete primary |         49       24.14       24.63
       Complete primary |         43       21.18       45.81
   Incomplete secondary |         23       11.33       57.14
     Complete secondary |         17        8.37       65.52
   Incomplete technical |          3        1.48       67.00
     Complete technical |         18        8.87       75.86
Incomplete professional |          3        1.48       77.34
  Complete professional |         24       11.82       89.16
    Incomplete graduate |          1        0.49       89.66
      Complete graduate |         21       10.34      100.00
------------------------+-----------------------------------
                  Total |        203      100.00

. tab basiceducation

basiceducat |
        ion |      Freq.     Percent        Cum.
------------+-----------------------------------
          0 |         70       34.48       34.48
          1 |        133       65.52      100.00
------------+-----------------------------------
      Total |        203      100.00

. tab basiceducation id_educ

basiceduca |                                  The highest level of education achieved by the person
      tion |      None  Incomplet  Complete   Incomplet  Complete   Incomplet  Complete   Incomplet  Complete   Incomplet  Complete  |     Total
-----------+-------------------------------------------------------------------------------------------------------------------------+----------
         0 |         0          0          0          0          0          3         18          3         24          1         21 |        70 
         1 |         1         49         43         23         17          0          0          0          0          0          0 |       133 
-----------+-------------------------------------------------------------------------------------------------------------------------+----------
     Total |         1         49         43         23         17          3         18          3         24          1         21 |       203 

. do "C:\Users\istei\AppData\Local\Temp\STDcbc_000000.tmp"

. gen max_primary = 0 

. replace max_primary = 1 if id_educ < 4
(93 real changes made)

. 
end of do-file

. do "C:\Users\istei\AppData\Local\Temp\STDcbc_000000.tmp"

. lab var max_primary "Participant completed up to primary school but not more."

. 
end of do-file

. tab housholdnoeducation

housholdnoe |
   ducation |      Freq.     Percent        Cum.
------------+-----------------------------------
          0 |        202       99.51       99.51
          1 |          1        0.49      100.00
------------+-----------------------------------
      Total |        203      100.00

. tab higheducation

higheducati |
         on |      Freq.     Percent        Cum.
------------+-----------------------------------
          0 |        133       65.52       65.52
          1 |         70       34.48      100.00
------------+-----------------------------------
      Total |        203      100.00

. tab income_hh_ppp

        PPP |
   adjusted |
    monthly |
  household |
     income |      Freq.     Percent        Cum.
------------+-----------------------------------
          0 |          2        1.01        1.01
   75.63381 |         10        5.03        6.03
   113.4507 |          1        0.50        6.53
   151.2676 |         18        9.05       15.58
   181.5211 |          1        0.50       16.08
   226.9014 |         15        7.54       23.62
   264.7184 |          2        1.01       24.62
   302.5352 |          7        3.52       28.14
   340.3521 |          1        0.50       28.64
   378.1691 |         13        6.53       35.18
   453.8029 |         12        6.03       41.21
   513.5536 |          1        0.50       41.71
   529.4367 |          3        1.51       43.22
   544.5634 |          2        1.01       44.22
   567.2536 |          1        0.50       44.72
   582.3804 |          1        0.50       45.23
   589.9437 |          4        2.01       47.24
   595.6919 |          3        1.51       48.74
   595.7675 |          1        0.50       49.25
   605.0705 |          9        4.52       53.77
   680.7043 |          1        0.50       54.27
   756.3381 |         14        7.04       61.31
   907.6057 |          4        2.01       63.32
   983.2396 |          3        1.51       64.82
   1134.507 |         15        7.54       72.36
   1210.141 |          1        0.50       72.86
   1361.409 |          3        1.51       74.37
   1512.676 |          7        3.52       77.89
   1890.845 |          4        2.01       79.90
   2117.747 |          1        0.50       80.40
   2269.014 |          4        2.01       82.41
   2495.916 |          1        0.50       82.91
   2647.183 |          3        1.51       84.42
   3025.353 |          5        2.51       86.93
   3403.521 |          4        2.01       88.94
   3781.691 |          5        2.51       91.46
   4538.029 |          4        2.01       93.47
   5294.367 |          3        1.51       94.97
   7563.381 |          7        3.52       98.49
   11345.07 |          1        0.50       98.99
   15126.76 |          2        1.01      100.00
------------+-----------------------------------
      Total |        199      100.00

. tab econ_activity

       Main |
   economic |
   activity |      Freq.     Percent        Cum.
------------+-----------------------------------
Agriculture |         66       32.51       32.51
  Cattlemen |         35       17.24       49.75
   Merchant |         12        5.91       55.67
   Employee |         37       18.23       73.89
    Laborer |          2        0.99       74.88
      Other |         51       25.12      100.00
------------+-----------------------------------
      Total |        203      100.00

. tab cut_trees_n

  amount of |
trees or ha |
  of forest |
        cut |      Freq.     Percent        Cum.
------------+-----------------------------------
          2 |          2       50.00       50.00
          7 |          1       25.00       75.00
         10 |          1       25.00      100.00
------------+-----------------------------------
      Total |          4      100.00

. tab cut_trees_d

cut_trees_d |
  =1 if the |
person  has |
  cut trees |
  or forest |
      after |
leaving the |
  programme |      Freq.     Percent        Cum.
------------+-----------------------------------
          0 |        102       91.89       91.89
          1 |          9        8.11      100.00
------------+-----------------------------------
      Total |        111      100.00

. ab polspace
command ab is unrecognized
r(199);

. tab polspace

  Political |
        and |
  community |
participati |
         on |      Freq.     Percent        Cum.
------------+-----------------------------------
          1 |         20        9.85        9.85
          2 |         32       15.76       25.62
          3 |         58       28.57       54.19
          4 |         93       45.81      100.00
------------+-----------------------------------
      Total |        203      100.00

. tab econ_depend

  Number of |
    persons |
economicall |
y dependent |
 of him/her |      Freq.     Percent        Cum.
------------+-----------------------------------
          0 |         36       17.73       17.73
          1 |         38       18.72       36.45
          2 |         29       14.29       50.74
          3 |         42       20.69       71.43
          4 |         32       15.76       87.19
          5 |         14        6.90       94.09
          6 |          9        4.43       98.52
          7 |          2        0.99       99.51
         13 |          1        0.49      100.00
------------+-----------------------------------
      Total |        203      100.00

. tab civicorg_d

      Civic |
Organisatio |
          n |
Participati |
 on (Dummy) |      Freq.     Percent        Cum.
------------+-----------------------------------
          0 |        155       76.35       76.35
          1 |         48       23.65      100.00
------------+-----------------------------------
      Total |        203      100.00

. tab pruductiveorg_d

 Productive |
Organisatio |
          n |
Participati |
 on (Dummy) |      Freq.     Percent        Cum.
------------+-----------------------------------
          0 |        154       75.86       75.86
          1 |         49       24.14      100.00
------------+-----------------------------------
      Total |        203      100.00

. tab activity_income

     Activity that produces the highest |
                                 income |      Freq.     Percent        Cum.
----------------------------------------+-----------------------------------
                                      4 |          2        0.99        0.99
                                Abogada |          1        0.49        1.48
                  Abogado independiente |          1        0.49        1.97
                            Agricultura |         24       11.82       13.79
                            Ama de casa |          1        0.49       14.29
              Arreglos en casa de campo |          1        0.49       14.78
           Asesoras tcnicas agricolas |          1        0.49       15.27
                            Comerciante |          1        0.49       15.76
                               Comercio |          6        2.96       18.72
              Comercio- casa de eventos |          1        0.49       19.21
                           Construccin |          2        0.99       20.20
                             Contadura |          1        0.49       20.69
                         Cra de ganado |          1        0.49       21.18
                        Cultivo de mora |          1        0.49       21.67
                            De la leche |          1        0.49       22.17
                   Desarrollo de ganado |          1        0.49       22.66
                                El agro |          2        0.99       23.65
                            El arriendo |          2        0.99       24.63
                                El caf |          1        0.49       25.12
              El comercio de las frutas |          1        0.49       25.62
                   El cultivo de gulupa |          1        0.49       26.11
                          El ecoturismo |          2        0.99       27.09
                              El empleo |          9        4.43       31.53
                      El empleo esposo. |          1        0.49       32.02
                              El emple |          1        0.49       32.51
                              El ganado |          1        0.49       33.00
                              El jornal |          3        1.48       34.48
                 El negocio de fritanga |          1        0.49       34.98
                             El trabajo |          3        1.48       36.45
                           Electricista |          1        0.49       36.95
                               Empleada |          4        1.97       38.92
                               Empleado |          1        0.49       39.41
                                 Empleo |         10        4.93       44.33
        Empleo (desarrollo de software) |          1        0.49       44.83
                       Empleo - docente |          1        0.49       45.32
              Empleo como transportador |          1        0.49       45.81
                   Empleo independiente |          1        0.49       46.31
                        Empleo o jornal |          1        0.49       46.80
                              Ganaderia |          3        1.48       48.28
                              Ganadera |         12        5.91       54.19
                                 Ganado |          3        1.48       55.67
                              Gsnaderia |          1        0.49       56.16
                   Ingreso por arriendo |          1        0.49       56.65
                              Inversion |          1        0.49       57.14
                                 Jornal |          2        0.99       58.13
                                La Mora |          4        1.97       60.10
                         La agricultura |         15        7.39       67.49
                  La ayuda de los hijos |          1        0.49       67.98
     La comercializacin de las flores. |          1        0.49       68.47
              La construccin en madera |          1        0.49       68.97
                La docencia del esposo. |          1        0.49       69.46
                               La fruta |          1        0.49       69.95
                           La ganadera |          8        3.94       73.89
                          La granadilla |          1        0.49       74.38
                              La gulupa |          1        0.49       74.88
                              La leche. |          1        0.49       75.37
                            La lechera |          4        1.97       77.34
                      La metal mecnica |          1        0.49       77.83
                                La mora |          6        2.96       80.79
La participacin en el acueducto Cata.. |          1        0.49       81.28
                             La pensin |          7        3.45       84.73
                            La pensin. |          1        0.49       85.22
                               La reta. |          1        0.49       85.71
                     La siembra de papa |          1        0.49       86.21
                     Las capacitaciones |          1        0.49       86.70
                             Lavar ropa |          1        0.49       87.19
                                  Leche |          1        0.49       87.68
                            Los cerdos. |          1        0.49       88.18
                                Ninguna |          2        0.99       89.16
               Ninguno est desempleado |          1        0.49       89.66
                               Omnilife |          1        0.49       90.15
                             Pensionada |          1        0.49       90.64
                             Pensionado |          1        0.49       91.13
                                Pensin |          6        2.96       94.09
                     Pensin del esposo |          1        0.49       94.58
                           Piscicultura |          1        0.49       95.07
                           Porsicultura |          1        0.49       95.57
                    Produccin de leche |          2        0.99       96.55
                                  Renta |          2        0.99       97.54
                            Restaurante |          1        0.49       98.03
                             Transporte |          2        0.99       99.01
                    Unas vacas de leche |          1        0.49       99.51
                            Veterinario |          1        0.49      100.00
----------------------------------------+-----------------------------------
                                  Total |        203      100.00

. tab community_activ

   Participation in |
          Community |
         activities |      Freq.     Percent        Cum.
--------------------+-----------------------------------
              Never |         94       46.31       46.31
           Everyday |          1        0.49       46.80
        Once a week |         15        7.39       54.19
       Once a month |         25       12.32       66.50
Couple times a year |         68       33.50      100.00
--------------------+-----------------------------------
              Total |        203      100.00

. tab land_size

  land_size |      Freq.     Percent        Cum.
------------+-----------------------------------
        .12 |          1        0.50        0.50
        .64 |          4        2.00        2.50
        .75 |          1        0.50        3.00
        .96 |          1        0.50        3.50
          1 |          1        0.50        4.00
       1.28 |          2        1.00        5.00
       1.32 |          1        0.50        5.50
       1.34 |          1        0.50        6.00
        1.6 |          1        0.50        6.50
       1.92 |          8        4.00       10.50
       2.24 |          2        1.00       11.50
        2.5 |          1        0.50       12.00
       2.56 |          6        3.00       15.00
        2.8 |          1        0.50       15.50
          3 |          7        3.50       19.00
        3.2 |          3        1.50       20.50
        3.5 |          1        0.50       21.00
        3.7 |          1        0.50       21.50
       3.84 |          3        1.50       23.00
          4 |          7        3.50       26.50
       4.16 |          1        0.50       27.00
          5 |          5        2.50       29.50
       5.44 |          1        0.50       30.00
        5.5 |          1        0.50       30.50
       5.76 |          2        1.00       31.50
          6 |          5        2.50       34.00
        6.4 |          2        1.00       35.00
        6.5 |          2        1.00       36.00
       6.72 |          1        0.50       36.50
          7 |          4        2.00       38.50
       7.04 |          1        0.50       39.00
       7.68 |          1        0.50       39.50
          8 |          2        1.00       40.50
       8.32 |          2        1.00       41.50
        8.5 |          2        1.00       42.50
       8.96 |          3        1.50       44.00
          9 |          1        0.50       44.50
        9.5 |          1        0.50       45.00
        9.6 |          2        1.00       46.00
        9.7 |          1        0.50       46.50
         10 |          5        2.50       49.00
      10.24 |          2        1.00       50.00
      10.56 |          1        0.50       50.50
      10.88 |          2        1.00       51.50
         11 |          2        1.00       52.50
         12 |          4        2.00       54.50
       12.8 |          2        1.00       55.50
         13 |          1        0.50       56.00
      13.44 |          1        0.50       56.50
       13.5 |          1        0.50       57.00
         14 |          1        0.50       57.50
      14.08 |          1        0.50       58.00
      14.72 |          1        0.50       58.50
         15 |          1        0.50       59.00
         16 |          1        0.50       59.50
     17.056 |          1        0.50       60.00
         18 |          1        0.50       60.50
      18.56 |          1        0.50       61.00
       19.5 |          1        0.50       61.50
         20 |          2        1.00       62.50
       20.5 |          1        0.50       63.00
      21.28 |          1        0.50       63.50
         22 |          1        0.50       64.00
      22.08 |          2        1.00       65.00
       22.4 |          1        0.50       65.50
      22.48 |          1        0.50       66.00
         23 |          2        1.00       67.00
         25 |          3        1.50       68.50
       25.5 |          1        0.50       69.00
      27.52 |          1        0.50       69.50
         30 |          1        0.50       70.00
      30.08 |          1        0.50       70.50
      30.64 |          1        0.50       71.00
         32 |          1        0.50       71.50
         33 |          1        0.50       72.00
      33.32 |          1        0.50       72.50
         35 |          1        0.50       73.00
         36 |          3        1.50       74.50
         37 |          2        1.00       75.50
         39 |          1        0.50       76.00
       40.6 |          1        0.50       76.50
         42 |          1        0.50       77.00
         44 |          1        0.50       77.50
      44.16 |          1        0.50       78.00
         46 |          1        0.50       78.50
         47 |          1        0.50       79.00
      47.36 |          1        0.50       79.50
      47.68 |          1        0.50       80.00
         50 |          1        0.50       80.50
       50.7 |          1        0.50       81.00
         52 |          1        0.50       81.50
         53 |          1        0.50       82.00
         56 |          1        0.50       82.50
         57 |          1        0.50       83.00
         60 |          2        1.00       84.00
         61 |          2        1.00       85.00
       61.5 |          1        0.50       85.50
         65 |          1        0.50       86.00
         70 |          1        0.50       86.50
         72 |          1        0.50       87.00
         73 |          1        0.50       87.50
         74 |          1        0.50       88.00
      74.84 |          1        0.50       88.50
         75 |          1        0.50       89.00
       76.8 |          1        0.50       89.50
       78.5 |          1        0.50       90.00
         83 |          1        0.50       90.50
         85 |          1        0.50       91.00
         90 |          1        0.50       91.50
       92.8 |          1        0.50       92.00
       98.5 |          1        0.50       92.50
         99 |          1        0.50       93.00
      100.5 |          1        0.50       93.50
      108.8 |          1        0.50       94.00
        127 |          1        0.50       94.50
        130 |          2        1.00       95.50
        146 |          2        1.00       96.50
        180 |          1        0.50       97.00
        210 |          1        0.50       97.50
     277.76 |          1        0.50       98.00
        314 |          1        0.50       98.50
        366 |          1        0.50       99.00
        428 |          1        0.50       99.50
       1046 |          1        0.50      100.00
------------+-----------------------------------
      Total |        200      100.00

. tab remember_d

remember_d= |
   1 if the |
participant |
  remembers |
participati |
  ng in the |
        PES |
  programme |      Freq.     Percent        Cum.
------------+-----------------------------------
          0 |          3        2.54        2.54
          1 |        115       97.46      100.00
------------+-----------------------------------
      Total |        118      100.00

. tab payment_rem_d

payment_rem |
  =1 if the |
 participan |
recalls the |
  amount of |
   payments |
     he/she |
    recived |      Freq.     Percent        Cum.
------------+-----------------------------------
          0 |          4        3.39        3.39
          1 |        114       96.61      100.00
------------+-----------------------------------
      Total |        118      100.00

. tab p_satisfaction

Satisfaction with |
   the programme. |      Freq.     Percent        Cum.
------------------+-----------------------------------
    Not satisfied |         15       12.20       12.20
                  |         24       19.51       31.71
                  |         34       27.64       59.35
totally satisfied |         48       39.02       98.37
       Don't know |          2        1.63      100.00
------------------+-----------------------------------
            Total |        123      100.00

. tab selection_f

   Perceived |
 fairness of |
 participant |
   selection |
    process. |      Freq.     Percent        Cum.
-------------+-----------------------------------
    Not fair |         19       15.45       15.45
             |         19       15.45       30.89
             |         24       19.51       50.41
totally fair |         41       33.33       83.74
  Don't know |         20       16.26      100.00
-------------+-----------------------------------
       Total |        123      100.00

. do "C:\Users\istei\AppData\Local\Temp\STDcbc_000000.tmp"

. global balance female id_age max_primary income_hh_ppp high_SES econ_depend agricultor cattlemen merchant employee laborer othereconactivity farms_n
>  land_size civicorg_d pruductiveorg_d community_activ /// socio-economics
> trust_people trust_townpeople trust_familiy responsibility_gov /// preferences and perceptions
> iebaltab $balance , grpvar(phase_d)  rowvarlabels save("$working_ANALYSIS/results/tables/TableS1_balancing") ftest fmissok replace

. 
end of do-file

. do "C:\Users\istei\AppData\Local\Temp\STDcbc_000000.tmp"

. global balance female id_age max_primary income_hh_ppp high_SES econ_depend agricultor cattlemen merchant employee laborer othereconactivity farms_n
>  land_size civicorg_d pruductiveorg_d community_activ /// socio-economics
> trust_people trust_townpeople trust_familiy responsibility_gov 

. iebaltab $balance , grpvar(phase_d)  rowvarlabels save("$working_ANALYSIS/results/tables/TableS1_balancing") ftest fmissok replace

------------------------------------------------------------------------------------------------------------------------------------------------------
    Stata issued one or more warnings in relation to the tests in this balance table. Read the warning(s) below carefully before using the values
    generated for this table.

        Difference-in-Means Tests: The variance in both groups listed below is zero for the variable indicated and a difference-in-means test
        between the two groups is therefore not valid. Tests are reported as N/A in the table.

        +--------------------------------------------------------------+
        |   Test    |   Group    |    Balance Variable                 |
        |-----------+------------+-------------------------------------|
        | t-test    | (1)-(3)    |  laborer                            |
        +--------------------------------------------------------------+

    Stata issued one or more warnings in relation to the tests in this balance table. Read the warning(s) above carefully before using the values
    generated for this table.
------------------------------------------------------------------------------------------------------------------------------------------------------

    Balance table saved to: C:\Users\istei\Google Drive\Promotion\1_Projects\PES_Colombia\analysis/results/tables/TableS1_balancing.xlsx

. 
end of do-file

. do "C:\Users\istei\AppData\Local\Temp\STDcbc_000000.tmp"

. gen pes_participation = 1 if phase_d ==8
(123 missing values generated)

. replace pes_participation = 2 if phase_d == 1
(56 real changes made)

. replace pes_participation = 3 if phase_d == 2
(67 real changes made)

. lab def pes_part 1 "Non-participant" 2 "Phase 1 only" 3 "Phase 1 & 2", replace

. lab val pes_participation pes_part

. 
end of do-file

. do "C:\Users\istei\AppData\Local\Temp\STDcbc_000000.tmp"

. iebaltab $balance , grpvar(pes_participation)  rowvarlabels save("$working_ANALYSIS/results/tables/TableS1_balancing") ftest fmissok replace

------------------------------------------------------------------------------------------------------------------------------------------------------
    Stata issued one or more warnings in relation to the tests in this balance table. Read the warning(s) below carefully before using the values
    generated for this table.

        Difference-in-Means Tests: The variance in both groups listed below is zero for the variable indicated and a difference-in-means test
        between the two groups is therefore not valid. Tests are reported as N/A in the table.

        +--------------------------------------------------------------+
        |   Test    |   Group    |    Balance Variable                 |
        |-----------+------------+-------------------------------------|
        | t-test    | (1)-(2)    |  laborer                            |
        +--------------------------------------------------------------+

    Stata issued one or more warnings in relation to the tests in this balance table. Read the warning(s) above carefully before using the values
    generated for this table.
------------------------------------------------------------------------------------------------------------------------------------------------------

    Balance table saved to: C:\Users\istei\Google Drive\Promotion\1_Projects\PES_Colombia\analysis/results/tables/TableS1_balancing.xlsx

. * joint f-tests no significant differnces in terms of socio-economics and other pre-specified variables potentially influencing intentions and vacci
> ne hesitancy
. 
end of do-file

. tab community_activ

   Participation in |
          Community |
         activities |      Freq.     Percent        Cum.
--------------------+-----------------------------------
              Never |         94       46.31       46.31
           Everyday |          1        0.49       46.80
        Once a week |         15        7.39       54.19
       Once a month |         25       12.32       66.50
Couple times a year |         68       33.50      100.00
--------------------+-----------------------------------
              Total |        203      100.00

. tab community_activ, nolab

Participati |
      on in |
  Community |
 activities |      Freq.     Percent        Cum.
------------+-----------------------------------
          1 |         94       46.31       46.31
          2 |          1        0.49       46.80
          3 |         15        7.39       54.19
          4 |         25       12.32       66.50
          5 |         68       33.50      100.00
------------+-----------------------------------
      Total |        203      100.00

. do "C:\Users\istei\AppData\Local\Temp\STDcbc_000000.tmp"

. gen collective_action = 1 if community_activ=1
invalid syntax
r(198);

end of do-file

r(198);

. do "C:\Users\istei\AppData\Local\Temp\STDcbc_000000.tmp"

. lab def collective_lab 1 "Never" 2 "Couple times a year" 3 "Once a month" 4 "Once a week" 5 "Everyday", replace

. lab val collective_action collective_lab
variable collective_action not found
r(111);

end of do-file

r(111);

. do "C:\Users\istei\AppData\Local\Temp\STDcbc_000000.tmp"

. gen collective_action = 1 if community_activ=1
invalid syntax
r(198);

end of do-file

r(198);

. do "C:\Users\istei\AppData\Local\Temp\STDcbc_000000.tmp"

. gen collective_action = 1 if community_activ==1
(109 missing values generated)

. replace collective_action = 2 if community_activ==5
(68 real changes made)

. replace collective_action = 3 if community_activ==4
(25 real changes made)

. replace collective_action = 4 if community_activ==3
(15 real changes made)

. replace collective_action = 5 if community_activ==2
(1 real change made)

. lab def collective_lab 1 "Never" 2 "Couple times a year" 3 "Once a month" 4 "Once a week" 5 "Everyday", replace

. lab val collective_action collective_lab

. 
end of do-file

. tab collection_action
variable collection_action not found
r(111);

. tab collective_action

  collective_action |      Freq.     Percent        Cum.
--------------------+-----------------------------------
              Never |         94       46.31       46.31
Couple times a year |         68       33.50       79.80
       Once a month |         25       12.32       92.12
        Once a week |         15        7.39       99.51
           Everyday |          1        0.49      100.00
--------------------+-----------------------------------
              Total |        203      100.00

. do "C:\Users\istei\AppData\Local\Temp\STDcbc_000000.tmp"

. gen never_collective = 0

. replace never_collective = 1 if collective_action == 1
(94 real changes made)

. lab var never_collective "=1 if participant never participates in community activities."

. 
end of do-file

. tab residence

   Current Residence of |
        the participant |      Freq.     Percent        Cum.
------------------------+-----------------------------------
        Farm (payments) |         27       13.30       13.30
                   City |         35       17.24       30.54
                   Town |         46       22.66       53.20
Other farm(no payments) |         95       46.80      100.00
------------------------+-----------------------------------
                  Total |        203      100.00

. tab polspace

  Political |
        and |
  community |
participati |
         on |      Freq.     Percent        Cum.
------------+-----------------------------------
          1 |         20        9.85        9.85
          2 |         32       15.76       25.62
          3 |         58       28.57       54.19
          4 |         93       45.81      100.00
------------+-----------------------------------
      Total |        203      100.00

. do "C:\Users\istei\AppData\Local\Temp\STDcbc_000000.tmp"

. lab val polspace agree_disagree

. 
end of do-file

. tab polspace

   Political and |
       community |
   participation |      Freq.     Percent        Cum.
-----------------+-----------------------------------
Totally disagree |         20        9.85        9.85
        Disagree |         32       15.76       25.62
           Agree |         58       28.57       54.19
   Totally agree |         93       45.81      100.00
-----------------+-----------------------------------
           Total |        203      100.00

. tab control_publicw

    Control over |
  public workers |      Freq.     Percent        Cum.
-----------------+-----------------------------------
Totally disagree |          4        1.97        1.97
        Disagree |         17        8.37       10.34
           Agree |         65       32.02       42.36
   Totally agree |        117       57.64      100.00
-----------------+-----------------------------------
           Total |        203      100.00

. do "C:\Users\istei\Google Drive\Promotion\1_Projects\PES_Colombia\analysis\scripts\01_clean_generate.do"

. *--------------------------------------------------------------------------------------
. * SCRIPT: 01_clean_generate.do
. * PURPOSE: cleans the raw excel data and generates additional variables for analysis
. *--------------------------------------------------------------------------------------
. 
. *----------------------------
. * 1) Import excel dataset and cleaning
. *----------------------------
. clear

. import excel  "$working_ANALYSIS/data/psa_data.xlsx", firstrow
(106 vars, 203 obs)

. 
. *Correcting data entry errors with help of colombian team
. replace farms_n =. if id==96
(1 real change made, 1 to missing)

. replace farm1_size =. if id==10 
(1 real change made, 1 to missing)

. replace farm1_size =. if id==235
(1 real change made, 1 to missing)

. replace farm2_unit =1 if id==221
(1 real change made)

. replace payment_n =. if id==15
(1 real change made, 1 to missing)

. replace donation_n = 0 if donation_n==.
(14 real changes made)

. replace income_n = 18000 if id==172
(1 real change made)

. replace income_n = 18000 if id==411 & donation_n==2000
(1 real change made)

. replace household_income=. if id==10
(1 real change made, 1 to missing)

. replace household_income=. if id==96
(1 real change made, 1 to missing)

. replace household_income=500000 if id==97
(1 real change made)

. replace household_income=. if id==142
(1 real change made, 1 to missing)

. replace household_income=. if id==226 & treatment_d==2
(1 real change made, 1 to missing)

. 
. 
. *redefine data (adjust unit size)
. replace farm1_size = farm1_size/10000 if farm1_unit==2
(5 real changes made)

. replace farm1_size = farm1_size*0.64 if farm1_unit==3
(71 real changes made)

. replace farm1_size = farm1_size*0.64 if farm1_unit==4
(0 real changes made)

. replace farm2_size = farm2_size/10000 if farm2_unit==2
(2 real changes made)

. replace farm2_size = farm2_size*0.64 if farm2_unit==3
(32 real changes made)

. replace farm2_size = farm2_size*0.64 if farm2_unit==4
(0 real changes made)

. replace farm2_size =. if farm2_size==0
(1 real change made, 1 to missing)

. replace farm3_size = farm3_size/10000 if farm3_unit==2
(4 real changes made)

. replace farm3_size = farm3_size*0.64 if farm3_unit==3
(14 real changes made)

. replace farm3_size = farm3_size*0.64 if farm3_unit==4
(0 real changes made)

. replace farm3_size =. if farm3_size==0
(1 real change made, 1 to missing)

. replace farm4_size = farm4_size/10000 if farm4_unit==2
(1 real change made)

. replace farm4_size = farm4_size*0.64 if farm4_unit==3
(8 real changes made)

. replace farm4_size = farm4_size*0.64 if farm4_unit==4
(0 real changes made)

. 
. *label variables
. lab var id "Unique identifier"

. lab var id_name "Participant name"

. lab var assistant "Name of the assistant performing the survey"

. lab var date "Date the survey was taken"

. lab var treatment_d "Treatment participants was assigned to"

. lab def treat_lab 1 "Treatment 1" 2 "Treatment 2" 4 "Control", replace

. lab val treatment_d treat_lab

. lab var phase_d "Which phase of the PES did the participant complete?"

. lab def phase_lab 1 "Phase 1" 2 "Phase 2" 8 "None", replace

. lab val phase_d phase_lab

. lab var panel_d "Panel data on motivations available"

. lab var place_survey "Place where the survey was performed"

. lab var remember_d "remember_d=1 if the participant remembers participating in the PES programme"

. lab var land_mun "Municipality on which the land that participated in the programme is located"

. lab var payment_rem_d "payment_rem=1 if the participan recalls the amount of payments he/she recived"

. lab var payment_n "The number of payments given to the participant during the programme."

. lab var payment_t "Total amount of money payed to the participant during the porgramme"

. lab var payment_u "For what did the participant use the money"

. lab var know_part "know_part=1 if the person knows other people that have participated in the programme"
note: label truncated to 80 characters

. lab var know_part_n "Number of people that the participan knows that have participated too in the programme"
note: label truncated to 80 characters

. lab var participate_d "participate_d=1 if the person participated in the programme design or adjustment"

. lab var participate_w "Way of Participation in the programme design/adjustment"

. lab var participate_o_d "participate_o=1 if the person knows that there are other people still receiving the programme benefits."
note: label truncated to 80 characters

. lab var selection_op "Opinion on the selection of participants of the programme. (open ended)"

. lab var selection_f "Perceived fairness of participant selection process."

. lab def selection_lab 1 "Not fair" 2 "" 3 "" 4 "totally fair" 5 "Don't know", replace

. lab val selection_f selection_lab

. lab var p_satisfaction "Satisfaction with the programme."

. lab def satisfaction_lab 1 "Not satisfied" 2 "" 3 "" 4 "totally satisfied" 5 "Don't know", replace

. lab val p_satisfaction satisfaction_lab

. lab var p_people_d "Knows people currently in the pregramme"

. lab var p_people_n "Number of people known who are currently in the programme."

. lab var donation_d "donation_d=1 if the person wants to do a donation"

. lab var donation_org "Donation Organisation"

. lab def donation_lab 1 "TropenBos" 2 "Gaia" 3 "Omacha" 4 "Random", replace

. lab val donation_org donation_lab

. lab var donation_org_r "Randomly chosen Donation Organisation."

. lab def donation_rdm_lab 1 "TrompenBos" 2 "Gaia" 3 "Omacha", replace

. lab val donation_org_r donation_rdm_lab

. lab var donation_n "Amount donated by the person to the selected organisation"

. lab var donation_tot "Amount the organisation receives as a donation = (donation_n *2)"

. lab var income_n "Amount of money the person keeps after donation."

. lab var tropenbos_d "tropenbos_d=1 if the person knows about TropenBos"

. lab var tropenbos_1 "What does the person knows about TropenBos?"

. lab var gaia_d "gaia_d=1 if the person knows about Gaia"

. lab var gaia_1 "What does the person knows about Gaia?"

. lab var omacha_d "omacha_d=1 if the person knows about Omacha"

. lab var omacha_1 "What does the person knows about Omacha?"

. lab var donation_ngo "Donation to NGO"

. lab def donation_lab 1 "Never" 2 "Once" 3 "Many times", replace

. lab val donation_ngo donation_lab

. lab var donation_all "donation_all=1 if the person donated all th money given to him/her"

. lab var donation_40k_d "donation_40k_d=1 if they would have donated all if given 40000 instead of 20000"

. lab var donation_80k_d "donation_80k_d=1 if they would have donated all if given 80000 instead of 20000"

. lab var donation_100k_d "donation_100k_d=1 if they would have donated all if given 100000 instead of 20000"
note: label truncated to 80 characters

. lab var regret_forest "Regret if I damage the forest"

. lab def agree_disagree 1 "Totally disagree" 2 "Disagree" 3 "Agree" 4 "Totally agree", replace

. lab val regret_forest agree_disagree

. lab var deforestation "There is very little we can do to reduce deforestation."

. lab val deforestation agree_disagree

. lab var farms_n "Total number of farms owned by the person"

. lab var farm1_size "Size of farm 1"

. lab var farm1_unit "Units of famr1_size"

. lab def unit_lab 1 "ha" 2 "m2" 3 "fanegada" 4 "cuadras" 5 "Don't know", replace

. lab val farm1_unit unit_lab

. lab var farm2_size "Size of farm 2"

. lab var farm2_unit "Units of famr2_size"

. lab val farm2_unit unit_lab

. lab var farm3_size "Size of farm 3"

. lab var farm3_unit "Units of famr3_size"

. lab val farm3_unit unit_lab

. lab var farm4_size "Size of farm 4"

. lab var farm4_unit "Units of famr4_size"

. lab val farm4_unit unit_lab

. lab var cut_trees_d "cut_trees_d=1 if the person  has cut trees or forest after leaving the programme"

. lab var cut_trees_n "amount of trees or ha of forest cut"

. lab var cut_trees_u "Units of cut_trees_n"

. lab var enjoy_care "Joy from taking care of the Forest"

. lab val enjoy_care agree_disagree

. lab var polspace "Political and community participation"

. lab val polspace agree_disagree

. lab var residence "Current Residence of the participant"

. lab def residence_lab 1 "Farm (payments)" 2 "City" 3 "Town" 4 "Other farm(no payments)", replace

. lab val residence residence_lab

. lab var neighbors "The people closest to me would be upset with me if I knock down the forest."

. lab val neighbors agree_disagree

. lab var econ_activity "Main economic activity"

. lab def income_lab 1 "Agriculture" 2 "Cattlemen" 3 "Merchant" 4 "Employee" 5 "Laborer" 6 "Other", replace

. lab val econ_activity income_lab

. lab var econ_activity_6 "Economic activity of the person if econ_activity==6 (Other)"

. lab var econ_depend "Number of persons economically dependent of him/her"

. lab var control_publicw "Control over public workers"

. lab val control_publicw agree_disagree

. lab var id_age "Age of the participant"

. lab var id_sex "id_sex=1 woman"

. lab var proud_forest "I feel proud to take care of the forest."

. lab val proud_forest agree_disagree

. lab var id_educ_household "The highest level of education achieved by the people in the household"

. lab def edu_lab 1 "None" 2 "Incomplete primary" 3 "Complete primary" 4 "Incomplete secondary" 5 "Complete secondary" 6 "Incomplete technical" 7 "Com
> plete technical" 8 "Incomplete professional" 9 "Complete professional" 10 "Incomplete graduate" 11 "Complete graduate", replace

. lab val id_educ_household edu_lab

. lab var id_educ "The highest level of education achieved by the person"

. lab val id_educ edu_lab

. lab var care_forest "Take care of the forest only if paid."

. lab val care_forest agree_disagree

. lab var civicorg_d "Civic Organisation Participation (Dummy)"

. lab var civicorg "Description of which civic organisation the person participates in"

. lab var civicorg_y "Year since the person has been participating in the civic organisation."

. lab var civicorg_part "Civic Organisation Participation"

. lab def org_lab 1 "very little" 2 "a little" 3 "actively" 4 "very actively", replace

. lab val civicorg_part org_lab

. lab var pruductiveorg_d "Productive Organisation Participation (Dummy)"

. lab var pruductiveorg "Description of which productive organisation the person participates in"

. lab var pruductiveorg_y "Year since the person has been participating in the productive organisation."

. lab var pruductiveorg_part "Productive Organisation Participation"

. lab val pruductiveorg_part org_lab

. lab var guilt_forest "Guilt from damaging the forest"

. lab val guilt_forest agree_disagree

. lab var neighbors_critic "My neighbors would criticize me if I damage the forest."

. lab val neighbors_critic agree_disagree

. lab var household_income "Household monthly income in COP"

. lab var responsibility_gov "I believe that in the long term, citizens are responsible for bad government at national and local levels"
note: label truncated to 80 characters

. lab val responsibility_gov agree_disagree

. lab var activity_income "Activity that produces the highest income"

. lab var fine_forest "I do not damage the forest for fear of fines that the environmental authority can give me."
note: label truncated to 80 characters

. lab val fine_forest agree_disagree

. lab var noprotect_forest "There is no point in protecting the forest."

. lab val noprotect_forest agree_disagree

. lab var trust_people "You can trust most people."

. lab def likert5 1 "Strongly disagree" 2 "Disagree" 3 "Neither" 4 "Agree" 5 "Strongly agree", replace

. lab val trust_people likert5

. lab var trust_townpeople "Trust in people from town/neighborhood"

. lab val trust_townpeople likert5

. lab var trust_familiy "Trust people from family only"

. lab val trust_familiy likert5

. lab var community_activ "Participation in Community activities"

. lab def ca_lab 1 "Never" 2 "Everyday" 3 "Once a week" 4 "Once a month" 5 "Couple times a year", replace

. lab val community_activ ca_lab

. lab var community_activ_1 "community_activ_1=1 if the participation mas VOLUNTARY"

. lab var community_activ_2 "community_activ_2=1 if the participation mas VOLUNTARY"

. lab var community_activ_3 "community_activ_3=1 if the participation mas VOLUNTARY"

. lab var id_cedula "Cedula (National ID)"

. lab var know_nonpart "know_nonpart=1 if he/she knows a person with farms/land that have not participated in the program"
note: label truncated to 80 characters

. lab var know_prog_d "know_prog_d=1 if the person knows the programme"

. lab var know_prog "What does the person knows about the programme (open text)"

. lab var apply_prog_d "apply_prog_d=1 if the person applied to the programme"

. lab var prog_selection "Reason why the person did not get selected into the programme, according to them. (open text)"
note: label truncated to 80 characters

. lab var noapply_prog "Reason for not applying to the programme"

. lab def reason_lab 1 "Did not know" 2 "Did not meet requirements" 3 "Application process very difficult" 4 "found out too late" 5 "no trust" 6 "not 
> interestest" 7 "other"

. lab var noapply_prog_1  "Reason for not applying to the programme: the person did not know the programme"

. lab var noapply_prog_2  "Reason for not applying to the programme: the person did not meet the requirements"
note: label truncated to 80 characters

. lab var noapply_prog_3  "Reason for not applying to the programme: 'The application or the process was very difficult'"
note: label truncated to 80 characters

. lab var noapply_prog_4  "Reason for not applying to the programme: the person found out when it was too late."
note: label truncated to 80 characters

. lab var noapply_prog_5  "Reason for not applying to the programme: the person did NOT trust the programme"

. lab var noapply_prog_6  "Reason for not applying to the programme: the person was NOT interested in the programme"
note: label truncated to 80 characters

. lab var noapply_prog_7  "Reason for not applying to the programme: Other"

. 
. 
. 
. 
. *----------------------------------
. * 2) Generate additional variables
. *----------------------------------
. *total land size if farmer has more farms
. gen land_size = farm1_size if farms_n==1
(79 missing values generated)

. replace land_size = farm1_size + farm2_size  if farms_n==2
(38 real changes made)

. replace land_size = farm1_size + farm2_size + farm3_size  if farms_n==3
(18 real changes made)

. replace land_size = farm1_size + farm2_size + farm3_size + farm4_size  if farms_n>=4
(20 real changes made)

. 
. *female dummy
. gen female =0

. replace female =1 if id_sex==1
(57 real changes made)

. 
. *priming dummy
. gen primed =0

. replace primed =1 if treatment_d==1
(60 real changes made)

. 
. *PES participation dummies
. gen participant=0

. replace participant=1 if phase_d==1 | phase_d==2
(123 real changes made)

. 
. gen phase1 =0

. replace phase1=1 if phase_d==1
(56 real changes made)

. 
. gen phase2 =0

. replace phase2 =1 if phase_d==2
(67 real changes made)

. 
. *interaction phase and treatment
. gen phase1primed = phase1*primed

. 
. gen phase2primed = phase2*primed

. 
. *dummies for all professions and education levels
. gen agricultor =0

. replace agricultor =1 if econ_activity ==1
(66 real changes made)

. gen cattlemen =0

. replace cattlemen =1 if econ_activity ==2
(35 real changes made)

. gen merchant =0

. replace merchant =1 if econ_activity ==3
(12 real changes made)

. gen employee =0

. replace employee =1 if econ_activity ==4
(37 real changes made)

. gen laborer =0

. replace laborer =1 if econ_activity ==5
(2 real changes made)

. gen othereconactivity =0

. replace othereconactivity =1 if econ_activity ==6
(51 real changes made)

. gen housholdnoeducation =0

. replace housholdnoeducation =1 if id_educ_household==1
(1 real change made)

. gen housholdincompleteprim =0

. replace housholdincompleteprim =1 if id_educ_household==2
(9 real changes made)

. gen housholdcompleteprim =0

. replace housholdcompleteprim =1 if id_educ_household==3
(18 real changes made)

. gen housholdincompletesec =0

. replace housholdincompletesec =1 if id_educ_household==4
(11 real changes made)

. gen housholdcompletesec =0

. replace housholdcompletesec =1 if id_educ_household==5
(48 real changes made)

. gen housholdincompletetec =0

. replace housholdincompletetec =1 if id_educ_household==6
(1 real change made)

. gen housholdcompletetec =0

. replace housholdcompletetec =1 if id_educ_household==7
(10 real changes made)

. gen housholdincompleteprof =0

. replace housholdincompleteprof =1 if id_educ_household==8
(18 real changes made)

. gen housholdcompleteprof =0

. replace housholdcompleteprof =1 if id_educ_household==9
(46 real changes made)

. gen housholdincompletegrad =0

. replace housholdincompletegrad =1 if id_educ_household==10
(3 real changes made)

. gen housholdcompletegrad =0

. replace housholdcompletegrad =1 if id_educ_household==11
(38 real changes made)

. gen noeducation =0

. replace noeducation =1 if id_educ==1
(1 real change made)

. gen incompleteprim =0

. replace incompleteprim =1 if id_educ==2
(49 real changes made)

. gen completeprim =0

. replace completeprim =1 if id_educ==3
(43 real changes made)

. gen incompletesec =0

. replace incompletesec =1 if id_educ==4
(23 real changes made)

. gen completesec =0

. replace completesec =1 if id_educ==5
(17 real changes made)

. gen incompletetec =0

. replace incompletetec =1 if id_educ==6
(3 real changes made)

. gen completetec =0

. replace completetec =1 if id_educ==7
(18 real changes made)

. gen incompleteprof =0

. replace incompleteprof =1 if id_educ==8
(3 real changes made)

. gen completeprof =0

. replace completeprof =1 if id_educ==9
(24 real changes made)

. gen incompletegrad =0

. replace incompletegrad =1 if id_educ==10
(1 real change made)

. gen completegrad =0

. replace completegrad =1 if id_educ==11
(21 real changes made)

. 
. *donation experience
. gen donnever=0

. replace donnever = 1 if donation_ngo==1
(155 real changes made)

. gen dononce=0

. replace dononce = 1 if donation_ngo==2
(19 real changes made)

. gen donmany=0

. replace donmany = 1 if donation_ngo==3
(29 real changes made)

. gen knowsNGO =0

. replace knowsNGO =1 if tropenbos_d==1 | gaia_d==1 | omacha_d==1
(33 real changes made)

. gen donatedbefore =0

. replace donatedbefore=1 if donation_ngo==2 | donation_ngo==3
(48 real changes made)

. 
. 
. *dummies on selection fairness
. gen selectionnotfair =0

. replace selectionnotfair = 1 if selection_f==1
(19 real changes made)

. gen selectionnotveryfair =0

. replace selectionnotveryfair = 1 if selection_f==2
(19 real changes made)

. gen selectionfair =0

. replace selectionfair = 1 if selection_f==3
(24 real changes made)

. gen selectiontotallyfair =0

. replace selectiontotallyfair = 1 if selection_f==4
(41 real changes made)

. gen selectionna=0

. replace selectionna = 1 if selection_f==5
(20 real changes made)

. gen satisfactionnotatall=0

. replace satisfactionnotatall = 1 if p_satisfaction==1
(15 real changes made)

. gen satisfactionnot=0

. replace satisfactionnot = 1 if p_satisfaction==2
(24 real changes made)

. gen satisfactionyes=0

. replace satisfactionyes = 1 if p_satisfaction==3
(34 real changes made)

. gen satisfactiontotally=0

. replace satisfactiontotally = 1 if p_satisfaction==4
(48 real changes made)

. gen satisfactionna=0

. replace satisfactionna = 1 if p_satisfaction==5
(2 real changes made)

. 
. *pooled
. gen satisfied =0

. replace satisfied=1 if p_satisfaction ==3 | p_satisfaction ==4
(82 real changes made)

. gen fairselection =0

. replace fairselection=1 if selection_f ==3 | selection_f ==4
(65 real changes made)

. 
. 
. *dummies for the organisations where subjects want to donate
. gen TropenBos=0

. replace TropenBos=1 if donation_org==1
(53 real changes made)

. gen Gaia=0

. replace Gaia=1 if donation_org==2
(85 real changes made)

. gen Omacha=0

. replace Omacha=1 if donation_org==3
(37 real changes made)

. gen Any=0

. replace Any=1 if donation_org==4
(14 real changes made)

. 
. *pooling different education levels to basic and high education
. gen basiceducation =0

. replace basiceducation =1 if id_educ <=5
(133 real changes made)

. gen higheducation =0

. replace higheducation =1 if id_educ >=6
(70 real changes made)

. gen higheducationprimed = higheducation*primed

. gen basiceductionprimed = basiceducation*primed

. 
. *check income levels and convert to PPP
. sum household_income, detail

               Household monthly income in COP
-------------------------------------------------------------
      Percentiles      Smallest
 1%            0              0
 5%       100000              0
10%       200000         100000       Obs                 199
25%       400000         100000       Sum of Wgt.         199

50%       800000                      Mean            1934922
                        Largest       Std. Dev.       3014523
75%      2000000       1.00e+07
90%      5000000       1.50e+07       Variance       9.09e+12
95%     1.00e+07       2.00e+07       Skewness       3.367925
99%     2.00e+07       2.00e+07       Kurtosis       16.97734

. *PPP conversion factor from World Bank for Colombia in 2018 = 1322,16
. gen income_hh_ppp = household_income / 1322.16
(4 missing values generated)

. lab var income_hh_ppp "PPP adjusted monthly household income"

. 
. *high socioeconomic dummy
. egen aux_income_hh_ppp = median(income_hh_ppp)

. gen high_SES = 1 if income_hh_ppp >= aux_income_hh_ppp
(98 missing values generated)

. replace high_SES = 0 if income_hh_ppp < aux_income_hh_ppp
(98 real changes made)

. lab var high_SES "Above median household income." 

. drop aux_income_hh_ppp

. 
. * Save dataset
. save "$working_ANALYSIS/processed/psa_colombia_rdy.dta", replace
file C:\Users\istei\Google Drive\Promotion\1_Projects\PES_Colombia\analysis/processed/psa_colombia_rdy.dta saved

. 
. 
. 
. 
.  
. ** EOF
. 
end of do-file

. do "C:\Users\istei\AppData\Local\Temp\STDcbc_000000.tmp"

. *--------------------------------------------------------------------
. * SCRIPT: 02_analysis.do
. * PURPOSE: replicates the tables and figures and saves the results
. *--------------------------------------------------------------------
. 
. *--------------------------------------------------
. * STRUCTURE OF THE DO-FILE
. /*
> 
>         1) Analysis Main Manuscript
>         2) Analysis Supplementary Online Materials
> 
> */
. *--------------------------------------------------
. * Load cleaned dataset
. clear

. use "$working_ANALYSIS/processed/psa_colombia_rdy.dta"

. 
. 
. 
. *--------------------------------------------------------------
. * 1) ANALYSIS MAIN MANUSCRIPT
. *--------------------------------------------------------------
. *define globals
. global 
invalid syntax
r(198);

end of do-file

r(198);

. do "C:\Users\istei\AppData\Local\Temp\STDcbc_000000.tmp"

. * Balancing check: Participants vs. Non-participants
. * Differences in socio-economic characteristics, preferences and perceptions (reciprocity, general trust and differing views on governance)
. gen pes_participation = 1 if phase_d ==8
(123 missing values generated)

. replace pes_participation = 2 if phase_d == 1
(56 real changes made)

. replace pes_participation = 3 if phase_d == 2
(67 real changes made)

. lab def pes_part 1 "Non-participant" 2 "Phase 1 only" 3 "Phase 1 & 2", replace

. lab val pes_participation pes_part

. 
. gen max_primary = 0 

. replace max_primary = 1 if id_educ < 4
(93 real changes made)

. lab var max_primary "Participant completed up to primary school but not more."

. 
. gen collective_action = 1 if community_activ==1
(109 missing values generated)

. replace collective_action = 2 if community_activ==5
(68 real changes made)

. replace collective_action = 3 if community_activ==4
(25 real changes made)

. replace collective_action = 4 if community_activ==3
(15 real changes made)

. replace collective_action = 5 if community_activ==2
(1 real change made)

. lab def collective_lab 1 "Never" 2 "Couple times a year" 3 "Once a month" 4 "Once a week" 5 "Everyday", replace

. lab val collective_action collective_lab

. gen never_collective = 0

. replace never_collective = 1 if collective_action == 1
(94 real changes made)

. lab var never_collective "=1 if participant never participates in community activities."

. 
. global balance female id_age max_primary income_hh_ppp econ_depend agricultor cattlemen merchant employee laborer othereconactivity farms_n land_siz
> e /// socio-economics
> civicorg_d pruductiveorg_d polspace collective_action never_collective  /// community involvement
> trust_people trust_townpeople trust_familiy responsibility_gov 

. iebaltab $balance , grpvar(pes_participation)  rowvarlabels save("$working_ANALYSIS/results/tables/TableS1_balancing") ftest fmissok replace

------------------------------------------------------------------------------------------------------------------------------------------------------
    Stata issued one or more warnings in relation to the tests in this balance table. Read the warning(s) below carefully before using the values
    generated for this table.

        Difference-in-Means Tests: The variance in both groups listed below is zero for the variable indicated and a difference-in-means test
        between the two groups is therefore not valid. Tests are reported as N/A in the table.

        +--------------------------------------------------------------+
        |   Test    |   Group    |    Balance Variable                 |
        |-----------+------------+-------------------------------------|
        | t-test    | (1)-(2)    |  laborer                            |
        +--------------------------------------------------------------+

    Stata issued one or more warnings in relation to the tests in this balance table. Read the warning(s) above carefully before using the values
    generated for this table.
------------------------------------------------------------------------------------------------------------------------------------------------------

    Balance table saved to: C:\Users\istei\Google Drive\Promotion\1_Projects\PES_Colombia\analysis/results/tables/TableS1_balancing.xlsx

. * joint f-tests no significant differnces in terms of socio-economics and other pre-specified variables potentially influencing intentions and vacci
> ne hesitancy
. 
. 
end of do-file

. tab primed

     primed |      Freq.     Percent        Cum.
------------+-----------------------------------
          0 |        143       70.44       70.44
          1 |         60       29.56      100.00
------------+-----------------------------------
      Total |        203      100.00

. do "C:\Users\istei\AppData\Local\Temp\STDcbc_000000.tmp"

. replace primed = . if pes_participation == 1
(80 real changes made, 80 to missing)

. 
. 
. 
end of do-file

. tab primed

     primed |      Freq.     Percent        Cum.
------------+-----------------------------------
          0 |         63       51.22       51.22
          1 |         60       48.78      100.00
------------+-----------------------------------
      Total |        123      100.00

. do "C:\Users\istei\AppData\Local\Temp\STDcbc_000000.tmp"

. reg pes_participation $balance if pes_participation <3, vce(hc3)
note: cattlemen omitted because of collinearity
note: laborer omitted because of collinearity

Linear regression                               Number of obs     =        134
                                                F(20, 113)        =       2.67
                                                Prob > F          =     0.0006
                                                R-squared         =     0.2399
                                                Root MSE          =     .46567

------------------------------------------------------------------------------------
                   |             Robust HC3
 pes_participation |      Coef.   Std. Err.      t    P>|t|     [95% Conf. Interval]
-------------------+----------------------------------------------------------------
            female |   .2899648   .1111076     2.61   0.010     .0698407     .510089
            id_age |   .0056498   .0037577     1.50   0.135    -.0017949    .0130945
       max_primary |   .0259715   .1125589     0.23   0.818     -.197028    .2489709
     income_hh_ppp |   .0000104   .0000283     0.37   0.714    -.0000457    .0000665
       econ_depend |   .0459884   .0249299     1.84   0.068    -.0034022    .0953789
        agricultor |  -.2019325   .1328621    -1.52   0.131    -.4651563    .0612912
         cattlemen |          0  (omitted)
          merchant |   .0566523   .2378034     0.24   0.812     -.414479    .5277837
          employee |   .1733612   .1633999     1.06   0.291    -.1503635    .4970859
           laborer |          0  (omitted)
 othereconactivity |  -.1259812   .1451268    -0.87   0.387    -.4135036    .1615412
           farms_n |  -.0569777   .0421603    -1.35   0.179    -.1405049    .0265495
         land_size |   .0009014   .0014962     0.60   0.548    -.0020629    .0038657
        civicorg_d |   .1115552   .1399404     0.80   0.427    -.1656919    .3888023
   pruductiveorg_d |   .0029386   .1401794     0.02   0.983     -.274782    .2806593
          polspace |   .0140791   .0559629     0.25   0.802    -.0967935    .1249516
 collective_action |  -.0387374   .0901265    -0.43   0.668    -.2172942    .1398194
  never_collective |  -.2436704   .1830458    -1.33   0.186    -.6063171    .1189764
      trust_people |   .0557393   .0457082     1.22   0.225    -.0348169    .1462956
  trust_townpeople |  -.0295416   .0396755    -0.74   0.458    -.1081459    .0490626
     trust_familiy |   .0406935     .03271     1.24   0.216     -.024111     .105498
responsibility_gov |  -.0088053   .0511668    -0.17   0.864    -.1101759    .0925653
             _cons |   .9402663   .4214744     2.23   0.028     .1052495    1.775283
------------------------------------------------------------------------------------

. 
end of do-file

. do "C:\Users\istei\AppData\Local\Temp\STDcbc_000000.tmp"

. reg pes_participation $balance if pes_participation <3
note: cattlemen omitted because of collinearity
note: laborer omitted because of collinearity

      Source |       SS           df       MS      Number of obs   =       134
-------------+----------------------------------   F(20, 113)      =      1.78
       Model |  7.73491159        20   .38674558   Prob > F        =    0.0307
    Residual |  24.5038944       113  .216848623   R-squared       =    0.2399
-------------+----------------------------------   Adj R-squared   =    0.1054
       Total |   32.238806       133  .242397037   Root MSE        =    .46567

------------------------------------------------------------------------------------
 pes_participation |      Coef.   Std. Err.      t    P>|t|     [95% Conf. Interval]
-------------------+----------------------------------------------------------------
            female |   .2899648    .104445     2.78   0.006     .0830404    .4968893
            id_age |   .0056498   .0036833     1.53   0.128    -.0016474     .012947
       max_primary |   .0259715   .1120248     0.23   0.817    -.1959699    .2479129
     income_hh_ppp |   .0000104   .0000201     0.52   0.606    -.0000295    .0000503
       econ_depend |   .0459884   .0234228     1.96   0.052    -.0004164    .0923931
        agricultor |  -.2019325   .1311064    -1.54   0.126    -.4616779    .0578129
         cattlemen |          0  (omitted)
          merchant |   .0566523   .1970761     0.29   0.774     -.333791    .4470957
          employee |   .1733612    .160103     1.08   0.281    -.1438317    .4905541
           laborer |          0  (omitted)
 othereconactivity |  -.1259812   .1417037    -0.89   0.376    -.4067218    .1547595
           farms_n |  -.0569777   .0414147    -1.38   0.172    -.1390278    .0250724
         land_size |   .0009014   .0004599     1.96   0.052    -9.73e-06    .0018125
        civicorg_d |   .1115552    .121891     0.92   0.362    -.1299328    .3530433
   pruductiveorg_d |   .0029386   .1168392     0.03   0.980    -.2285408    .2344181
          polspace |   .0140791   .0479151     0.29   0.769    -.0808494    .1090076
 collective_action |  -.0387374   .0785571    -0.49   0.623    -.1943732    .1168984
  never_collective |  -.2436704   .1581275    -1.54   0.126    -.5569495    .0696088
      trust_people |   .0557393   .0427959     1.30   0.195     -.029047    .1405257
  trust_townpeople |  -.0295416   .0425441    -0.69   0.489    -.1138292    .0547459
     trust_familiy |   .0406935   .0320784     1.27   0.207    -.0228597    .1042467
responsibility_gov |  -.0088053   .0505746    -0.17   0.862    -.1090028    .0913922
             _cons |   .9402663      .3756     2.50   0.014      .196135    1.684398
------------------------------------------------------------------------------------

. 
end of do-file

. do "C:\Users\istei\AppData\Local\Temp\STDcbc_000000.tmp"

. iebaltab $balance , grpvar(pes_participation)  rowvarlabels save("$working_ANALYSIS/results/tables/TableS1_balancing") ftest fmissok replace

------------------------------------------------------------------------------------------------------------------------------------------------------
    Stata issued one or more warnings in relation to the tests in this balance table. Read the warning(s) below carefully before using the values
    generated for this table.

        Difference-in-Means Tests: The variance in both groups listed below is zero for the variable indicated and a difference-in-means test
        between the two groups is therefore not valid. Tests are reported as N/A in the table.

        +--------------------------------------------------------------+
        |   Test    |   Group    |    Balance Variable                 |
        |-----------+------------+-------------------------------------|
        | t-test    | (1)-(2)    |  laborer                            |
        +--------------------------------------------------------------+

    Stata issued one or more warnings in relation to the tests in this balance table. Read the warning(s) above carefully before using the values
    generated for this table.
------------------------------------------------------------------------------------------------------------------------------------------------------

    Balance table saved to: C:\Users\istei\Google Drive\Promotion\1_Projects\PES_Colombia\analysis/results/tables/TableS1_balancing.xlsx

. 
end of do-file

. do "C:\Users\istei\AppData\Local\Temp\STDcbc_000000.tmp"

. global balance female id_age max_primary income_hh_ppp econ_depend agricultor cattlemen merchant employee  othereconactivity farms_n land_size /// s
> ocio-economics
> civicorg_d pruductiveorg_d polspace collective_action never_collective  /// community involvement
> trust_people trust_townpeople trust_familiy responsibility_gov 

. iebaltab $balance , grpvar(pes_participation)  rowvarlabels save("$working_ANALYSIS/results/tables/TableS1_balancing") ftest fmissok replace
    Balance table saved to: C:\Users\istei\Google Drive\Promotion\1_Projects\PES_Colombia\analysis/results/tables/TableS1_balancing.xlsx

. 
end of do-file

. do "C:\Users\istei\AppData\Local\Temp\STDcbc_000000.tmp"

. reg pes_participation $balance if pes_participation <3
note: cattlemen omitted because of collinearity

      Source |       SS           df       MS      Number of obs   =       134
-------------+----------------------------------   F(20, 113)      =      1.78
       Model |  7.73491159        20   .38674558   Prob > F        =    0.0307
    Residual |  24.5038944       113  .216848623   R-squared       =    0.2399
-------------+----------------------------------   Adj R-squared   =    0.1054
       Total |   32.238806       133  .242397037   Root MSE        =    .46567

------------------------------------------------------------------------------------
 pes_participation |      Coef.   Std. Err.      t    P>|t|     [95% Conf. Interval]
-------------------+----------------------------------------------------------------
            female |   .2899648    .104445     2.78   0.006     .0830404    .4968893
            id_age |   .0056498   .0036833     1.53   0.128    -.0016474     .012947
       max_primary |   .0259715   .1120248     0.23   0.817    -.1959699    .2479129
     income_hh_ppp |   .0000104   .0000201     0.52   0.606    -.0000295    .0000503
       econ_depend |   .0459884   .0234228     1.96   0.052    -.0004164    .0923931
        agricultor |  -.2019325   .1311064    -1.54   0.126    -.4616779    .0578129
         cattlemen |          0  (omitted)
          merchant |   .0566523   .1970761     0.29   0.774     -.333791    .4470957
          employee |   .1733612    .160103     1.08   0.281    -.1438317    .4905541
 othereconactivity |  -.1259812   .1417037    -0.89   0.376    -.4067218    .1547595
           farms_n |  -.0569777   .0414147    -1.38   0.172    -.1390278    .0250724
         land_size |   .0009014   .0004599     1.96   0.052    -9.73e-06    .0018125
        civicorg_d |   .1115552    .121891     0.92   0.362    -.1299328    .3530433
   pruductiveorg_d |   .0029386   .1168392     0.03   0.980    -.2285408    .2344181
          polspace |   .0140791   .0479151     0.29   0.769    -.0808494    .1090076
 collective_action |  -.0387374   .0785571    -0.49   0.623    -.1943732    .1168984
  never_collective |  -.2436704   .1581275    -1.54   0.126    -.5569495    .0696088
      trust_people |   .0557393   .0427959     1.30   0.195     -.029047    .1405257
  trust_townpeople |  -.0295416   .0425441    -0.69   0.489    -.1138292    .0547459
     trust_familiy |   .0406935   .0320784     1.27   0.207    -.0228597    .1042467
responsibility_gov |  -.0088053   .0505746    -0.17   0.862    -.1090028    .0913922
             _cons |   .9402663      .3756     2.50   0.014      .196135    1.684398
------------------------------------------------------------------------------------

. 
end of do-file

. do "C:\Users\istei\AppData\Local\Temp\STDcbc_000000.tmp"

. reg pes_participation $balance if pes_participation !=2

      Source |       SS           df       MS      Number of obs   =       144
-------------+----------------------------------   F(21, 122)      =      2.32
       Model |  40.5869034        21  1.93270969   Prob > F        =    0.0023
    Residual |  101.635319       122  .833076384   R-squared       =    0.2854
-------------+----------------------------------   Adj R-squared   =    0.1624
       Total |  142.222222       143  .994560995   Root MSE        =    .91273

------------------------------------------------------------------------------------
 pes_participation |      Coef.   Std. Err.      t    P>|t|     [95% Conf. Interval]
-------------------+----------------------------------------------------------------
            female |   .5522346   .2070405     2.67   0.009     .1423772     .962092
            id_age |   .0042955   .0066905     0.64   0.522     -.008949      .01754
       max_primary |   .3265662   .2280863     1.43   0.155    -.1249535    .7780858
     income_hh_ppp |  -.0000127   .0000423    -0.30   0.765    -.0000964    .0000711
       econ_depend |   .0494136   .0439505     1.12   0.263    -.0375908    .1364181
        agricultor |  -1.823337   .6887686    -2.65   0.009    -3.186824    -.459851
         cattlemen |  -1.480406   .7151926    -2.07   0.041    -2.896201   -.0646106
          merchant |   -1.76091    .813771    -2.16   0.032    -3.371851   -.1499695
          employee |  -1.174233   .7146501    -1.64   0.103    -2.588954    .2404886
 othereconactivity |  -1.407614   .6896367    -2.04   0.043    -2.772819   -.0424095
           farms_n |   .0810536   .0714798     1.13   0.259    -.0604477    .2225549
         land_size |   .0048504   .0015868     3.06   0.003     .0017092    .0079916
        civicorg_d |   .0083337   .2226543     0.04   0.970    -.4324326    .4491001
   pruductiveorg_d |   .0709124   .2088298     0.34   0.735     -.342487    .4843117
          polspace |  -.0295223   .0949557    -0.31   0.756    -.2174966    .1584521
 collective_action |  -.2635903   .1490628    -1.77   0.080    -.5586751    .0314945
  never_collective |   -.804317   .2985332    -2.69   0.008    -1.395293   -.2133408
      trust_people |   .1441307   .0831742     1.73   0.086    -.0205209    .3087822
  trust_townpeople |  -.0722744   .0782539    -0.92   0.358    -.2271858    .0826369
     trust_familiy |   .0460546   .0605316     0.76   0.448    -.0737737     .165883
responsibility_gov |    .077896   .0994466     0.78   0.435    -.1189685    .2747604
             _cons |   2.836017   .9729781     2.91   0.004     .9099092    4.762124
------------------------------------------------------------------------------------

. 
end of do-file

. do "C:\Users\istei\AppData\Local\Temp\STDcbc_000000.tmp"

. reg pes_participation $balance if pes_participation !=2

      Source |       SS           df       MS      Number of obs   =       144
-------------+----------------------------------   F(21, 122)      =      2.32
       Model |  40.5869034        21  1.93270969   Prob > F        =    0.0023
    Residual |  101.635319       122  .833076384   R-squared       =    0.2854
-------------+----------------------------------   Adj R-squared   =    0.1624
       Total |  142.222222       143  .994560995   Root MSE        =    .91273

------------------------------------------------------------------------------------
 pes_participation |      Coef.   Std. Err.      t    P>|t|     [95% Conf. Interval]
-------------------+----------------------------------------------------------------
            female |   .5522346   .2070405     2.67   0.009     .1423772     .962092
            id_age |   .0042955   .0066905     0.64   0.522     -.008949      .01754
       max_primary |   .3265662   .2280863     1.43   0.155    -.1249535    .7780858
     income_hh_ppp |  -.0000127   .0000423    -0.30   0.765    -.0000964    .0000711
       econ_depend |   .0494136   .0439505     1.12   0.263    -.0375908    .1364181
        agricultor |  -1.823337   .6887686    -2.65   0.009    -3.186824    -.459851
         cattlemen |  -1.480406   .7151926    -2.07   0.041    -2.896201   -.0646106
          merchant |   -1.76091    .813771    -2.16   0.032    -3.371851   -.1499695
          employee |  -1.174233   .7146501    -1.64   0.103    -2.588954    .2404886
 othereconactivity |  -1.407614   .6896367    -2.04   0.043    -2.772819   -.0424095
           farms_n |   .0810536   .0714798     1.13   0.259    -.0604477    .2225549
         land_size |   .0048504   .0015868     3.06   0.003     .0017092    .0079916
        civicorg_d |   .0083337   .2226543     0.04   0.970    -.4324326    .4491001
   pruductiveorg_d |   .0709124   .2088298     0.34   0.735     -.342487    .4843117
          polspace |  -.0295223   .0949557    -0.31   0.756    -.2174966    .1584521
 collective_action |  -.2635903   .1490628    -1.77   0.080    -.5586751    .0314945
  never_collective |   -.804317   .2985332    -2.69   0.008    -1.395293   -.2133408
      trust_people |   .1441307   .0831742     1.73   0.086    -.0205209    .3087822
  trust_townpeople |  -.0722744   .0782539    -0.92   0.358    -.2271858    .0826369
     trust_familiy |   .0460546   .0605316     0.76   0.448    -.0737737     .165883
responsibility_gov |    .077896   .0994466     0.78   0.435    -.1189685    .2747604
             _cons |   2.836017   .9729781     2.91   0.004     .9099092    4.762124
------------------------------------------------------------------------------------

. 
end of do-file

. do "C:\Users\istei\AppData\Local\Temp\STDcbc_000000.tmp"

. reg pes_participation $balance if pes_participation !=1

      Source |       SS           df       MS      Number of obs   =       118
-------------+----------------------------------   F(21, 96)       =      1.17
       Model |  5.97791573        21  .284662654   Prob > F        =    0.2929
    Residual |  23.3102199        96   .24281479   R-squared       =    0.2041
-------------+----------------------------------   Adj R-squared   =    0.0300
       Total |  29.2881356       117  .250325945   Root MSE        =    .49276

------------------------------------------------------------------------------------
 pes_participation |      Coef.   Std. Err.      t    P>|t|     [95% Conf. Interval]
-------------------+----------------------------------------------------------------
            female |  -.1256344   .1345586    -0.93   0.353    -.3927311    .1414623
            id_age |  -.0071656   .0045938    -1.56   0.122    -.0162842     .001953
       max_primary |   .0714145   .1334944     0.53   0.594    -.1935697    .3363987
     income_hh_ppp |   -.000035   .0000323    -1.08   0.282    -.0000992    .0000292
       econ_depend |  -.0302904   .0303842    -1.00   0.321    -.0906026    .0300218
        agricultor |  -.4870548    .385264    -1.26   0.209    -1.251798    .2776881
         cattlemen |  -.4249847   .4001974    -1.06   0.291     -1.21937    .3694007
          merchant |  -.6640057   .4432959    -1.50   0.137    -1.543941    .2159297
          employee |  -.4118137    .387315    -1.06   0.290    -1.180628    .3570005
 othereconactivity |  -.2618719   .3866576    -0.68   0.500    -1.029381    .5056373
           farms_n |   .1379832   .0442632     3.12   0.002     .0501215     .225845
         land_size |  -.0006529    .000478    -1.37   0.175    -.0016018    .0002959
        civicorg_d |  -.0550502   .1324332    -0.42   0.679    -.3179279    .2078276
   pruductiveorg_d |   .0665077   .1289364     0.52   0.607     -.189429    .3224444
          polspace |  -.0193019    .055374    -0.35   0.728    -.1292185    .0906147
 collective_action |  -.0403268   .0892794    -0.45   0.653     -.217545    .1368915
  never_collective |   .0007656   .1761406     0.00   0.997    -.3488708     .350402
      trust_people |   .0685061   .0525135     1.30   0.195    -.0357324    .1727446
  trust_townpeople |  -.0196705   .0550086    -0.36   0.721    -.1288617    .0895206
     trust_familiy |   -.044103   .0434189    -1.02   0.312    -.1302888    .0420829
responsibility_gov |   .0448143   .0571797     0.78   0.435    -.0686865    .1583151
             _cons |   3.303193   .5564988     5.94   0.000     2.198552    4.407835
------------------------------------------------------------------------------------

. 
end of do-file

. tab p_satisfaction

Satisfaction with |
   the programme. |      Freq.     Percent        Cum.
------------------+-----------------------------------
    Not satisfied |         15       12.20       12.20
                  |         24       19.51       31.71
                  |         34       27.64       59.35
totally satisfied |         48       39.02       98.37
       Don't know |          2        1.63      100.00
------------------+-----------------------------------
            Total |        123      100.00

. tab primed

     primed |      Freq.     Percent        Cum.
------------+-----------------------------------
          0 |         63       51.22       51.22
          1 |         60       48.78      100.00
------------+-----------------------------------
      Total |        123      100.00

. tab satisfied

  satisfied |      Freq.     Percent        Cum.
------------+-----------------------------------
          0 |        121       59.61       59.61
          1 |         82       40.39      100.00
------------+-----------------------------------
      Total |        203      100.00

. tab remember_d

remember_d= |
   1 if the |
participant |
  remembers |
participati |
  ng in the |
        PES |
  programme |      Freq.     Percent        Cum.
------------+-----------------------------------
          0 |          3        2.54        2.54
          1 |        115       97.46      100.00
------------+-----------------------------------
      Total |        118      100.00

. tab payment_rem_d

payment_rem |
  =1 if the |
 participan |
recalls the |
  amount of |
   payments |
     he/she |
    recived |      Freq.     Percent        Cum.
------------+-----------------------------------
          0 |          4        3.39        3.39
          1 |        114       96.61      100.00
------------+-----------------------------------
      Total |        118      100.00

. tab payment_n

 The number |
of payments |
   given to |
        the |
participant |
 during the |
 programme. |      Freq.     Percent        Cum.
------------+-----------------------------------
          1 |          8        6.67        6.67
          2 |         32       26.67       33.33
          3 |         46       38.33       71.67
          4 |         19       15.83       87.50
          5 |          6        5.00       92.50
          6 |          7        5.83       98.33
          7 |          1        0.83       99.17
          9 |          1        0.83      100.00
------------+-----------------------------------
      Total |        120      100.00

. do "C:\Users\istei\AppData\Local\Temp\STDcbc_000000.tmp"

. gen amount_per_payment = payment_t / payment_n
(83 missing values generated)

. 
end of do-file

. sum amount_per_payment

    Variable |        Obs        Mean    Std. Dev.       Min        Max
-------------+---------------------------------------------------------
amount_per~t |        120     2233918     3378943      70000   2.00e+07

. do "C:\Users\istei\AppData\Local\Temp\STDcbc_000000.tmp"

. gen amount_per_payment_ppp = amount_per_payment / 1322.16
(83 missing values generated)

. 
end of do-file

. sum amount_per_payment_ppp

    Variable |        Obs        Mean    Std. Dev.       Min        Max
-------------+---------------------------------------------------------
amount_per~p |        120    1689.598    2555.623   52.94367   15126.76

. tab payment_u

   For what did the participant use the |
                                  money |      Freq.     Percent        Cum.
----------------------------------------+-----------------------------------
                                      . |          2        1.63        1.63
50% par reinversin en la finca y pro.. |          1        0.81        2.44
                                 Ahorro |          1        0.81        3.25
  Ahorro e invertir en la propia finca. |          1        0.81        4.07
Alimentacin y estudio de la familia... |          1        0.81        4.88
Alimentos y ayuda del estudio de los .. |          1        0.81        5.69
         Arreglo de la casa donde vive. |          1        0.81        6.50
Arregl de cercas de la finca. Dar di.. |          1        0.81        7.32
Arregl su casa, pag estudio a sus h.. |          1        0.81        8.13
Aumentar la participacin en el proce.. |          1        0.81        8.94
Ayudas de pagar impuestos y reforesta.. |          1        0.81        9.76
Beneficios de la misma finca, protecc.. |          1        0.81       10.57
            Cercar linderos de su finca |          1        0.81       11.38
Cercar los nacimientos de agua. Y pag.. |          1        0.81       12.20
Compramos rboles para sembrar en la .. |          1        0.81       13.01
              Comprar electrodomsticos |          1        0.81       13.82
Comprar ganado, ahorro para comprar o.. |          1        0.81       14.63
Comprar rboles nativos y pagar impue.. |          1        0.81       15.45
                      Compr unas vacas |          1        0.81       16.26
Construir cerca, comprar rboles y su.. |          1        0.81       17.07
           Educacin y cosas del hogar. |          1        0.81       17.89
El pago fue reembolso de la gobernaci.. |          1        0.81       18.70
En la conservacin y preservacin de .. |          1        0.81       19.51
               En los cultivos de mora. |          1        0.81       20.33
Estudio de la hija, para la salud y p.. |          1        0.81       21.14
Fase 1 se hizo una cerca y se limpi... |          1        0.81       21.95
          Gasto personales y del hogar. |          1        0.81       22.76
Gastos del seor Fortunato Daz que s.. |          1        0.81       23.58
                      Gastos personales |          1        0.81       24.39
Gastos personales (alimentacin) y tr.. |          1        0.81       25.20
Gastos personales y compr uno alambr.. |          1        0.81       26.02
          Gastos personales y medicinas |          1        0.81       26.83
Gastos personales y pagar deudas, par.. |          1        0.81       27.64
                      Gatos de la casa. |          1        0.81       28.46
Hacer actividades en la finca rboles.. |          1        0.81       29.27
Impuestos del predio includo en el p.. |          1        0.81       30.08
Invertidos en el predio y asistencia .. |          1        0.81       30.89
Inviertieron en cercas vivas con rbo.. |          1        0.81       31.71
Lo reparti entre los dueos de los p.. |          1        0.81       32.52
             Mantenimiento de la finca. |          1        0.81       33.33
Mantenimiento de la reserva. Cercado .. |          1        0.81       34.15
Mejoras del predio en conservacin, r.. |          1        0.81       34.96
                           Pagar deudas |          1        0.81       35.77
Pagar el impuesto de la finca y cerca.. |          1        0.81       36.59
                        Pagar impuestos |          1        0.81       37.40
Pagar impuestos, gastos del hogar y m.. |          1        0.81       38.21
Pago del impuesto predio, vigilancia .. |          1        0.81       39.02
                         Pago impuestos |          1        0.81       39.84
Pago impuestos y para reparacin del .. |          1        0.81       40.65
       Pague finca raz mand a cercar. |          1        0.81       41.46
 Para arreglar el predio en el cercado. |          1        0.81       42.28
Para arreglar la veracidad para evita.. |          1        0.81       43.09
Para arreglos de l finca, alambre, ce.. |          1        0.81       43.90
               Para arregl de la finca |          1        0.81       44.72
Para beneficio de la misma finca serc.. |          1        0.81       45.53
 Para cercar el predio y para la valla. |          1        0.81       46.34
                   Para cercar la finca |          2        1.63       47.97
Para cercar un nacimiento y para rein.. |          1        0.81       48.78
Para cercar y arreglar un pedazo de p.. |          1        0.81       49.59
Para cercar, para la alimentacin y p.. |          1        0.81       50.41
Para cercar, para reforestacion del p.. |          1        0.81       51.22
            Para comprar unos terneros. |          1        0.81       52.03
Para cuidar el predio para que no le .. |          1        0.81       52.85
                        Para el predial |          2        1.63       54.47
Para el predial y para cercar la finca. |          1        0.81       55.28
Para el predial y para gastos del dia.. |          1        0.81       56.10
  Para el predial, impuestos y sustento |          1        0.81       56.91
                       Para el sustento |          1        0.81       57.72
Para el sustento y se cerco la finca .. |          1        0.81       58.54
Para el sustento, para el pago de un .. |          1        0.81       59.35
         Para encerramiento del predio. |          1        0.81       60.16
Para gastos de m madre y para cercar.. |          1        0.81       60.98
                 Para gastos personales |          1        0.81       61.79
    Para gastos personales y del predio |          1        0.81       62.60
                Para gastos personales. |          1        0.81       63.41
Para impuestos prediales, y reinversi.. |          1        0.81       64.23
Para invertir en la finca en conserva.. |          1        0.81       65.04
Para la esposa que estaba enferma y g.. |          1        0.81       65.85
Para la misma finca se cerco para que.. |          1        0.81       66.67
                        Para las deudas |          1        0.81       67.48
Para limitar el predio en reserva, al.. |          1        0.81       68.29
Para limpiar el predio y para el sust.. |          1        0.81       69.11
Para los servicios de la casa y para .. |          1        0.81       69.92
Para mano de obra en la finca, para r.. |          1        0.81       70.73
        Para mantenimiento de la finca. |          1        0.81       71.54
Para mejoras del predio, vayas y refo.. |          1        0.81       72.36
Para pagar impuestos de la finca y me.. |          1        0.81       73.17
Para pagar impuestos del predio y par.. |          1        0.81       73.98
       Para pagar impuestos del predio. |          1        0.81       74.80
Para pagar impuestos y otra parte par.. |          1        0.81       75.61
Para ponernos al da con los impuesto.. |          1        0.81       76.42
Para protegerse el mismo bosque que e.. |          1        0.81       77.24
    Para recuperar otra rea del predio |          1        0.81       78.05
        Para reforestar la misma finca. |          1        0.81       78.86
Para reinversin en l finca y gastos .. |          1        0.81       79.67
Para reinversin en la finca, para ce.. |          1        0.81       80.49
Para reinvertir en la finca y para ce.. |          1        0.81       81.30
Para trabajar en las labores de la fi.. |          1        0.81       82.11
Para rboles nativos y remplazar no n.. |          1        0.81       82.93
Potencializar la parte productiva de .. |          1        0.81       83.74
Principalmente para radicar el espino.. |          1        0.81       84.55
                  Resiembra de rboles. |          1        0.81       85.37
Se compraron rboles y se arregl el .. |          1        0.81       86.18
Se delimit el predio con postes y fi.. |          1        0.81       86.99
Se dividi entre los dueos para inve.. |          1        0.81       87.80
Se invirti en el mismo predio y para.. |          1        0.81       88.62
Se invirti en la finca,  mejoramient.. |          1        0.81       89.43
       Se reparti entre los herederos. |          1        0.81       90.24
Sembrar rboles en el predio y se enc.. |          1        0.81       91.06
               Sembrar rboles nativos. |          1        0.81       91.87
Sembrar rboles y conservacin pagar .. |          1        0.81       92.68
Siembra de arboles, pagar impuesto de.. |          1        0.81       93.50
Sostenimiento para aislar la parte h.. |          1        0.81       94.31
Subsistencia pago del predial manteni.. |          1        0.81       95.12
Sustento de la familia y pagar el imp.. |          1        0.81       95.93
Toco devolverlo porque un hermano no .. |          1        0.81       96.75
Toco poner vallas, cercas, solo fue p.. |          1        0.81       97.56
     Varias cosas, distintos objetivos. |          1        0.81       98.37
Viticos de las reuniones Ubate, ya q.. |          1        0.81       99.19
rboles para el predio y alambrado pa.. |          1        0.81      100.00
----------------------------------------+-----------------------------------
                                  Total |        123      100.00

. tab payment_t

      Total |
  amount of |
money payed |
     to the |
participant |
 during the |
  porgramme |      Freq.     Percent        Cum.
------------+-----------------------------------
       9999 |          1        0.83        0.83
     133000 |          1        0.83        1.65
     140000 |          1        0.83        2.48
     150000 |          1        0.83        3.31
     210000 |          1        0.83        4.13
     300000 |          1        0.83        4.96
     400000 |          2        1.65        6.61
     420000 |          2        1.65        8.26
     500000 |          3        2.48       10.74
     525000 |          1        0.83       11.57
     540000 |          1        0.83       12.40
     589452 |          1        0.83       13.22
     600000 |          2        1.65       14.88
     700000 |          3        2.48       17.36
     717000 |          1        0.83       18.18
     720000 |          1        0.83       19.01
     750000 |          1        0.83       19.83
     800000 |          3        2.48       22.31
     840000 |          1        0.83       23.14
     852000 |          1        0.83       23.97
     960000 |          1        0.83       24.79
    1000000 |          1        0.83       25.62
    1100000 |          1        0.83       26.45
    1200000 |          7        5.79       32.23
    1400000 |          3        2.48       34.71
    1500000 |          3        2.48       37.19
    1600000 |          4        3.31       40.50
    1800000 |          3        2.48       42.98
    2000000 |          2        1.65       44.63
    2300000 |          1        0.83       45.45
    2350000 |          1        0.83       46.28
    2400000 |          2        1.65       47.93
    2500000 |          2        1.65       49.59
    2800000 |          2        1.65       51.24
    3000000 |          5        4.13       55.37
    3200000 |          1        0.83       56.20
    3400000 |          1        0.83       57.02
    3700000 |          1        0.83       57.85
    4000000 |          3        2.48       60.33
    4200000 |          1        0.83       61.16
    4500000 |          1        0.83       61.98
    4600000 |          1        0.83       62.81
    5000000 |          3        2.48       65.29
    5500000 |          1        0.83       66.12
    6000000 |          6        4.96       71.07
    7000000 |          5        4.13       75.21
    8000000 |          3        2.48       77.69
    9000000 |          2        1.65       79.34
    9500000 |          1        0.83       80.17
   1.20e+07 |          2        1.65       81.82
   1.30e+07 |          1        0.83       82.64
   1.50e+07 |          2        1.65       84.30
   1.53e+07 |          1        0.83       85.12
   1.60e+07 |          2        1.65       86.78
   1.70e+07 |          1        0.83       87.60
   1.78e+07 |          1        0.83       88.43
   1.90e+07 |          1        0.83       89.26
   1.95e+07 |          1        0.83       90.08
   2.00e+07 |          4        3.31       93.39
   2.20e+07 |          1        0.83       94.21
   2.40e+07 |          2        1.65       95.87
   2.80e+07 |          1        0.83       96.69
   3.26e+07 |          1        0.83       97.52
   3.30e+07 |          1        0.83       98.35
   4.00e+07 |          1        0.83       99.17
   7.00e+07 |          1        0.83      100.00
------------+-----------------------------------
      Total |        121      100.00

. tab payment_n

 The number |
of payments |
   given to |
        the |
participant |
 during the |
 programme. |      Freq.     Percent        Cum.
------------+-----------------------------------
          1 |          8        6.67        6.67
          2 |         32       26.67       33.33
          3 |         46       38.33       71.67
          4 |         19       15.83       87.50
          5 |          6        5.00       92.50
          6 |          7        5.83       98.33
          7 |          1        0.83       99.17
          9 |          1        0.83      100.00
------------+-----------------------------------
      Total |        120      100.00

. tab know_part

know_part=1 |
     if the |
     person |
knows other |
people that |
       have |
participate |
   d in the |
      progr |      Freq.     Percent        Cum.
------------+-----------------------------------
          0 |         74       36.45       36.45
          1 |        129       63.55      100.00
------------+-----------------------------------
      Total |        203      100.00

. tab know_part_n

  Number of |
people that |
        the |
 participan |
 knows that |
       have |
participate |
   d too in |
    the pro |      Freq.     Percent        Cum.
------------+-----------------------------------
          1 |         23       17.83       17.83
          2 |         24       18.60       36.43
          3 |         15       11.63       48.06
          4 |         17       13.18       61.24
          5 |         14       10.85       72.09
          6 |          7        5.43       77.52
          7 |          1        0.78       78.29
          8 |          2        1.55       79.84
         10 |          9        6.98       86.82
         11 |          1        0.78       87.60
         12 |          2        1.55       89.15
         14 |          1        0.78       89.92
         15 |          2        1.55       91.47
         16 |          1        0.78       92.25
         20 |          2        1.55       93.80
         22 |          1        0.78       94.57
         25 |          1        0.78       95.35
         30 |          2        1.55       96.90
         35 |          1        0.78       97.67
         40 |          1        0.78       98.45
         50 |          2        1.55      100.00
------------+-----------------------------------
      Total |        129      100.00

. tab participate_d

participate |
_d=1 if the |
     person |
participate |
   d in the |
  programme |
  design or |
 adjustment |      Freq.     Percent        Cum.
------------+-----------------------------------
          0 |        118       95.93       95.93
          1 |          5        4.07      100.00
------------+-----------------------------------
      Total |        123      100.00

. tab participate_w

  Way of Participation in the programme |
                      design/adjustment |      Freq.     Percent        Cum.
----------------------------------------+-----------------------------------
                                      . |        110       95.65       95.65
Apoyar en la conservacin pero con co.. |          1        0.87       96.52
Dando sugerencias sobre la parte de a.. |          1        0.87       97.39
En las reuniones sobre aspectos relac.. |          1        0.87       98.26
         Los pro y contra del programa. |          1        0.87       99.13
     Reuniones para ajuste de programa. |          1        0.87      100.00
----------------------------------------+-----------------------------------
                                  Total |        115      100.00

. tab participate_o_d

participate |
_o=1 if the |
     person |
 knows that |
  there are |
      other |
     people |
      still |
 receiving  |      Freq.     Percent        Cum.
------------+-----------------------------------
          0 |         71       57.72       57.72
          1 |         52       42.28      100.00
------------+-----------------------------------
      Total |        123      100.00

. tab selection_op

            Opinion on the selection of |
   participants of the programme. (open |
                                 ended) |      Freq.     Percent        Cum.
----------------------------------------+-----------------------------------
A quien se le da? Cuando es a funcion.. |          1        0.81        0.81
A veces  se selecciona personas que n.. |          1        0.81        1.63
Con l gente que conoce lenparece bien.. |          1        0.81        2.44
Considero que mi predio est en un r.. |          1        0.81        3.25
Creo que los participantes del progra.. |          1        0.81        4.07
De todas maneras hay gente que le pag.. |          1        0.81        4.88
Debera cubrir a todas las personas q.. |          1        0.81        5.69
Desconoce como eligen a los participa.. |          1        0.81        6.50
Desconoce los criterios de seleccin .. |          1        0.81        7.32
Desconozco la seleccin y participacin |          1        0.81        8.13
Desde que la cmara de comercio lo de.. |          1        0.81        8.94
El enfoque est desviado, cuando se c.. |          1        0.81        9.76
El go tierno debera dar un auxilio m.. |          1        0.81       10.57
El proceso de seleccin lo hacen la C.. |          1        0.81       11.38
      En lo que yo se lo hicieron bien. |          1        0.81       12.20
                               Es buena |          1        0.81       13.01
Es buena porque de verdad seleccionan.. |          1        0.81       13.82
Es bueno porque esos terrenos estan a.. |          1        0.81       14.63
Es bueno, de algo le sirve a uno, par.. |          1        0.81       15.45
Es difcil  de opinar cuando no se pa.. |          1        0.81       16.26
Es difcil conseguir personas para la.. |          1        0.81       17.07
Es difcil de entender porque o todos.. |          1        0.81       17.89
Es injusto por qu m predio est jub.. |          1        0.81       18.70
Es injusto porque realmente deberan .. |          1        0.81       19.51
                           Es muy bueno |          1        0.81       20.33
Es muy bueno que la gente la motiven .. |          1        0.81       21.14
Escogen a los que ms tienen monte pa.. |          1        0.81       21.95
Eso fue bueno por qu escogieron pers.. |          1        0.81       22.76
Esta bien pero que den los pagos de a.. |          1        0.81       23.58
         Esta bien por ser propietarios |          1        0.81       24.39
Esta muy bueno porque es un beneficio.. |          1        0.81       25.20
Estoy en desacuerdo por qu el predio.. |          1        0.81       26.02
Estuve en desacuerdo con unos temas, .. |          1        0.81       26.83
Estuvo muy bien y claro el proceso de.. |          1        0.81       27.64
Estuvo muy bien y que nos pagarn alg.. |          1        0.81       28.46
   Est bien ingresaron los que fueron. |          1        0.81       29.27
Est bien por a la proteccin del eco.. |          1        0.81       30.08
Est de acuerdo con el proceso de sel.. |          1        0.81       30.89
Est de acuerdo con que participen pr.. |          1        0.81       31.71
Est muy bien que cuidan el agua, per.. |          1        0.81       32.52
Est satisfecho con la seleccin ya q.. |          1        0.81       33.33
Estn escogiendo gente que tienen gra.. |          1        0.81       34.15
                   Falta de informacin |          1        0.81       34.96
        Falto divulgacin del programa. |          1        0.81       35.77
Fue a criterio de patrimonio nacional.. |          1        0.81       36.59
                              Fue buena |          1        0.81       37.40
Fue bueno por qu lograron cuidar eso.. |          1        0.81       38.21
Fue muy buena la seleccin pero debie.. |          1        0.81       39.02
Fue muy buena la verificacin fue muy.. |          1        0.81       39.84
Fue muy bueno y ayud a preservar muc.. |          1        0.81       40.65
Fue muy bueno, esperamos que mejore m.. |          1        0.81       41.46
Fue muy bueno, por qu ayud a muchas.. |          1        0.81       42.28
Fue pura poltica, hay gente que en s.. |          1        0.81       43.09
Fue una seleccin muy buena ya que la.. |          1        0.81       43.90
Fueron bien escogidos con documentos .. |          1        0.81       44.72
 Fueron bien escogidos por el programa. |          1        0.81       45.53
Fu buena pero me entristece que no s.. |          1        0.81       46.34
Hay descordinacion, inconsistencias e.. |          1        0.81       47.15
Hay gente que verdaderamente cuida el.. |          1        0.81       47.97
Hay que seleccionar los terrenos no l.. |          1        0.81       48.78
Hubo muchas dudas, hay gente que se q.. |          1        0.81       49.59
Influye mucho la poltica para dar pr.. |          1        0.81       50.41
La ley debe ser para todos, el predio.. |          1        0.81       51.22
La seleccin cumpli con los requerim.. |          1        0.81       52.03
La seleccin fue justa. Y no tuvo que.. |          1        0.81       52.85
        La verdad me pareci muy bueno. |          1        0.81       53.66
Le gente que entra es gente que tiene.. |          1        0.81       54.47
Le parece buena la seleccin de perso.. |          1        0.81       55.28
Le parece bueno porque lo toman a uno.. |          1        0.81       56.10
Le parece justo del cambio de pero lo.. |          1        0.81       56.91
Le parece muy bien ya que los que est.. |          1        0.81       57.72
Le parece muy bueno y el predio de no.. |          1        0.81       58.54
        Le parece que fue muy acertado. |          1        0.81       59.35
Le pareci buena la seleccin porque .. |          1        0.81       60.16
Manta tambin es estratgico, nos dij.. |          1        0.81       60.98
Me imagino que han hecho vosotros y q.. |          1        0.81       61.79
Me parece que hay gente que necesita .. |          1        0.81       62.60
Mi fica tiene agua y buen bosque, no .. |          1        0.81       63.41
Muy apresurado y no sigui el program.. |          1        0.81       64.23
Muy bien pero la gente est incmoda .. |          1        0.81       65.04
Muy buena la seleccin y las visitas .. |          1        0.81       65.85
 Muy bueno la idea es conservar bosque. |          1        0.81       66.67
Ni me va ni me viene porque no se com.. |          1        0.81       67.48
      No conozco cmo fue la seleccin. |          1        0.81       68.29
No conozco ni criterios ni metodolog.. |          1        0.81       69.11
No cree que se deba a seleccionar a n.. |          1        0.81       69.92
No est muy enterado, ellos son los q.. |          1        0.81       70.73
No me parece. Yo estaba en el program.. |          1        0.81       71.54
No sabe  a ciencia cierta como hacen .. |          1        0.81       72.36
No sabe a quienes los seleccionarn p.. |          1        0.81       73.17
No sabe por qu sali del programa. N.. |          1        0.81       73.98
No se como seleccionarn, esta mal po.. |          1        0.81       74.80
No se los motivos, pero por voz a voz.. |          1        0.81       75.61
No se que pensar que pensar, mi finca.. |          1        0.81       76.42
No tiene conocimiento, su marido resp.. |          1        0.81       77.24
    No tiene opinin sobre el programa. |          1        0.81       78.05
Para m que hay personas que con obli.. |          1        0.81       78.86
Por lgica corpoguvio queda lejos de .. |          1        0.81       79.67
Que debera haber llamado a los propi.. |          1        0.81       80.49
Que debera hacer a ms a conciencia .. |          1        0.81       81.30
Que deberan seguir los mismos. Quie.. |          1        0.81       82.11
             Que estn realizando bien. |          1        0.81       82.93
Que fue bueno y entre ms nos incenti.. |          1        0.81       83.74
Que fue muy bueno por qu los que con.. |          1        0.81       84.55
Que las fincas que estn en protecci.. |          1        0.81       85.37
Que las personas se benefician del pr.. |          1        0.81       86.18
Que no deba ser as, por qu el pred.. |          1        0.81       86.99
Que no le parece por qu debieron reu.. |          1        0.81       87.80
Que se qued corto, para la demanda d.. |          1        0.81       88.62
Se ajust en gran parte a las necesid.. |          1        0.81       89.43
        Se benefici gente muy humilde. |          1        0.81       90.24
Se debe bcer de buena f, le extraa .. |          1        0.81       91.06
Se debera abrir ms espacio para per.. |          1        0.81       91.87
Se debera apoyar ms a los pequeos .. |          1        0.81       92.68
Se debera seleccinar mejor los prop.. |          1        0.81       93.50
Se debiera seguir el programa, hay mu.. |          1        0.81       94.31
Se me hace bueno que se haya vuelto m.. |          1        0.81       95.12
Se necesita ser ms estructurada en e.. |          1        0.81       95.93
Supone que no hay recursos para cubri.. |          1        0.81       96.75
S seleccionaron a personas que tena.. |          1        0.81       97.56
Tienen que seleccionar a personas que.. |          1        0.81       98.37
Todos somos merecedores de la program.. |          1        0.81       99.19
Yo digo que bonito pero dijeron que c.. |          1        0.81      100.00
----------------------------------------+-----------------------------------
                                  Total |        123      100.00

. tab selection_f

   Perceived |
 fairness of |
 participant |
   selection |
    process. |      Freq.     Percent        Cum.
-------------+-----------------------------------
    Not fair |         19       15.45       15.45
             |         19       15.45       30.89
             |         24       19.51       50.41
totally fair |         41       33.33       83.74
  Don't know |         20       16.26      100.00
-------------+-----------------------------------
       Total |        123      100.00

. tab p_people_d

      Knows |
     people |
  currently |
     in the |
  pregramme |      Freq.     Percent        Cum.
------------+-----------------------------------
          0 |        174       85.71       85.71
          1 |         29       14.29      100.00
------------+-----------------------------------
      Total |        203      100.00

. tab deforestation

   There is very |
little we can do |
       to reduce |
  deforestation. |      Freq.     Percent        Cum.
-----------------+-----------------------------------
Totally disagree |         66       32.51       32.51
        Disagree |         45       22.17       54.68
           Agree |         56       27.59       82.27
   Totally agree |         36       17.73      100.00
-----------------+-----------------------------------
           Total |        203      100.00

. tab cut_trees_d

cut_trees_d |
  =1 if the |
person  has |
  cut trees |
  or forest |
      after |
leaving the |
  programme |      Freq.     Percent        Cum.
------------+-----------------------------------
          0 |        102       91.89       91.89
          1 |          9        8.11      100.00
------------+-----------------------------------
      Total |        111      100.00

. tab cut_trees_n

  amount of |
trees or ha |
  of forest |
        cut |      Freq.     Percent        Cum.
------------+-----------------------------------
          2 |          2       50.00       50.00
          7 |          1       25.00       75.00
         10 |          1       25.00      100.00
------------+-----------------------------------
      Total |          4      100.00

. tab cut_trees_u

                   Units of cut_trees_n |      Freq.     Percent        Cum.
----------------------------------------+-----------------------------------
                                      . |         53       92.98       92.98
                                Arboles |          1        1.75       94.74
                                rboles |          1        1.75       96.49
                   rboles de eucalipto |          1        1.75       98.25
 rboles porque se cayeron en carretera |          1        1.75      100.00
----------------------------------------+-----------------------------------
                                  Total |         57      100.00

. tab enjoy_care

 Joy from taking |
     care of the |
          Forest |      Freq.     Percent        Cum.
-----------------+-----------------------------------
Totally disagree |          1        0.49        0.49
        Disagree |          2        0.99        1.48
           Agree |         29       14.29       15.76
   Totally agree |        171       84.24      100.00
-----------------+-----------------------------------
           Total |        203      100.00

. tab neighbors

      The people |
   closest to me |
  would be upset |
    with me if I |
  knock down the |
         forest. |      Freq.     Percent        Cum.
-----------------+-----------------------------------
Totally disagree |         15        7.39        7.39
        Disagree |         21       10.34       17.73
           Agree |         43       21.18       38.92
   Totally agree |        124       61.08      100.00
-----------------+-----------------------------------
           Total |        203      100.00

. tab control_publicw

    Control over |
  public workers |      Freq.     Percent        Cum.
-----------------+-----------------------------------
Totally disagree |          4        1.97        1.97
        Disagree |         17        8.37       10.34
           Agree |         65       32.02       42.36
   Totally agree |        117       57.64      100.00
-----------------+-----------------------------------
           Total |        203      100.00

. tab neighbors_critic

    My neighbors |
 would criticize |
  me if I damage |
     the forest. |      Freq.     Percent        Cum.
-----------------+-----------------------------------
Totally disagree |         18        8.87        8.87
        Disagree |         24       11.82       20.69
           Agree |         39       19.21       39.90
   Totally agree |        122       60.10      100.00
-----------------+-----------------------------------
           Total |        203      100.00

. tab know_nonpart

know_nonpar |
     t=1 if |
     he/she |
    knows a |
person with |
 farms/land |
  that have |
        not |
 participat |      Freq.     Percent        Cum.
------------+-----------------------------------
          0 |        178       87.68       87.68
          1 |         25       12.32      100.00
------------+-----------------------------------
      Total |        203      100.00

. tab know_prog_d

know_prog_d |
  =1 if the |
     person |
  knows the |
  programme |      Freq.     Percent        Cum.
------------+-----------------------------------
          0 |         44       51.76       51.76
          1 |         41       48.24      100.00
------------+-----------------------------------
      Total |         85      100.00

. tab know_prog

   What does the person knows about the |
                  programme (open text) |      Freq.     Percent        Cum.
----------------------------------------+-----------------------------------
                                      . |         42       53.85       53.85
Beneficios econmicos por proteger bo.. |          1        1.28       55.13
Depende del rea de conservacin que .. |          1        1.28       56.41
El programa exiga el cuidado de los .. |          1        1.28       57.69
            En una reunin del consejo. |          1        1.28       58.97
Encerrada de los nasederos y cuidado .. |          1        1.28       60.26
Era un programa que le daba incentivo.. |          1        1.28       61.54
Fueron convocados para un programa de.. |          1        1.28       62.82
Hay vecinos que recibieron apoyo por .. |          1        1.28       64.10
La CAR visit el la vereda y prometid.. |          1        1.28       65.38
La organizacin dice  que cuidar la n.. |          1        1.28       66.67
Las autoridades ambientales para otor.. |          1        1.28       67.95
Le pagan a uno por cuidar el monte si.. |          1        1.28       69.23
Les reconocan dinero por la siembra .. |          1        1.28       70.51
              Lo escucho por el vecino. |          1        1.28       71.79
              Lo escuch por televisin |          1        1.28       73.08
Lo estaba liderando la Car y la secre.. |          1        1.28       74.36
                  Me coment un vecino. |          1        1.28       75.64
Nontimbar los rboles y sembrarlos. N.. |          1        1.28       76.92
Por los guardabosques, para la zona d.. |          1        1.28       78.21
                  Por medio de un amigo |          1        1.28       79.49
Que daban beneficio para sembrar rbo.. |          1        1.28       80.77
Que daban un incentivo para pagar el .. |          1        1.28       82.05
Que el programa dice que no se deben .. |          1        1.28       83.33
Que en el programa dan rboles para r.. |          1        1.28       84.62
Que gente protegiendo el bosque para .. |          1        1.28       85.90
Que iba a haber un subsidio para cuid.. |          1        1.28       87.18
Que la persona debe afiliar y ser gua.. |          1        1.28       88.46
Que le pagan a las personas un incent.. |          1        1.28       89.74
Que pagaban que daban 400 anuales por.. |          1        1.28       91.03
Que proteger el agua y multas para qu.. |          1        1.28       92.31
Que realizan pagos para la presentaci.. |          1        1.28       93.59
Segn el tamao del predio le dan al .. |          1        1.28       94.87
Sobre el pago para conservar colchone.. |          1        1.28       96.15
       S un programa para los pramos. |          1        1.28       97.44
Tengo unos vecinos que reciben benefi.. |          1        1.28       98.72
Una hija particip con una rica que e.. |          1        1.28      100.00
----------------------------------------+-----------------------------------
                                  Total |         78      100.00

. tab apply_prog_d

apply_prog_ |
 d=1 if the |
     person |
 applied to |
        the |
  programme |      Freq.     Percent        Cum.
------------+-----------------------------------
          0 |         72       84.71       84.71
          1 |         13       15.29      100.00
------------+-----------------------------------
      Total |         85      100.00

. tab prog_selection

      Reason why the person did not get |
 selected into the programme, according |
                                to them |      Freq.     Percent        Cum.
----------------------------------------+-----------------------------------
                                      . |         65       89.04       89.04
Hicieron una reunin informativa pero.. |          1        1.37       90.41
Los funcionionarios incumplieron con .. |          1        1.37       91.78
Por no tener el documento legal del p.. |          1        1.37       93.15
Por qu el predio que presentamos est.. |          1        1.37       94.52
Por qu no estaba en el momento y lo .. |          1        1.37       95.89
           Porque no haba presupuesto. |          1        1.37       97.26
                     Retiro voluntario. |          1        1.37       98.63
Se arrepiento porque luego no quedaba.. |          1        1.37      100.00
----------------------------------------+-----------------------------------
                                  Total |         73      100.00

. tab noapply_prog

 Reason for |
        not |
applying to |
        the |
  programme |      Freq.     Percent        Cum.
------------+-----------------------------------
          1 |         59       81.94       81.94
          2 |          5        6.94       88.89
          3 |          4        5.56       94.44
          4 |          1        1.39       95.83
          7 |          3        4.17      100.00
------------+-----------------------------------
      Total |         72      100.00

. tab noapply_prog_1

 Reason for |
        not |
applying to |
        the |
 programme: |
 the person |
    did not |
   know the |
  programme |      Freq.     Percent        Cum.
------------+-----------------------------------
          0 |         12       16.67       16.67
          1 |         60       83.33      100.00
------------+-----------------------------------
      Total |         72      100.00

. tab noapply_prog_2

 Reason for |
        not |
applying to |
        the |
 programme: |
 the person |
    did not |
   meet the |
 requiremen |      Freq.     Percent        Cum.
------------+-----------------------------------
          0 |         67       93.06       93.06
          1 |          5        6.94      100.00
------------+-----------------------------------
      Total |         72      100.00

. tab noapply_prog_3

 Reason for |
        not |
applying to |
        the |
 programme: |
       'The |
application |
     or the |
process was |
         ve |      Freq.     Percent        Cum.
------------+-----------------------------------
          0 |         68       94.44       94.44
          1 |          4        5.56      100.00
------------+-----------------------------------
      Total |         72      100.00

. tab  noapply_prog_5

 Reason for |
        not |
applying to |
        the |
 programme: |
 the person |
    did NOT |
  trust the |
  programme |      Freq.     Percent        Cum.
------------+-----------------------------------
          0 |         72      100.00      100.00
------------+-----------------------------------
      Total |         72      100.00

. do "C:\Users\istei\AppData\Local\Temp\STDcbc_000000.tmp"

. global balance2 satisfactionnotatall satisfactionnot satisfactionyes satisfactiontotally selectionnotfair selectionnotveryfair selectionfair selecti
> ontotallyfair amount_per_payment_ppp

. iebaltab $balance2 if pes_participation > 1, grpvar(pes_participation)  rowvarlabels save("$working_ANALYSIS/results/tables/TableS2_balancing_additi
> onal") ftest fmissok replace
    Balance table saved to: C:\Users\istei\Google Drive\Promotion\1_Projects\PES_Colombia\analysis/results/tables/TableS2_balancing_additional.xlsx

. 
end of do-file

. tab p_satisfaction

Satisfaction with |
   the programme. |      Freq.     Percent        Cum.
------------------+-----------------------------------
    Not satisfied |         15       12.20       12.20
                  |         24       19.51       31.71
                  |         34       27.64       59.35
totally satisfied |         48       39.02       98.37
       Don't know |          2        1.63      100.00
------------------+-----------------------------------
            Total |        123      100.00

. do "C:\Users\istei\AppData\Local\Temp\STDcbc_000000.tmp"

. ranksum p_satisfaction, by(pes_participation)

Two-sample Wilcoxon rank-sum (Mann-Whitney) test

pes_partic~n |      obs    rank sum    expected
-------------+---------------------------------
Phase 1 only |       56        4036        3472
 Phase 1 & 2 |       67        3590        4154
-------------+---------------------------------
    combined |      123        7626        7626

unadjusted variance    38770.67
adjustment for ties    -3479.21
                     ----------
adjusted variance      35291.45

Ho: p_sati~n(pes_pa~n==Phase 1 only) = p_sati~n(pes_pa~n==Phase 1 & 2)
             z =   3.002
    Prob > |z| =   0.0027
    Exact Prob =   0.0025

. 
end of do-file

. do "C:\Users\istei\AppData\Local\Temp\STDcbc_000000.tmp"

. ttest p_satisfaction, by(pes_participation)

Two-sample t test with equal variances
------------------------------------------------------------------------------
   Group |     Obs        Mean    Std. Err.   Std. Dev.   [95% Conf. Interval]
---------+--------------------------------------------------------------------
 Phase 1 |      56    3.267857    .1407103     1.05298    2.985867    3.549847
 Phase 1 |      67    2.746269    .1264326    1.034895    2.493838    2.998699
---------+--------------------------------------------------------------------
combined |     123     2.98374    .0965786    1.071109    2.792553    3.174927
---------+--------------------------------------------------------------------
    diff |            .5215885    .1888729                .1476647    .8955123
------------------------------------------------------------------------------
    diff = mean(Phase 1) - mean(Phase 1)                          t =   2.7616
Ho: diff = 0                                     degrees of freedom =      121

    Ha: diff < 0                 Ha: diff != 0                 Ha: diff > 0
 Pr(T < t) = 0.9967         Pr(|T| > |t|) = 0.0066          Pr(T > t) = 0.0033

. 
end of do-file

. tab selection_f

   Perceived |
 fairness of |
 participant |
   selection |
    process. |      Freq.     Percent        Cum.
-------------+-----------------------------------
    Not fair |         19       15.45       15.45
             |         19       15.45       30.89
             |         24       19.51       50.41
totally fair |         41       33.33       83.74
  Don't know |         20       16.26      100.00
-------------+-----------------------------------
       Total |        123      100.00

. tab p_satisfaction

Satisfaction with |
   the programme. |      Freq.     Percent        Cum.
------------------+-----------------------------------
    Not satisfied |         15       12.20       12.20
                  |         24       19.51       31.71
                  |         34       27.64       59.35
totally satisfied |         48       39.02       98.37
       Don't know |          2        1.63      100.00
------------------+-----------------------------------
            Total |        123      100.00

. do "C:\Users\istei\AppData\Local\Temp\STDcbc_000000.tmp"

. ranksum p_satisfaction if p_satisfaction != 5, by(pes_participation)

Two-sample Wilcoxon rank-sum (Mann-Whitney) test

pes_partic~n |      obs    rank sum    expected
-------------+---------------------------------
Phase 1 only |       55      3913.5        3355
 Phase 1 & 2 |       66      3467.5        4026
-------------+---------------------------------
    combined |      121        7381        7381

unadjusted variance    36905.00
adjustment for ties    -3478.62
                     ----------
adjusted variance      33426.38

Ho: p_sati~n(pes_pa~n==Phase 1 only) = p_sati~n(pes_pa~n==Phase 1 & 2)
             z =   3.055
    Prob > |z| =   0.0023
    Exact Prob =   0.0021

. ttest p_satisfaction if p_satisfaction != 5, by(pes_participation)

Two-sample t test with equal variances
------------------------------------------------------------------------------
   Group |     Obs        Mean    Std. Err.   Std. Dev.   [95% Conf. Interval]
---------+--------------------------------------------------------------------
 Phase 1 |      55    3.236364    .1396572    1.035725    2.956368    3.516359
 Phase 1 |      66    2.712121    .1235926    1.004071     2.46529    2.958953
---------+--------------------------------------------------------------------
combined |     121    2.950413    .0952387    1.047626    2.761847    3.138979
---------+--------------------------------------------------------------------
    diff |            .5242424    .1859622                .1560186    .8924662
------------------------------------------------------------------------------
    diff = mean(Phase 1) - mean(Phase 1)                          t =   2.8191
Ho: diff = 0                                     degrees of freedom =      119

    Ha: diff < 0                 Ha: diff != 0                 Ha: diff > 0
 Pr(T < t) = 0.9972         Pr(|T| > |t|) = 0.0056          Pr(T > t) = 0.0028

. 
end of do-file

. do "C:\Users\istei\AppData\Local\Temp\STDcbc_000000.tmp"

. ranksum selection_f if selection_f != 5, by(pes_participation)

Two-sample Wilcoxon rank-sum (Mann-Whitney) test

pes_partic~n |      obs    rank sum    expected
-------------+---------------------------------
Phase 1 only |       48      2888.5        2496
 Phase 1 & 2 |       55      2467.5        2860
-------------+---------------------------------
    combined |      103        5356        5356

unadjusted variance    22880.00
adjustment for ties    -2017.82
                     ----------
adjusted variance      20862.18

Ho: select~f(pes_pa~n==Phase 1 only) = select~f(pes_pa~n==Phase 1 & 2)
             z =   2.717
    Prob > |z| =   0.0066
    Exact Prob =   0.0063

. ttest selection_f if selection_f != 5, by(pes_participation)

Two-sample t test with equal variances
------------------------------------------------------------------------------
   Group |     Obs        Mean    Std. Err.   Std. Dev.   [95% Conf. Interval]
---------+--------------------------------------------------------------------
 Phase 1 |      48    3.166667    .1556653    1.078481    2.853509    3.479825
 Phase 1 |      55    2.563636    .1530028    1.134699    2.256884    2.870389
---------+--------------------------------------------------------------------
combined |     103     2.84466    .1127316    1.144101    2.621058    3.068263
---------+--------------------------------------------------------------------
    diff |            .6030303    .2190313                .1685311    1.037529
------------------------------------------------------------------------------
    diff = mean(Phase 1) - mean(Phase 1)                          t =   2.7532
Ho: diff = 0                                     degrees of freedom =      101

    Ha: diff < 0                 Ha: diff != 0                 Ha: diff > 0
 Pr(T < t) = 0.9965         Pr(|T| > |t|) = 0.0070          Pr(T > t) = 0.0035

. 
end of do-file

. tab pes_participation

pes_participati |
             on |      Freq.     Percent        Cum.
----------------+-----------------------------------
Non-participant |         80       39.41       39.41
   Phase 1 only |         56       27.59       67.00
    Phase 1 & 2 |         67       33.00      100.00
----------------+-----------------------------------
          Total |        203      100.00

. do "C:\Users\istei\AppData\Local\Temp\STDcbc_000000.tmp"

. ranksum p_satisfaction if p_satisfaction != 5, by(pes_participation)

Two-sample Wilcoxon rank-sum (Mann-Whitney) test

pes_partic~n |      obs    rank sum    expected
-------------+---------------------------------
Phase 1 only |       55      3913.5        3355
 Phase 1 & 2 |       66      3467.5        4026
-------------+---------------------------------
    combined |      121        7381        7381

unadjusted variance    36905.00
adjustment for ties    -3478.62
                     ----------
adjusted variance      33426.38

Ho: p_sati~n(pes_pa~n==Phase 1 only) = p_sati~n(pes_pa~n==Phase 1 & 2)
             z =   3.055
    Prob > |z| =   0.0023
    Exact Prob =   0.0021

. 
end of do-file

. do "C:\Users\istei\AppData\Local\Temp\STDcbc_000000.tmp"

. ttest p_satisfaction if p_satisfaction != 5, by(pes_participation)

Two-sample t test with equal variances
------------------------------------------------------------------------------
   Group |     Obs        Mean    Std. Err.   Std. Dev.   [95% Conf. Interval]
---------+--------------------------------------------------------------------
 Phase 1 |      55    3.236364    .1396572    1.035725    2.956368    3.516359
 Phase 1 |      66    2.712121    .1235926    1.004071     2.46529    2.958953
---------+--------------------------------------------------------------------
combined |     121    2.950413    .0952387    1.047626    2.761847    3.138979
---------+--------------------------------------------------------------------
    diff |            .5242424    .1859622                .1560186    .8924662
------------------------------------------------------------------------------
    diff = mean(Phase 1) - mean(Phase 1)                          t =   2.8191
Ho: diff = 0                                     degrees of freedom =      119

    Ha: diff < 0                 Ha: diff != 0                 Ha: diff > 0
 Pr(T < t) = 0.9972         Pr(|T| > |t|) = 0.0056          Pr(T > t) = 0.0028

. 
end of do-file

. do "C:\Users\istei\AppData\Local\Temp\STDcbc_000000.tmp"

. ranksum selection_f if selection_f != 5, by(pes_participation)

Two-sample Wilcoxon rank-sum (Mann-Whitney) test

pes_partic~n |      obs    rank sum    expected
-------------+---------------------------------
Phase 1 only |       48      2888.5        2496
 Phase 1 & 2 |       55      2467.5        2860
-------------+---------------------------------
    combined |      103        5356        5356

unadjusted variance    22880.00
adjustment for ties    -2017.82
                     ----------
adjusted variance      20862.18

Ho: select~f(pes_pa~n==Phase 1 only) = select~f(pes_pa~n==Phase 1 & 2)
             z =   2.717
    Prob > |z| =   0.0066
    Exact Prob =   0.0063

. 
end of do-file

. tab residence

   Current Residence of |
        the participant |      Freq.     Percent        Cum.
------------------------+-----------------------------------
        Farm (payments) |         27       13.30       13.30
                   City |         35       17.24       30.54
                   Town |         46       22.66       53.20
Other farm(no payments) |         95       46.80      100.00
------------------------+-----------------------------------
                  Total |        203      100.00

. tab residence, gen(residence_)

   Current Residence of |
        the participant |      Freq.     Percent        Cum.
------------------------+-----------------------------------
        Farm (payments) |         27       13.30       13.30
                   City |         35       17.24       30.54
                   Town |         46       22.66       53.20
Other farm(no payments) |         95       46.80      100.00
------------------------+-----------------------------------
                  Total |        203      100.00

. mprobit residence i.pes_participation

Iteration 0:   log likelihood =  -225.8129  (not concave)
Iteration 1:   log likelihood = -225.68761  (not concave)
Iteration 2:   log likelihood = -225.64857  (not concave)
Iteration 3:   log likelihood = -225.62871  (not concave)
Iteration 4:   log likelihood = -225.62025  (not concave)
Iteration 5:   log likelihood = -225.61752  (not concave)
Iteration 6:   log likelihood = -225.61627  (not concave)
Iteration 7:   log likelihood = -225.61533  (not concave)
Iteration 8:   log likelihood = -225.61483  (not concave)
Iteration 9:   log likelihood = -225.61444  (not concave)
Iteration 10:  log likelihood = -225.61427  (not concave)
Iteration 11:  log likelihood = -225.61414  (not concave)
Iteration 12:  log likelihood = -225.61413  (not concave)
Iteration 13:  log likelihood = -225.61413  (not concave)
Iteration 14:  log likelihood = -225.61413  (not concave)
Iteration 15:  log likelihood = -225.61413  (not concave)
Iteration 16:  log likelihood = -225.61413  (not concave)
Iteration 17:  log likelihood = -225.61413  (not concave)
Iteration 18:  log likelihood = -225.61413  (not concave)
Iteration 19:  log likelihood = -225.61413  (not concave)
Iteration 20:  log likelihood = -225.61413  (not concave)
Iteration 21:  log likelihood = -225.61413  (not concave)
Iteration 22:  log likelihood = -225.61413  (not concave)
Iteration 23:  log likelihood = -225.61413  (not concave)
Iteration 24:  log likelihood = -225.61413  (not concave)
Iteration 25:  log likelihood = -225.61413  (not concave)
Iteration 26:  log likelihood = -225.61413  (not concave)
Iteration 27:  log likelihood = -225.61413  (not concave)
Iteration 28:  log likelihood = -225.61413  (not concave)
Iteration 29:  log likelihood = -225.61413  (not concave)
Iteration 30:  log likelihood = -225.61413  (not concave)
Iteration 31:  log likelihood = -225.61413  (not concave)
Iteration 32:  log likelihood = -225.61413  (not concave)
Iteration 33:  log likelihood = -225.61413  (not concave)
Iteration 34:  log likelihood = -225.61413  (not concave)
Iteration 35:  log likelihood = -225.61413  (not concave)
Iteration 36:  log likelihood = -225.61413  (not concave)
Iteration 37:  log likelihood = -225.61413  (not concave)
Iteration 38:  log likelihood = -225.61413  (not concave)
Iteration 39:  log likelihood = -225.61413  (not concave)
Iteration 40:  log likelihood = -225.61413  (not concave)
Iteration 41:  log likelihood = -225.61413  (not concave)
Iteration 42:  log likelihood = -225.61413  (not concave)
Iteration 43:  log likelihood = -225.61413  (not concave)
Iteration 44:  log likelihood = -225.61413  (not concave)
Iteration 45:  log likelihood = -225.61413  (not concave)
Iteration 46:  log likelihood = -225.61413  (not concave)
Iteration 47:  log likelihood = -225.61413  (not concave)
Iteration 48:  log likelihood = -225.61413  (not concave)
Iteration 49:  log likelihood = -225.61413  (not concave)
Iteration 50:  log likelihood = -225.61413  (not concave)
Iteration 51:  log likelihood = -225.61413  (not concave)
Iteration 52:  log likelihood = -225.61413  (not concave)
Iteration 53:  log likelihood = -225.61413  (not concave)
Iteration 54:  log likelihood = -225.61413  (not concave)
Iteration 55:  log likelihood = -225.61413  (not concave)
Iteration 56:  log likelihood = -225.61413  (not concave)
Iteration 57:  log likelihood = -225.61413  (not concave)
Iteration 58:  log likelihood = -225.61413  (not concave)
--Break--
r(1);

. gen residence_farm = 0

. replace residence_farm = 1 if residence == 1 | residence == 4
(122 real changes made)

. tab residence_farm residence

residence_ |    Current Residence of the participant
      farm | Farm (pay       City       Town  Other far |     Total
-----------+--------------------------------------------+----------
         0 |         0         35         46          0 |        81 
         1 |        27          0          0         95 |       122 
-----------+--------------------------------------------+----------
     Total |        27         35         46         95 |       203 

. do "C:\Users\istei\AppData\Local\Temp\STDcbc_000000.tmp"

. ranksum residence_farm, by(pes_participation)
more than 2 groups found, only 2 allowed
r(499);

end of do-file

r(499);

. do "C:\Users\istei\AppData\Local\Temp\STDcbc_000000.tmp"

. ranksum residence_farm if pes_participation > 1, by(pes_participation)

Two-sample Wilcoxon rank-sum (Mann-Whitney) test

pes_partic~n |      obs    rank sum    expected
-------------+---------------------------------
Phase 1 only |       56        3402        3472
 Phase 1 & 2 |       67        4224        4154
-------------+---------------------------------
    combined |      123        7626        7626

unadjusted variance    38770.67
adjustment for ties    -9738.80
                     ----------
adjusted variance      29031.87

Ho: reside~m(pes_pa~n==Phase 1 only) = reside~m(pes_pa~n==Phase 1 & 2)
             z =  -0.411
    Prob > |z| =   0.6812
    Exact Prob =   0.8170

. 
end of do-file

. do "C:\Users\istei\AppData\Local\Temp\STDcbc_000000.tmp"

. ttest residence_farm if pes_participation > 1, by(pes_participation)

Two-sample t test with equal variances
------------------------------------------------------------------------------
   Group |     Obs        Mean    Std. Err.   Std. Dev.   [95% Conf. Interval]
---------+--------------------------------------------------------------------
 Phase 1 |      56          .5      .06742     .504525    .3648873    .6351127
 Phase 1 |      67    .5373134    .0613741    .5023689     .414776    .6598508
---------+--------------------------------------------------------------------
combined |     123    .5203252    .0452305      .50163     .430787    .6098634
---------+--------------------------------------------------------------------
    diff |           -.0373134    .0911363               -.2177417    .1431149
------------------------------------------------------------------------------
    diff = mean(Phase 1) - mean(Phase 1)                          t =  -0.4094
Ho: diff = 0                                     degrees of freedom =      121

    Ha: diff < 0                 Ha: diff != 0                 Ha: diff > 0
 Pr(T < t) = 0.3415         Pr(|T| > |t|) = 0.6830          Pr(T > t) = 0.6585

. 
end of do-file

. do "C:\Users\istei\AppData\Local\Temp\STDcbc_000000.tmp"

. iebaltab $balance , grpvar(primed)  rowvarlabels save("$working_ANALYSIS/results/tables/TableS1_balancing") ftest fmissok replace
file C:\Users\istei\Google Drive\Promotion\1_Projects\PES_Colombia\analysis/results/tables/TableS1_balancing.xlsx could not be saved
r(603);

end of do-file

r(603);

. do "C:\Users\istei\AppData\Local\Temp\STDcbc_000000.tmp"

. iebaltab $balance , grpvar(primed)  rowvarlabels save("$working_ANALYSIS/results/tables/TableS3_balancing_priming") ftest fmissok replace
    Balance table saved to: C:\Users\istei\Google Drive\Promotion\1_Projects\PES_Colombia\analysis/results/tables/TableS3_balancing_priming.xlsx

. 
end of do-file

. do "C:\Users\istei\AppData\Local\Temp\STDcbc_000000.tmp"

. iebaltab $balance , grpvar(primed)  rowvarlabels save("$working_ANALYSIS/results/tables/TableS2_balancing_priming") ftest fmissok replace
    Balance table saved to: C:\Users\istei\Google Drive\Promotion\1_Projects\PES_Colombia\analysis/results/tables/TableS2_balancing_priming.xlsx

. 
. 
end of do-file

. do "C:\Users\istei\AppData\Local\Temp\STDcbc_000000.tmp"

. iebaltab pes_participation $balance , grpvar(primed)  rowvarlabels save("$working_ANALYSIS/results/tables/TableS2_balancing_priming") ftest fmissok 
> replace
file C:\Users\istei\Google Drive\Promotion\1_Projects\PES_Colombia\analysis/results/tables/TableS2_balancing_priming.xlsx could not be saved
r(603);

end of do-file

r(603);

. do "C:\Users\istei\AppData\Local\Temp\STDcbc_000000.tmp"

. iebaltab pes_participation $balance , grpvar(primed)  rowvarlabels save("$working_ANALYSIS/results/tables/TableS2_balancing_priming") ftest fmissok 
> replace
    Balance table saved to: C:\Users\istei\Google Drive\Promotion\1_Projects\PES_Colombia\analysis/results/tables/TableS2_balancing_priming.xlsx

. 
end of do-file

. do "C:\Users\istei\AppData\Local\Temp\STDcbc_000000.tmp"

. tab primed pes_participation

           |   pes_participation
    primed | Phase 1 o  Phase 1 & |     Total
-----------+----------------------+----------
         0 |        30         33 |        63 
         1 |        26         34 |        60 
-----------+----------------------+----------
     Total |        56         67 |       123 

. 
end of do-file

. do "C:\Users\istei\AppData\Local\Temp\STDcbc_000000.tmp"

. iebaltab  $balance , grpvar(primed)  rowvarlabels save("$working_ANALYSIS/results/tables/TableS2_balancing_priming") ftest fmissok replace
    Balance table saved to: C:\Users\istei\Google Drive\Promotion\1_Projects\PES_Colombia\analysis/results/tables/TableS2_balancing_priming.xlsx

. 
end of do-file

. do "C:\Users\istei\AppData\Local\Temp\STDcbc_000000.tmp"

. global balance female id_age max_primary income_hh_ppp farms_n land_size econ_depend agricultor cattlemen merchant employee  othereconactivity  /// 
> socio-economics
> civicorg_d pruductiveorg_d polspace collective_action never_collective  /// community involvement
> trust_people trust_townpeople trust_familiy responsibility_gov 

. 
end of do-file

. do "C:\Users\istei\AppData\Local\Temp\STDcbc_000000.tmp"

. iebaltab  $balance , grpvar(primed)  rowvarlabels save("$working_ANALYSIS/results/tables/TableS2_balancing_priming") ftest fmissok replace
    Balance table saved to: C:\Users\istei\Google Drive\Promotion\1_Projects\PES_Colombia\analysis/results/tables/TableS2_balancing_priming.xlsx

. 
end of do-file

. do "C:\Users\istei\AppData\Local\Temp\STDcbc_000000.tmp"

. reg primed $balance

      Source |       SS           df       MS      Number of obs   =       118
-------------+----------------------------------   F(21, 96)       =      1.28
       Model |    6.436962        21     .306522   Prob > F        =    0.2098
    Residual |  23.0291397        96  .239886872   R-squared       =    0.2185
-------------+----------------------------------   Adj R-squared   =    0.0475
       Total |  29.4661017       117  .251847023   Root MSE        =    .48978

------------------------------------------------------------------------------------
            primed |      Coef.   Std. Err.      t    P>|t|     [95% Conf. Interval]
-------------------+----------------------------------------------------------------
            female |   .1231591   .1337449     0.92   0.359    -.1423223    .3886406
            id_age |  -.0094084    .004566    -2.06   0.042    -.0184719    -.000345
       max_primary |  -.0015859   .1326871    -0.01   0.990    -.2649677    .2617958
     income_hh_ppp |  -.0000107   .0000321    -0.33   0.739    -.0000745     .000053
           farms_n |    .017629   .0439955     0.40   0.690    -.0697014    .1049594
         land_size |  -.0008839   .0004751    -1.86   0.066     -.001827    .0000592
       econ_depend |   .0184765   .0302005     0.61   0.542     -.041471     .078424
        agricultor |   .3281319   .3829341     0.86   0.394    -.4319863     1.08825
         cattlemen |   .3827638   .3977772     0.96   0.338    -.4068177    1.172345
          merchant |  -.1721139   .4406151    -0.39   0.697    -1.046728    .7025002
          employee |   .1804979   .3849728     0.47   0.640     -.583667    .9446629
 othereconactivity |   .5015872   .3843193     1.31   0.195    -.2612805    1.264455
        civicorg_d |   .1787722   .1316323     1.36   0.178    -.0825158    .4400603
   pruductiveorg_d |  -.0781115   .1281567    -0.61   0.544    -.3325005    .1762774
          polspace |   .0692858   .0550392     1.26   0.211    -.0399661    .1785377
 collective_action |   .0479257   .0887395     0.54   0.590    -.1282208    .2240722
  never_collective |   .0100248   .1750754     0.06   0.954    -.3374972    .3575469
      trust_people |  -.0103986   .0521959    -0.20   0.843    -.1140068    .0932095
  trust_townpeople |   .0064316   .0546759     0.12   0.907    -.1020992    .1149624
     trust_familiy |  -.0129587   .0431563    -0.30   0.765    -.0986233     .072706
responsibility_gov |  -.0270902   .0568339    -0.48   0.635    -.1399046    .0857242
             _cons |   .4709077   .5531334     0.85   0.397    -.6270535    1.568869
------------------------------------------------------------------------------------

. 
. 
. 
end of do-file

. tab income_n

  Amount of |
  money the |
     person |
keeps after |
  donation. |      Freq.     Percent        Cum.
------------+-----------------------------------
          0 |         50       26.46       26.46
       1500 |          1        0.53       26.98
       5000 |          2        1.06       28.04
      10000 |         39       20.63       48.68
      13000 |          1        0.53       49.21
      14000 |          1        0.53       49.74
      15000 |         50       26.46       76.19
      16000 |          1        0.53       76.72
      17000 |          5        2.65       79.37
      18000 |         27       14.29       93.65
      19000 |         11        5.82       99.47
      19500 |          1        0.53      100.00
------------+-----------------------------------
      Total |        189      100.00

. tab all
variable all not found
r(111);

. tab donation_all

donation_al |
 l=1 if the |
     person |
donated all |
   th money |
   given to |
    him/her |      Freq.     Percent        Cum.
------------+-----------------------------------
          0 |         36       41.86       41.86
          1 |         50       58.14      100.00
------------+-----------------------------------
      Total |         86      100.00

. do "C:\Users\istei\AppData\Local\Temp\STDcbc_000000.tmp"

. tab participant donation_all

           | donation_all=1 if the
           | person donated all th
           |    money given to
participan |        him/her
         t |         0          1 |     Total
-----------+----------------------+----------
         0 |         0         10 |        10 
         1 |        36         40 |        76 
-----------+----------------------+----------
     Total |        36         50 |        86 

. 
end of do-file

. do "C:\Users\istei\AppData\Local\Temp\STDcbc_000000.tmp"

. tab participant donation_n

participan |                                Amount donated by the person to the selected organisation
         t |         0        500       1000       2000       3000       4000       5000       6000       7000      10000      15000 |     Total
-----------+-------------------------------------------------------------------------------------------------------------------------+----------
         0 |         7          0          6         10          2          1         25          1          1         17          0 |        80 
         1 |         7          1          5         17          3          0         27          0          0         22          1 |       123 
-----------+-------------------------------------------------------------------------------------------------------------------------+----------
     Total |        14          1         11         27          5          1         52          1          1         39          1 |       203 


           |   Amount
           | donated by
           | the person
           |   to the
           |  selected
           | organisati
participan |     on
         t |     20000 |     Total
-----------+-----------+----------
         0 |        10 |        80 
         1 |        40 |       123 
-----------+-----------+----------
     Total |        50 |       203 

. 
end of do-file

. tab tropenbos_d

tropenbos_d |
  =1 if the |
     person |
knows about |
  TropenBos |      Freq.     Percent        Cum.
------------+-----------------------------------
          0 |        194       95.57       95.57
          1 |          9        4.43      100.00
------------+-----------------------------------
      Total |        203      100.00

. tab gaia_d

gaia_d=1 if |
 the person |
knows about |
       Gaia |      Freq.     Percent        Cum.
------------+-----------------------------------
          0 |        181       89.16       89.16
          1 |         22       10.84      100.00
------------+-----------------------------------
      Total |        203      100.00

. tab omacha_d

 omacha_d=1 |
     if the |
     person |
knows about |
     Omacha |      Freq.     Percent        Cum.
------------+-----------------------------------
          0 |        196       96.55       96.55
          1 |          7        3.45      100.00
------------+-----------------------------------
      Total |        203      100.00

. tab dononce

    dononce |      Freq.     Percent        Cum.
------------+-----------------------------------
          0 |        184       90.64       90.64
          1 |         19        9.36      100.00
------------+-----------------------------------
      Total |        203      100.00

. tab donmany

    donmany |      Freq.     Percent        Cum.
------------+-----------------------------------
          0 |        174       85.71       85.71
          1 |         29       14.29      100.00
------------+-----------------------------------
      Total |        203      100.00

. tab donmany dononce

           |        dononce
   donmany |         0          1 |     Total
-----------+----------------------+----------
         0 |       155         19 |       174 
         1 |        29          0 |        29 
-----------+----------------------+----------
     Total |       184         19 |       203 

. tab civicorg_d

      Civic |
Organisatio |
          n |
Participati |
 on (Dummy) |      Freq.     Percent        Cum.
------------+-----------------------------------
          0 |        155       76.35       76.35
          1 |         48       23.65      100.00
------------+-----------------------------------
      Total |        203      100.00

. tab polspace

   Political and |
       community |
   participation |      Freq.     Percent        Cum.
-----------------+-----------------------------------
Totally disagree |         20        9.85        9.85
        Disagree |         32       15.76       25.62
           Agree |         58       28.57       54.19
   Totally agree |         93       45.81      100.00
-----------------+-----------------------------------
           Total |        203      100.00

. pwcorr trust_people trust_townpeople trust_familiy responsibility_gov

             | trust_p~ t~town~e trust_~y respon~v
-------------+------------------------------------
trust_people |   1.0000 
trust_town~e |   0.6549   1.0000 
trust_fami~y |  -0.1357  -0.0690   1.0000 
responsibi~v |   0.0753   0.0006  -0.0810   1.0000 

. tab donation_n

     Amount |
 donated by |
 the person |
     to the |
   selected |
organisatio |
          n |      Freq.     Percent        Cum.
------------+-----------------------------------
          0 |         14        6.90        6.90
        500 |          1        0.49        7.39
       1000 |         11        5.42       12.81
       2000 |         27       13.30       26.11
       3000 |          5        2.46       28.57
       4000 |          1        0.49       29.06
       5000 |         52       25.62       54.68
       6000 |          1        0.49       55.17
       7000 |          1        0.49       55.67
      10000 |         39       19.21       74.88
      15000 |          1        0.49       75.37
      20000 |         50       24.63      100.00
------------+-----------------------------------
      Total |        203      100.00

. tab donation_all

donation_al |
 l=1 if the |
     person |
donated all |
   th money |
   given to |
    him/her |      Freq.     Percent        Cum.
------------+-----------------------------------
          0 |         36       41.86       41.86
          1 |         50       58.14      100.00
------------+-----------------------------------
      Total |         86      100.00

. tab donation_n

     Amount |
 donated by |
 the person |
     to the |
   selected |
organisatio |
          n |      Freq.     Percent        Cum.
------------+-----------------------------------
          0 |         14        6.90        6.90
        500 |          1        0.49        7.39
       1000 |         11        5.42       12.81
       2000 |         27       13.30       26.11
       3000 |          5        2.46       28.57
       4000 |          1        0.49       29.06
       5000 |         52       25.62       54.68
       6000 |          1        0.49       55.17
       7000 |          1        0.49       55.67
      10000 |         39       19.21       74.88
      15000 |          1        0.49       75.37
      20000 |         50       24.63      100.00
------------+-----------------------------------
      Total |        203      100.00

. do "C:\Users\istei\AppData\Local\Temp\STDcbc_000000.tmp"

. reg donation_n i.pes_participation, vce(hc3)

Linear regression                               Number of obs     =        203
                                                F(2, 200)         =       6.40
                                                Prob > F          =     0.0020
                                                R-squared         =     0.0627
                                                Root MSE          =     6977.4

-----------------------------------------------------------------------------------
                  |             Robust HC3
       donation_n |      Coef.   Std. Err.      t    P>|t|     [95% Conf. Interval]
------------------+----------------------------------------------------------------
pes_participation |
    Phase 1 only  |   1771.429   1164.546     1.52   0.130    -524.9361    4067.793
     Phase 1 & 2  |   4222.388   1187.641     3.56   0.000     1880.484    6564.292
                  |
            _cons |       6800   668.7092    10.17   0.000     5481.375    8118.625
-----------------------------------------------------------------------------------

. 
end of do-file

. do "C:\Users\istei\AppData\Local\Temp\STDcbc_000000.tmp"

. reg donation_n i.pes_participation, vce(hc3)

Linear regression                               Number of obs     =        203
                                                F(2, 200)         =       6.40
                                                Prob > F          =     0.0020
                                                R-squared         =     0.0627
                                                Root MSE          =     6977.4

-----------------------------------------------------------------------------------
                  |             Robust HC3
       donation_n |      Coef.   Std. Err.      t    P>|t|     [95% Conf. Interval]
------------------+----------------------------------------------------------------
pes_participation |
    Phase 1 only  |   1771.429   1164.546     1.52   0.130    -524.9361    4067.793
     Phase 1 & 2  |   4222.388   1187.641     3.56   0.000     1880.484    6564.292
                  |
            _cons |       6800   668.7092    10.17   0.000     5481.375    8118.625
-----------------------------------------------------------------------------------

. 
end of do-file

. do "C:\Users\istei\AppData\Local\Temp\STDcbc_000000.tmp"

. reg donation_n i.pes_participation $socio_economic, vce(hc3)

Linear regression                               Number of obs     =        203
                                                F(2, 200)         =       6.40
                                                Prob > F          =     0.0020
                                                R-squared         =     0.0627
                                                Root MSE          =     6977.4

-----------------------------------------------------------------------------------
                  |             Robust HC3
       donation_n |      Coef.   Std. Err.      t    P>|t|     [95% Conf. Interval]
------------------+----------------------------------------------------------------
pes_participation |
    Phase 1 only  |   1771.429   1164.546     1.52   0.130    -524.9361    4067.793
     Phase 1 & 2  |   4222.388   1187.641     3.56   0.000     1880.484    6564.292
                  |
            _cons |       6800   668.7092    10.17   0.000     5481.375    8118.625
-----------------------------------------------------------------------------------

. 
end of do-file

. do "C:\Users\istei\AppData\Local\Temp\STDcbc_000000.tmp"

. ** Donations analysis
. global socio_economic female id_age max_primary income_hh_ppp farms_n land_size

. global ngo_experience tropenbos_d gaia_d omacha_d dononce donmany

. global community_involvement civicorg_d pruductiveorg_d polspace never_collective

. global trust trust_people trust_townpeople trust_familiy

. 
end of do-file

. do "C:\Users\istei\AppData\Local\Temp\STDcbc_000000.tmp"

. reg donation_n i.pes_participation $socio_economic, vce(hc3)

Linear regression                               Number of obs     =        198
                                                F(8, 189)         =      11.17
                                                Prob > F          =     0.0000
                                                R-squared         =     0.3030
                                                Root MSE          =     6018.9

-----------------------------------------------------------------------------------
                  |             Robust HC3
       donation_n |      Coef.   Std. Err.      t    P>|t|     [95% Conf. Interval]
------------------+----------------------------------------------------------------
pes_participation |
    Phase 1 only  |   108.7962   1048.843     0.10   0.917    -1960.146    2177.739
     Phase 1 & 2  |   3335.542   1059.334     3.15   0.002     1245.905    5425.179
                  |
           female |   558.0498   1104.508     0.51   0.614    -1620.697    2736.797
           id_age |   -48.8717   31.02821    -1.58   0.117    -110.0778    12.33439
      max_primary |  -1364.459   1065.976    -1.28   0.202    -3467.198    738.2791
    income_hh_ppp |   1.191221    .220183     5.41   0.000      .756889    1.625553
          farms_n |  -72.57585   355.0149    -0.20   0.838    -772.8765    627.7248
        land_size |   10.73699   4.488477     2.39   0.018     1.883044    19.59094
            _cons |   8680.452   2114.928     4.10   0.000     4508.555    12852.35
-----------------------------------------------------------------------------------

. 
end of do-file

. sum $socio_economic

    Variable |        Obs        Mean    Std. Dev.       Min        Max
-------------+---------------------------------------------------------
      female |        203    .2807882    .4504952          0          1
      id_age |        203    58.24138     13.8584          0         88
 max_primary |        203    .4581281    .4994754          0          1
income_hh_~p |        199    1463.455    2279.999          0   15126.76
     farms_n |        202    1.772277    1.307317          1          9
-------------+---------------------------------------------------------
   land_size |        200    37.53223    91.82581        .12       1046

. do "C:\Users\istei\AppData\Local\Temp\STDcbc_000000.tmp"

. reg donation_n i.pes_participation $socio_economic $community_involvement, vce(hc3)

Linear regression                               Number of obs     =        198
                                                F(12, 185)        =       7.45
                                                Prob > F          =     0.0000
                                                R-squared         =     0.3277
                                                Root MSE          =       5975

-----------------------------------------------------------------------------------
                  |             Robust HC3
       donation_n |      Coef.   Std. Err.      t    P>|t|     [95% Conf. Interval]
------------------+----------------------------------------------------------------
pes_participation |
    Phase 1 only  |   303.9426   1047.694     0.29   0.772    -1763.021    2370.907
     Phase 1 & 2  |   3595.178   1069.909     3.36   0.001     1484.386     5705.97
                  |
           female |   772.4406   1177.428     0.66   0.513    -1550.472    3095.353
           id_age |  -52.60545   31.63411    -1.66   0.098    -115.0154    9.804537
      max_primary |  -992.6706   1102.519    -0.90   0.369    -3167.798    1182.457
    income_hh_ppp |   1.304022   .2742889     4.75   0.000     .7628859    1.845159
          farms_n |   -179.886   392.1549    -0.46   0.647    -953.5566    593.7845
        land_size |   10.74676   4.714446     2.28   0.024     1.445774    20.04775
       civicorg_d |  -1481.268   1130.112    -1.31   0.192    -3710.832     748.296
  pruductiveorg_d |   1269.013   1224.737     1.04   0.301    -1147.234    3685.261
         polspace |   939.8649   456.8489     2.06   0.041     38.56133    1841.168
 never_collective |   667.2349   1039.268     0.64   0.522    -1383.105    2717.575
            _cons |    5370.72   2440.303     2.20   0.029     556.3202    10185.12
-----------------------------------------------------------------------------------

. 
end of do-file

. do "C:\Users\istei\AppData\Local\Temp\STDcbc_000000.tmp"

. global community_involvement trust_people trust_townpeople trust_familiy civicorg_d pruductiveorg_d polspace never_collective

. 
end of do-file

. do "C:\Users\istei\AppData\Local\Temp\STDcbc_000000.tmp"

. global trust_involvement trust_people trust_townpeople trust_familiy civicorg_d pruductiveorg_d polspace never_collective

. 
end of do-file

. do "C:\Users\istei\AppData\Local\Temp\STDcbc_000000.tmp"

. reg donation_n i.pes_participation $socio_economic $trust_involvement, vce(hc3)

Linear regression                               Number of obs     =        198
                                                F(15, 182)        =       6.07
                                                Prob > F          =     0.0000
                                                R-squared         =     0.3334
                                                Root MSE          =     5998.4

-----------------------------------------------------------------------------------
                  |             Robust HC3
       donation_n |      Coef.   Std. Err.      t    P>|t|     [95% Conf. Interval]
------------------+----------------------------------------------------------------
pes_participation |
    Phase 1 only  |   340.1781   1050.582     0.32   0.746    -1732.709    2413.065
     Phase 1 & 2  |   3479.736   1094.153     3.18   0.002      1320.88    5638.591
                  |
           female |   747.4939   1246.435     0.60   0.549    -1711.827    3206.815
           id_age |  -59.67846   32.60675    -1.83   0.069    -124.0143    4.657397
      max_primary |  -754.4389   1146.051    -0.66   0.511    -3015.693    1506.815
    income_hh_ppp |   1.269645   .2767875     4.59   0.000     .7235202     1.81577
          farms_n |  -104.7255   400.2677    -0.26   0.794    -894.4873    685.0363
        land_size |   10.55503   4.753036     2.22   0.028     1.176891    19.93317
     trust_people |   329.3176   515.5149     0.64   0.524    -687.8366    1346.472
 trust_townpeople |  -2.428442   526.1949    -0.00   0.996    -1040.655    1035.798
    trust_familiy |  -239.1126   349.2512    -0.68   0.494    -928.2146    449.9894
       civicorg_d |  -1647.909   1128.401    -1.46   0.146    -3874.339      578.52
  pruductiveorg_d |   1263.371    1250.18     1.01   0.314    -1203.339    3730.082
         polspace |   892.7541   471.5827     1.89   0.060    -37.71815    1823.226
 never_collective |   802.7056   1046.416     0.77   0.444    -1261.961    2867.372
            _cons |   5782.615   2837.089     2.04   0.043      184.799    11380.43
-----------------------------------------------------------------------------------

. testparm $socio_economic

 ( 1)  female = 0
 ( 2)  id_age = 0
 ( 3)  max_primary = 0
 ( 4)  income_hh_ppp = 0
 ( 5)  farms_n = 0
 ( 6)  land_size = 0

       F(  6,   182) =    8.47
            Prob > F =    0.0000

. local F1 = r(p)

. testparm $trust_involvement

 ( 1)  trust_people = 0
 ( 2)  trust_townpeople = 0
 ( 3)  trust_familiy = 0
 ( 4)  civicorg_d = 0
 ( 5)  pruductiveorg_d = 0
 ( 6)  polspace = 0
 ( 7)  never_collective = 0

       F(  7,   182) =    1.23
            Prob > F =    0.2868

. local F2 = r(p)

. 
end of do-file

. do "C:\Users\istei\AppData\Local\Temp\STDcbc_000000.tmp"

. reg donation_n i.pes_participation, vce(hc3)

Linear regression                               Number of obs     =        203
                                                F(2, 200)         =       6.40
                                                Prob > F          =     0.0020
                                                R-squared         =     0.0627
                                                Root MSE          =     6977.4

-----------------------------------------------------------------------------------
                  |             Robust HC3
       donation_n |      Coef.   Std. Err.      t    P>|t|     [95% Conf. Interval]
------------------+----------------------------------------------------------------
pes_participation |
    Phase 1 only  |   1771.429   1164.546     1.52   0.130    -524.9361    4067.793
     Phase 1 & 2  |   4222.388   1187.641     3.56   0.000     1880.484    6564.292
                  |
            _cons |       6800   668.7092    10.17   0.000     5481.375    8118.625
-----------------------------------------------------------------------------------

. outreg2 using "$working_ANALYSIS/results/tables/Table3_donation_amount", addstat("Adjusted R-squared", e(r2_a)) adec(2) drop() word ctitle("Donation
>  Amount") dec(2) replace
C:\Users\istei\Google Drive\Promotion\1_Projects\PES_Colombia\analysis/results/tables/Table3_donation_amount.rtf
dir : seeout

. reg donation_n i.pes_participation $socio_economic, vce(hc3)

Linear regression                               Number of obs     =        198
                                                F(8, 189)         =      11.17
                                                Prob > F          =     0.0000
                                                R-squared         =     0.3030
                                                Root MSE          =     6018.9

-----------------------------------------------------------------------------------
                  |             Robust HC3
       donation_n |      Coef.   Std. Err.      t    P>|t|     [95% Conf. Interval]
------------------+----------------------------------------------------------------
pes_participation |
    Phase 1 only  |   108.7962   1048.843     0.10   0.917    -1960.146    2177.739
     Phase 1 & 2  |   3335.542   1059.334     3.15   0.002     1245.905    5425.179
                  |
           female |   558.0498   1104.508     0.51   0.614    -1620.697    2736.797
           id_age |   -48.8717   31.02821    -1.58   0.117    -110.0778    12.33439
      max_primary |  -1364.459   1065.976    -1.28   0.202    -3467.198    738.2791
    income_hh_ppp |   1.191221    .220183     5.41   0.000      .756889    1.625553
          farms_n |  -72.57585   355.0149    -0.20   0.838    -772.8765    627.7248
        land_size |   10.73699   4.488477     2.39   0.018     1.883044    19.59094
            _cons |   8680.452   2114.928     4.10   0.000     4508.555    12852.35
-----------------------------------------------------------------------------------

. testparm $socio_economic

 ( 1)  female = 0
 ( 2)  id_age = 0
 ( 3)  max_primary = 0
 ( 4)  income_hh_ppp = 0
 ( 5)  farms_n = 0
 ( 6)  land_size = 0

       F(  6,   189) =   11.84
            Prob > F =    0.0000

. local F1 = r(p)

. outreg2 using "$working_ANALYSIS/results/tables/Table3_donation_amount", addstat("Adjusted R-squared", e(r2_a), "Socio-economics", `F1') adec(3) wor
> d ctitle("Donation Amount") dec(2) append
C:\Users\istei\Google Drive\Promotion\1_Projects\PES_Colombia\analysis/results/tables/Table3_donation_amount.rtf
dir : seeout

. reg donation_n i.pes_participation $socio_economic $trust_involvement, vce(hc3)

Linear regression                               Number of obs     =        198
                                                F(15, 182)        =       6.07
                                                Prob > F          =     0.0000
                                                R-squared         =     0.3334
                                                Root MSE          =     5998.4

-----------------------------------------------------------------------------------
                  |             Robust HC3
       donation_n |      Coef.   Std. Err.      t    P>|t|     [95% Conf. Interval]
------------------+----------------------------------------------------------------
pes_participation |
    Phase 1 only  |   340.1781   1050.582     0.32   0.746    -1732.709    2413.065
     Phase 1 & 2  |   3479.736   1094.153     3.18   0.002      1320.88    5638.591
                  |
           female |   747.4939   1246.435     0.60   0.549    -1711.827    3206.815
           id_age |  -59.67846   32.60675    -1.83   0.069    -124.0143    4.657397
      max_primary |  -754.4389   1146.051    -0.66   0.511    -3015.693    1506.815
    income_hh_ppp |   1.269645   .2767875     4.59   0.000     .7235202     1.81577
          farms_n |  -104.7255   400.2677    -0.26   0.794    -894.4873    685.0363
        land_size |   10.55503   4.753036     2.22   0.028     1.176891    19.93317
     trust_people |   329.3176   515.5149     0.64   0.524    -687.8366    1346.472
 trust_townpeople |  -2.428442   526.1949    -0.00   0.996    -1040.655    1035.798
    trust_familiy |  -239.1126   349.2512    -0.68   0.494    -928.2146    449.9894
       civicorg_d |  -1647.909   1128.401    -1.46   0.146    -3874.339      578.52
  pruductiveorg_d |   1263.371    1250.18     1.01   0.314    -1203.339    3730.082
         polspace |   892.7541   471.5827     1.89   0.060    -37.71815    1823.226
 never_collective |   802.7056   1046.416     0.77   0.444    -1261.961    2867.372
            _cons |   5782.615   2837.089     2.04   0.043      184.799    11380.43
-----------------------------------------------------------------------------------

. testparm $socio_economic

 ( 1)  female = 0
 ( 2)  id_age = 0
 ( 3)  max_primary = 0
 ( 4)  income_hh_ppp = 0
 ( 5)  farms_n = 0
 ( 6)  land_size = 0

       F(  6,   182) =    8.47
            Prob > F =    0.0000

. local F1 = r(p)

. testparm $trust_involvement

 ( 1)  trust_people = 0
 ( 2)  trust_townpeople = 0
 ( 3)  trust_familiy = 0
 ( 4)  civicorg_d = 0
 ( 5)  pruductiveorg_d = 0
 ( 6)  polspace = 0
 ( 7)  never_collective = 0

       F(  7,   182) =    1.23
            Prob > F =    0.2868

. local F2 = r(p)

. outreg2 using "$working_ANALYSIS/results/tables/Table3_donation_amount", addstat("Adjusted R-squared", e(r2_a), "Socio-economic", `F1', "Trust & Com
> munity involvement", `F2') adec(2) word ctitle("Donation Amount") dec(2) append
C:\Users\istei\Google Drive\Promotion\1_Projects\PES_Colombia\analysis/results/tables/Table3_donation_amount.rtf
dir : seeout

. reg donation_n i.pes_participation $socio_economic $trust_involvement $ngo_experience, vce(hc3)

Linear regression                               Number of obs     =        198
                                                F(20, 177)        =       6.10
                                                Prob > F          =     0.0000
                                                R-squared         =     0.3525
                                                Root MSE          =     5994.4

-----------------------------------------------------------------------------------
                  |             Robust HC3
       donation_n |      Coef.   Std. Err.      t    P>|t|     [95% Conf. Interval]
------------------+----------------------------------------------------------------
pes_participation |
    Phase 1 only  |   230.8384   1109.974     0.21   0.835    -1959.648    2421.325
     Phase 1 & 2  |    3364.03   1122.049     3.00   0.003     1149.714    5578.346
                  |
           female |   551.2648   1259.344     0.44   0.662    -1933.997    3036.526
           id_age |   -63.3135   35.18227    -1.80   0.074    -132.7442    6.117205
      max_primary |  -604.7473   1184.893    -0.51   0.610    -2943.082    1733.588
    income_hh_ppp |   1.209866   .2699904     4.48   0.000     .6770514     1.74268
          farms_n |  -36.81365   422.8604    -0.09   0.931    -871.3106    797.6833
        land_size |   10.39533   4.730316     2.20   0.029     1.060255    19.73041
     trust_people |   278.3054   531.6895     0.52   0.601    -770.9611    1327.572
 trust_townpeople |  -43.96001   534.0027    -0.08   0.934    -1097.791    1009.871
    trust_familiy |  -205.0619   346.9777    -0.59   0.555    -889.8075    479.6838
       civicorg_d |  -2094.605    1154.95    -1.81   0.071    -4373.849    184.6384
  pruductiveorg_d |   1232.969   1275.104     0.97   0.335    -1283.395    3749.332
         polspace |   868.7501   474.3524     1.83   0.069    -67.36407    1804.864
 never_collective |   829.4278   1088.462     0.76   0.447    -1318.605    2977.461
      tropenbos_d |   2532.497   1959.863     1.29   0.198    -1335.208    6400.203
           gaia_d |   1589.654   1602.506     0.99   0.323    -1572.824    4752.131
         omacha_d |   2562.778   2722.406     0.94   0.348    -2809.775    7935.331
          dononce |  -166.2777   1638.624    -0.10   0.919    -3400.033    3067.478
          donmany |   637.7344   1575.673     0.40   0.686    -2471.788    3747.257
            _cons |   5885.235   2887.467     2.04   0.043     186.9427    11583.53
-----------------------------------------------------------------------------------

. testparm $socio_economic

 ( 1)  female = 0
 ( 2)  id_age = 0
 ( 3)  max_primary = 0
 ( 4)  income_hh_ppp = 0
 ( 5)  farms_n = 0
 ( 6)  land_size = 0

       F(  6,   177) =    6.93
            Prob > F =    0.0000

. local F1 = r(p)

. testparm $trust_involvement

 ( 1)  trust_people = 0
 ( 2)  trust_townpeople = 0
 ( 3)  trust_familiy = 0
 ( 4)  civicorg_d = 0
 ( 5)  pruductiveorg_d = 0
 ( 6)  polspace = 0
 ( 7)  never_collective = 0

       F(  7,   177) =    1.30
            Prob > F =    0.2536

. local F2 = r(p)

. testparm $ngo_experience

 ( 1)  tropenbos_d = 0
 ( 2)  gaia_d = 0
 ( 3)  omacha_d = 0
 ( 4)  dononce = 0
 ( 5)  donmany = 0

       F(  5,   177) =    1.49
            Prob > F =    0.1960

. local F3 = r(p)

. outreg2 using "$working_ANALYSIS/results/tables/Table3_donation_amount", addstat("Adjusted R-squared", e(r2_a), "Socio-economic", `F1', "Trust & Com
> munity involvement", `F2', "Experience with NGOs", `F3') adec(2) word ctitle("Donation Amount") dec(2) append
C:\Users\istei\Google Drive\Promotion\1_Projects\PES_Colombia\analysis/results/tables/Table3_donation_amount.rtf
dir : seeout

. 
end of do-file

. shellout using `"C:\Users\istei\Google Drive\Promotion\1_Projects\PES_Colombia\analysis/results/tables/Table3_donation_amount.rtf"'

. do "C:\Users\istei\AppData\Local\Temp\STDcbc_000000.tmp"

. reg donation_n i.pes_participation, vce(hc3)

Linear regression                               Number of obs     =        203
                                                F(2, 200)         =       6.40
                                                Prob > F          =     0.0020
                                                R-squared         =     0.0627
                                                Root MSE          =     6977.4

-----------------------------------------------------------------------------------
                  |             Robust HC3
       donation_n |      Coef.   Std. Err.      t    P>|t|     [95% Conf. Interval]
------------------+----------------------------------------------------------------
pes_participation |
    Phase 1 only  |   1771.429   1164.546     1.52   0.130    -524.9361    4067.793
     Phase 1 & 2  |   4222.388   1187.641     3.56   0.000     1880.484    6564.292
                  |
            _cons |       6800   668.7092    10.17   0.000     5481.375    8118.625
-----------------------------------------------------------------------------------

. outreg2 using "$working_ANALYSIS/results/tables/Table3_donation_amount", addstat("Adjusted R-squared", e(r2_a)) adec(2) drop() word ctitle("Donation
>  Amount") dec(2) replace
C:\Users\istei\Google Drive\Promotion\1_Projects\PES_Colombia\analysis/results/tables/Table3_donation_amount.rtf
dir : seeout

. reg donation_n i.pes_participation $socio_economic, vce(hc3)

Linear regression                               Number of obs     =        198
                                                F(8, 189)         =      11.17
                                                Prob > F          =     0.0000
                                                R-squared         =     0.3030
                                                Root MSE          =     6018.9

-----------------------------------------------------------------------------------
                  |             Robust HC3
       donation_n |      Coef.   Std. Err.      t    P>|t|     [95% Conf. Interval]
------------------+----------------------------------------------------------------
pes_participation |
    Phase 1 only  |   108.7962   1048.843     0.10   0.917    -1960.146    2177.739
     Phase 1 & 2  |   3335.542   1059.334     3.15   0.002     1245.905    5425.179
                  |
           female |   558.0498   1104.508     0.51   0.614    -1620.697    2736.797
           id_age |   -48.8717   31.02821    -1.58   0.117    -110.0778    12.33439
      max_primary |  -1364.459   1065.976    -1.28   0.202    -3467.198    738.2791
    income_hh_ppp |   1.191221    .220183     5.41   0.000      .756889    1.625553
          farms_n |  -72.57585   355.0149    -0.20   0.838    -772.8765    627.7248
        land_size |   10.73699   4.488477     2.39   0.018     1.883044    19.59094
            _cons |   8680.452   2114.928     4.10   0.000     4508.555    12852.35
-----------------------------------------------------------------------------------

. testparm $socio_economic

 ( 1)  female = 0
 ( 2)  id_age = 0
 ( 3)  max_primary = 0
 ( 4)  income_hh_ppp = 0
 ( 5)  farms_n = 0
 ( 6)  land_size = 0

       F(  6,   189) =   11.84
            Prob > F =    0.0000

. local F1 = r(p)

. outreg2 using "$working_ANALYSIS/results/tables/Table3_donation_amount", addstat("Adjusted R-squared", e(r2_a), "Socio-economics", `F1') adec(3) wor
> d ctitle("Donation Amount") dec(2) append
C:\Users\istei\Google Drive\Promotion\1_Projects\PES_Colombia\analysis/results/tables/Table3_donation_amount.rtf
dir : seeout

. reg donation_n i.pes_participation $socio_economic $trust_involvement, vce(hc3)

Linear regression                               Number of obs     =        198
                                                F(15, 182)        =       6.07
                                                Prob > F          =     0.0000
                                                R-squared         =     0.3334
                                                Root MSE          =     5998.4

-----------------------------------------------------------------------------------
                  |             Robust HC3
       donation_n |      Coef.   Std. Err.      t    P>|t|     [95% Conf. Interval]
------------------+----------------------------------------------------------------
pes_participation |
    Phase 1 only  |   340.1781   1050.582     0.32   0.746    -1732.709    2413.065
     Phase 1 & 2  |   3479.736   1094.153     3.18   0.002      1320.88    5638.591
                  |
           female |   747.4939   1246.435     0.60   0.549    -1711.827    3206.815
           id_age |  -59.67846   32.60675    -1.83   0.069    -124.0143    4.657397
      max_primary |  -754.4389   1146.051    -0.66   0.511    -3015.693    1506.815
    income_hh_ppp |   1.269645   .2767875     4.59   0.000     .7235202     1.81577
          farms_n |  -104.7255   400.2677    -0.26   0.794    -894.4873    685.0363
        land_size |   10.55503   4.753036     2.22   0.028     1.176891    19.93317
     trust_people |   329.3176   515.5149     0.64   0.524    -687.8366    1346.472
 trust_townpeople |  -2.428442   526.1949    -0.00   0.996    -1040.655    1035.798
    trust_familiy |  -239.1126   349.2512    -0.68   0.494    -928.2146    449.9894
       civicorg_d |  -1647.909   1128.401    -1.46   0.146    -3874.339      578.52
  pruductiveorg_d |   1263.371    1250.18     1.01   0.314    -1203.339    3730.082
         polspace |   892.7541   471.5827     1.89   0.060    -37.71815    1823.226
 never_collective |   802.7056   1046.416     0.77   0.444    -1261.961    2867.372
            _cons |   5782.615   2837.089     2.04   0.043      184.799    11380.43
-----------------------------------------------------------------------------------

. testparm $socio_economic

 ( 1)  female = 0
 ( 2)  id_age = 0
 ( 3)  max_primary = 0
 ( 4)  income_hh_ppp = 0
 ( 5)  farms_n = 0
 ( 6)  land_size = 0

       F(  6,   182) =    8.47
            Prob > F =    0.0000

. local F1 = r(p)

. testparm $trust_involvement

 ( 1)  trust_people = 0
 ( 2)  trust_townpeople = 0
 ( 3)  trust_familiy = 0
 ( 4)  civicorg_d = 0
 ( 5)  pruductiveorg_d = 0
 ( 6)  polspace = 0
 ( 7)  never_collective = 0

       F(  7,   182) =    1.23
            Prob > F =    0.2868

. local F2 = r(p)

. outreg2 using "$working_ANALYSIS/results/tables/Table3_donation_amount", addstat("Adjusted R-squared", e(r2_a), "Socio-economics", `F1', "Trust & Co
> mmunity involvement", `F2') adec(2) word ctitle("Donation Amount") dec(2) append
C:\Users\istei\Google Drive\Promotion\1_Projects\PES_Colombia\analysis/results/tables/Table3_donation_amount.rtf
dir : seeout

. reg donation_n i.pes_participation $socio_economic $trust_involvement $ngo_experience, vce(hc3)

Linear regression                               Number of obs     =        198
                                                F(20, 177)        =       6.10
                                                Prob > F          =     0.0000
                                                R-squared         =     0.3525
                                                Root MSE          =     5994.4

-----------------------------------------------------------------------------------
                  |             Robust HC3
       donation_n |      Coef.   Std. Err.      t    P>|t|     [95% Conf. Interval]
------------------+----------------------------------------------------------------
pes_participation |
    Phase 1 only  |   230.8384   1109.974     0.21   0.835    -1959.648    2421.325
     Phase 1 & 2  |    3364.03   1122.049     3.00   0.003     1149.714    5578.346
                  |
           female |   551.2648   1259.344     0.44   0.662    -1933.997    3036.526
           id_age |   -63.3135   35.18227    -1.80   0.074    -132.7442    6.117205
      max_primary |  -604.7473   1184.893    -0.51   0.610    -2943.082    1733.588
    income_hh_ppp |   1.209866   .2699904     4.48   0.000     .6770514     1.74268
          farms_n |  -36.81365   422.8604    -0.09   0.931    -871.3106    797.6833
        land_size |   10.39533   4.730316     2.20   0.029     1.060255    19.73041
     trust_people |   278.3054   531.6895     0.52   0.601    -770.9611    1327.572
 trust_townpeople |  -43.96001   534.0027    -0.08   0.934    -1097.791    1009.871
    trust_familiy |  -205.0619   346.9777    -0.59   0.555    -889.8075    479.6838
       civicorg_d |  -2094.605    1154.95    -1.81   0.071    -4373.849    184.6384
  pruductiveorg_d |   1232.969   1275.104     0.97   0.335    -1283.395    3749.332
         polspace |   868.7501   474.3524     1.83   0.069    -67.36407    1804.864
 never_collective |   829.4278   1088.462     0.76   0.447    -1318.605    2977.461
      tropenbos_d |   2532.497   1959.863     1.29   0.198    -1335.208    6400.203
           gaia_d |   1589.654   1602.506     0.99   0.323    -1572.824    4752.131
         omacha_d |   2562.778   2722.406     0.94   0.348    -2809.775    7935.331
          dononce |  -166.2777   1638.624    -0.10   0.919    -3400.033    3067.478
          donmany |   637.7344   1575.673     0.40   0.686    -2471.788    3747.257
            _cons |   5885.235   2887.467     2.04   0.043     186.9427    11583.53
-----------------------------------------------------------------------------------

. testparm $socio_economic

 ( 1)  female = 0
 ( 2)  id_age = 0
 ( 3)  max_primary = 0
 ( 4)  income_hh_ppp = 0
 ( 5)  farms_n = 0
 ( 6)  land_size = 0

       F(  6,   177) =    6.93
            Prob > F =    0.0000

. local F1 = r(p)

. testparm $trust_involvement

 ( 1)  trust_people = 0
 ( 2)  trust_townpeople = 0
 ( 3)  trust_familiy = 0
 ( 4)  civicorg_d = 0
 ( 5)  pruductiveorg_d = 0
 ( 6)  polspace = 0
 ( 7)  never_collective = 0

       F(  7,   177) =    1.30
            Prob > F =    0.2536

. local F2 = r(p)

. testparm $ngo_experience

 ( 1)  tropenbos_d = 0
 ( 2)  gaia_d = 0
 ( 3)  omacha_d = 0
 ( 4)  dononce = 0
 ( 5)  donmany = 0

       F(  5,   177) =    1.49
            Prob > F =    0.1960

. local F3 = r(p)

. outreg2 using "$working_ANALYSIS/results/tables/Table3_donation_amount", addstat("Adjusted R-squared", e(r2_a), "Socio-economics", `F1', "Trust & Co
> mmunity involvement", `F2', "Experience with NGOs", `F3') adec(2) word ctitle("Donation Amount") dec(2) append
C:\Users\istei\Google Drive\Promotion\1_Projects\PES_Colombia\analysis/results/tables/Table3_donation_amount.rtf
dir : seeout

. 
end of do-file

. shellout using `"C:\Users\istei\Google Drive\Promotion\1_Projects\PES_Colombia\analysis/results/tables/Table3_donation_amount.rtf"'

. do "C:\Users\istei\AppData\Local\Temp\STDcbc_000000.tmp"

. reg donation_n i.pes_participation $socio_economic $trust_involvement $ngo_experience, vce(hc3)

Linear regression                               Number of obs     =        198
                                                F(20, 177)        =       6.10
                                                Prob > F          =     0.0000
                                                R-squared         =     0.3525
                                                Root MSE          =     5994.4

-----------------------------------------------------------------------------------
                  |             Robust HC3
       donation_n |      Coef.   Std. Err.      t    P>|t|     [95% Conf. Interval]
------------------+----------------------------------------------------------------
pes_participation |
    Phase 1 only  |   230.8384   1109.974     0.21   0.835    -1959.648    2421.325
     Phase 1 & 2  |    3364.03   1122.049     3.00   0.003     1149.714    5578.346
                  |
           female |   551.2648   1259.344     0.44   0.662    -1933.997    3036.526
           id_age |   -63.3135   35.18227    -1.80   0.074    -132.7442    6.117205
      max_primary |  -604.7473   1184.893    -0.51   0.610    -2943.082    1733.588
    income_hh_ppp |   1.209866   .2699904     4.48   0.000     .6770514     1.74268
          farms_n |  -36.81365   422.8604    -0.09   0.931    -871.3106    797.6833
        land_size |   10.39533   4.730316     2.20   0.029     1.060255    19.73041
     trust_people |   278.3054   531.6895     0.52   0.601    -770.9611    1327.572
 trust_townpeople |  -43.96001   534.0027    -0.08   0.934    -1097.791    1009.871
    trust_familiy |  -205.0619   346.9777    -0.59   0.555    -889.8075    479.6838
       civicorg_d |  -2094.605    1154.95    -1.81   0.071    -4373.849    184.6384
  pruductiveorg_d |   1232.969   1275.104     0.97   0.335    -1283.395    3749.332
         polspace |   868.7501   474.3524     1.83   0.069    -67.36407    1804.864
 never_collective |   829.4278   1088.462     0.76   0.447    -1318.605    2977.461
      tropenbos_d |   2532.497   1959.863     1.29   0.198    -1335.208    6400.203
           gaia_d |   1589.654   1602.506     0.99   0.323    -1572.824    4752.131
         omacha_d |   2562.778   2722.406     0.94   0.348    -2809.775    7935.331
          dononce |  -166.2777   1638.624    -0.10   0.919    -3400.033    3067.478
          donmany |   637.7344   1575.673     0.40   0.686    -2471.788    3747.257
            _cons |   5885.235   2887.467     2.04   0.043     186.9427    11583.53
-----------------------------------------------------------------------------------

. est store donation_amount

. 
end of do-file

. do "C:\Users\istei\AppData\Local\Temp\STDcbc_000000.tmp"

. tab pes_participation, gen(group_)

pes_participati |
             on |      Freq.     Percent        Cum.
----------------+-----------------------------------
Non-participant |         80       39.41       39.41
   Phase 1 only |         56       27.59       67.00
    Phase 1 & 2 |         67       33.00      100.00
----------------+-----------------------------------
          Total |        203      100.00

. 
end of do-file

. do "C:\Users\istei\AppData\Local\Temp\STDcbc_000000.tmp"

. global groups group_2 group_3

. 
. 
end of do-file

. do "C:\Users\istei\AppData\Local\Temp\STDcbc_000000.tmp"

. reg donation_n $groups $socio_economic $trust_involvement $ngo_experience, vce(hc3)

Linear regression                               Number of obs     =        198
                                                F(20, 177)        =       6.10
                                                Prob > F          =     0.0000
                                                R-squared         =     0.3525
                                                Root MSE          =     5994.4

----------------------------------------------------------------------------------
                 |             Robust HC3
      donation_n |      Coef.   Std. Err.      t    P>|t|     [95% Conf. Interval]
-----------------+----------------------------------------------------------------
         group_2 |   230.8384   1109.974     0.21   0.835    -1959.648    2421.325
         group_3 |    3364.03   1122.049     3.00   0.003     1149.714    5578.346
          female |   551.2648   1259.344     0.44   0.662    -1933.997    3036.526
          id_age |   -63.3135   35.18227    -1.80   0.074    -132.7442    6.117205
     max_primary |  -604.7473   1184.893    -0.51   0.610    -2943.082    1733.588
   income_hh_ppp |   1.209866   .2699904     4.48   0.000     .6770514     1.74268
         farms_n |  -36.81365   422.8604    -0.09   0.931    -871.3106    797.6833
       land_size |   10.39533   4.730316     2.20   0.029     1.060255    19.73041
    trust_people |   278.3054   531.6895     0.52   0.601    -770.9611    1327.572
trust_townpeople |  -43.96001   534.0027    -0.08   0.934    -1097.791    1009.871
   trust_familiy |  -205.0619   346.9777    -0.59   0.555    -889.8075    479.6838
      civicorg_d |  -2094.605    1154.95    -1.81   0.071    -4373.849    184.6384
 pruductiveorg_d |   1232.969   1275.104     0.97   0.335    -1283.395    3749.332
        polspace |   868.7501   474.3524     1.83   0.069    -67.36407    1804.864
never_collective |   829.4278   1088.462     0.76   0.447    -1318.605    2977.461
     tropenbos_d |   2532.497   1959.863     1.29   0.198    -1335.208    6400.203
          gaia_d |   1589.654   1602.506     0.99   0.323    -1572.824    4752.131
        omacha_d |   2562.778   2722.406     0.94   0.348    -2809.775    7935.331
         dononce |  -166.2777   1638.624    -0.10   0.919    -3400.033    3067.478
         donmany |   637.7344   1575.673     0.40   0.686    -2471.788    3747.257
           _cons |   5885.235   2887.467     2.04   0.043     186.9427    11583.53
----------------------------------------------------------------------------------

. est store donation_amount

. 
end of do-file

. tab  donation_d

donation_d= |
   1 if the |
     person |
wants to do |
 a donation |      Freq.     Percent        Cum.
------------+-----------------------------------
          0 |         14        6.90        6.90
          1 |        189       93.10      100.00
------------+-----------------------------------
      Total |        203      100.00

. bys pes_participation: sum donation_d

------------------------------------------------------------------------------------------------------------------------------------------------------
-> pes_participation = Non-participant

    Variable |        Obs        Mean    Std. Dev.       Min        Max
-------------+---------------------------------------------------------
  donation_d |         80       .9125    .2843491          0          1

------------------------------------------------------------------------------------------------------------------------------------------------------
-> pes_participation = Phase 1 only

    Variable |        Obs        Mean    Std. Dev.       Min        Max
-------------+---------------------------------------------------------
  donation_d |         56    .9464286    .2272078          0          1

------------------------------------------------------------------------------------------------------------------------------------------------------
-> pes_participation = Phase 1 & 2

    Variable |        Obs        Mean    Std. Dev.       Min        Max
-------------+---------------------------------------------------------
  donation_d |         67    .9402985    .2387212          0          1


. do "C:\Users\istei\AppData\Local\Temp\STDcbc_000000.tmp"

. coefplot (donation_amount, offset(0.2)),   keep(group_2 group_3)  coeflabels(group_2  = "Phase 1 only"  group_3 = "Phase 1 & 2") xline(0, lpattern(d
> ash) lcolor(gs3)) title("{bf:A } Donation amount", span pos(11) size()) xtitle("Regression estimated impact relative to non-participants in Pesos") 
>    xla(-500(500)4000, nogrid) grid(none) levels(95 90) ciopts(lwidth(0.3 1)  msize()  lcolor(*.8 *.2) recast(rcap)) mlabel(cond(@pval<.01, "***", co
> nd(@pval<.05, "**", cond(@pval<.1, "*", ""))))  mlabsize() mlabposition(12) 
(note:  named style medthin not found in class linestyle, default attributes used)

. 
end of do-file

. do "C:\Users\istei\AppData\Local\Temp\STDcbc_000000.tmp"

. coefplot (donation_amount, offset(0.2)),   keep(group_2 group_3)  coeflabels(group_2  = "Phase 1 only"  group_3 = "Phase 1 & 2") xline(0, lpattern(d
> ash) lcolor(gs3)) title("{bf:A } Donation amount", span pos(11) size()) xtitle("Regression estimated impact relative to non-participants in Pesos") 
>    xla(-2000(1000)8000, nogrid) grid(none) levels(95 90) ciopts(lwidth(0.3 1)  msize()  lcolor(*.8 *.2) recast(rcap)) mlabel(cond(@pval<.01, "***", 
> cond(@pval<.05, "**", cond(@pval<.1, "*", ""))))  mlabsize() mlabposition(12) 

. 
end of do-file

. do "C:\Users\istei\AppData\Local\Temp\STDcbc_000000.tmp"

. reg donation_n primed $socio_economic $trust_involvement $ngo_experience, vce(hc3)

Linear regression                               Number of obs     =        118
                                                F(19, 98)         =       8.50
                                                Prob > F          =     0.0000
                                                R-squared         =     0.4436
                                                Root MSE          =     6144.9

----------------------------------------------------------------------------------
                 |             Robust HC3
      donation_n |      Coef.   Std. Err.      t    P>|t|     [95% Conf. Interval]
-----------------+----------------------------------------------------------------
          primed |  -247.3416   1288.479    -0.19   0.848    -2804.285    2309.602
          female |   2093.952   1877.955     1.12   0.268    -1632.788    5820.692
          id_age |  -149.2996   53.90404    -2.77   0.007    -256.2704   -42.32874
     max_primary |  -964.3032   1805.596    -0.53   0.595     -4547.45    2618.844
   income_hh_ppp |   1.213942   .5168299     2.35   0.021     .1883102    2.239574
         farms_n |   1108.225   601.0138     1.84   0.068    -84.46747    2300.917
       land_size |   7.368642   6.533219     1.13   0.262    -5.596318     20.3336
    trust_people |   701.6817   871.2496     0.81   0.423    -1027.285    2430.648
trust_townpeople |   529.4019   936.3951     0.57   0.573    -1328.844    2387.648
   trust_familiy |  -320.4509    572.153    -0.56   0.577     -1455.87    814.9681
      civicorg_d |  -3490.677   1695.064    -2.06   0.042    -6854.477   -126.8764
 pruductiveorg_d |   3426.147   1744.398     1.96   0.052    -35.55413    6887.848
        polspace |   513.8448   733.3794     0.70   0.485    -941.5227    1969.212
never_collective |   2734.979   1500.989     1.82   0.071    -243.6848    5713.642
     tropenbos_d |  -95.73426   2687.741    -0.04   0.972    -5429.469        5238
          gaia_d |   2077.581    2204.06     0.94   0.348    -2296.304    6451.467
        omacha_d |   6786.363   3128.859     2.17   0.033      577.244    12995.48
         dononce |  -1620.983   2518.082    -0.64   0.521    -6618.035     3376.07
         donmany |   469.4622    1981.84     0.24   0.813    -3463.434    4402.358
           _cons |   8483.605   4720.743     1.80   0.075    -884.5548    17851.77
----------------------------------------------------------------------------------

. 
end of do-file

. do "C:\Users\istei\AppData\Local\Temp\STDcbc_000000.tmp"

. reg donation_n primed , vce(hc3)

Linear regression                               Number of obs     =        123
                                                F(1, 121)         =       0.01
                                                Prob > F          =     0.9095
                                                R-squared         =     0.0001
                                                Root MSE          =     7675.4

------------------------------------------------------------------------------
             |             Robust HC3
  donation_n |      Coef.   Std. Err.      t    P>|t|     [95% Conf. Interval]
-------------+----------------------------------------------------------------
      primed |   -159.127   1397.008    -0.11   0.910    -2924.874     2606.62
       _cons |   9984.127   960.3189    10.40   0.000     8082.923    11885.33
------------------------------------------------------------------------------

. 
end of do-file

. do "C:\Users\istei\AppData\Local\Temp\STDcbc_000000.tmp"

. coefplot (donation_amount, offset(0.2)) (donation_amount_primed, offset(-0.2)),   keep(group_2 group_3)  coeflabels(group_2  = "Phase 1 only"  group
> _3 = "Phase 1 & 2" primed = "Recall") xline(0, lpattern(dash) lcolor(gs3)) title("{bf:A } Donation amount", span pos(11) size()) xtitle("Regression 
> estimated impact relative to non-participants in Pesos")    xla(-2000(1000)8000, nogrid) grid(none) levels(95 90) ciopts(lwidth(0.3 1)  msize()  lco
> lor(*.8 *.2) recast(rcap)) mlabel(cond(@pval<.01, "***", cond(@pval<.05, "**", cond(@pval<.1, "*", ""))))  mlabsize() mlabposition(12) 
estimation result donation_amount_primed not found
r(111);

end of do-file

r(111);

. do "C:\Users\istei\AppData\Local\Temp\STDcbc_000000.tmp"

. reg donation_n primed $socio_economic $trust_involvement $ngo_experience, vce(hc3)

Linear regression                               Number of obs     =        118
                                                F(19, 98)         =       8.50
                                                Prob > F          =     0.0000
                                                R-squared         =     0.4436
                                                Root MSE          =     6144.9

----------------------------------------------------------------------------------
                 |             Robust HC3
      donation_n |      Coef.   Std. Err.      t    P>|t|     [95% Conf. Interval]
-----------------+----------------------------------------------------------------
          primed |  -247.3416   1288.479    -0.19   0.848    -2804.285    2309.602
          female |   2093.952   1877.955     1.12   0.268    -1632.788    5820.692
          id_age |  -149.2996   53.90404    -2.77   0.007    -256.2704   -42.32874
     max_primary |  -964.3032   1805.596    -0.53   0.595     -4547.45    2618.844
   income_hh_ppp |   1.213942   .5168299     2.35   0.021     .1883102    2.239574
         farms_n |   1108.225   601.0138     1.84   0.068    -84.46747    2300.917
       land_size |   7.368642   6.533219     1.13   0.262    -5.596318     20.3336
    trust_people |   701.6817   871.2496     0.81   0.423    -1027.285    2430.648
trust_townpeople |   529.4019   936.3951     0.57   0.573    -1328.844    2387.648
   trust_familiy |  -320.4509    572.153    -0.56   0.577     -1455.87    814.9681
      civicorg_d |  -3490.677   1695.064    -2.06   0.042    -6854.477   -126.8764
 pruductiveorg_d |   3426.147   1744.398     1.96   0.052    -35.55413    6887.848
        polspace |   513.8448   733.3794     0.70   0.485    -941.5227    1969.212
never_collective |   2734.979   1500.989     1.82   0.071    -243.6848    5713.642
     tropenbos_d |  -95.73426   2687.741    -0.04   0.972    -5429.469        5238
          gaia_d |   2077.581    2204.06     0.94   0.348    -2296.304    6451.467
        omacha_d |   6786.363   3128.859     2.17   0.033      577.244    12995.48
         dononce |  -1620.983   2518.082    -0.64   0.521    -6618.035     3376.07
         donmany |   469.4622    1981.84     0.24   0.813    -3463.434    4402.358
           _cons |   8483.605   4720.743     1.80   0.075    -884.5548    17851.77
----------------------------------------------------------------------------------

. est store donation_amount_primed

. 
end of do-file

. do "C:\Users\istei\AppData\Local\Temp\STDcbc_000000.tmp"

. coefplot (donation_amount, offset(0.2)) (donation_amount_primed, offset(-0.2)),   keep(group_2 group_3)  coeflabels(group_2  = "Phase 1 only"  group
> _3 = "Phase 1 & 2" primed = "Recall") xline(0, lpattern(dash) lcolor(gs3)) title("{bf:A } Donation amount", span pos(11) size()) xtitle("Regression 
> estimated impact relative to non-participants in Pesos")    xla(-2000(1000)8000, nogrid) grid(none) levels(95 90) ciopts(lwidth(0.3 1)  msize()  lco
> lor(*.8 *.2) recast(rcap)) mlabel(cond(@pval<.01, "***", cond(@pval<.05, "**", cond(@pval<.1, "*", ""))))  mlabsize() mlabposition(12) 
(donation_amount_primed: no coefficients found, all dropped, or none kept)

. 
end of do-file

. do "C:\Users\istei\AppData\Local\Temp\STDcbc_000000.tmp"

. coefplot (donation_amount, offset(0.2)) (donation_amount_primed, offset(-0.2)),   keep(group_2 group_3 primed)  coeflabels(group_2  = "Phase 1 only"
>   group_3 = "Phase 1 & 2" primed = "Recall") xline(0, lpattern(dash) lcolor(gs3)) title("{bf:A } Donation amount", span pos(11) size()) xtitle("Regr
> ession estimated impact relative to non-participants in Pesos")    xla(-2000(1000)8000, nogrid) grid(none) levels(95 90) ciopts(lwidth(0.3 1)  msize
> ()  lcolor(*.8 *.2) recast(rcap)) mlabel(cond(@pval<.01, "***", cond(@pval<.05, "**", cond(@pval<.1, "*", ""))))  mlabsize() mlabposition(12) 

. 
end of do-file

. do "C:\Users\istei\AppData\Local\Temp\STDcbc_000000.tmp"

. 
. coefplot (donation_amount),   keep(group_2 group_3 primed)  coeflabels(group_2  = "Phase 1 only"  group_3 = "Phase 1 & 2" primed = "Recall") xline(0
> , lpattern(dash) lcolor(gs3)) title("{bf:A } Donation amount", span pos(11) size()) xtitle("Regression estimated impact relative to non-participants
>  in Pesos")    xla(-2000(1000)8000, nogrid) grid(none) levels(95 90) ciopts(lwidth(0.3 1)  msize()  lcolor(*.8 *.2) recast(rcap)) mlabel(cond(@pval<
> .01, "***", cond(@pval<.05, "**", cond(@pval<.1, "*", ""))))  mlabsize() mlabposition(12) 

. gr save "$working_ANALYSIS/results/intermediate/figure1_a.gph", replace
(note: file C:\Users\istei\Google Drive\Promotion\1_Projects\PES_Colombia\analysis/results/intermediate/figure1_a.gph not found)
(file C:\Users\istei\Google Drive\Promotion\1_Projects\PES_Colombia\analysis/results/intermediate/figure1_a.gph saved)

. 
. 
. 
end of do-file

. do "C:\Users\istei\AppData\Local\Temp\STDcbc_000000.tmp"

. reg donation_n $groups $socio_economic $trust_involvement $ngo_experience, vce(hc3)

Linear regression                               Number of obs     =        198
                                                F(20, 177)        =       6.10
                                                Prob > F          =     0.0000
                                                R-squared         =     0.3525
                                                Root MSE          =     5994.4

----------------------------------------------------------------------------------
                 |             Robust HC3
      donation_n |      Coef.   Std. Err.      t    P>|t|     [95% Conf. Interval]
-----------------+----------------------------------------------------------------
         group_2 |   230.8384   1109.974     0.21   0.835    -1959.648    2421.325
         group_3 |    3364.03   1122.049     3.00   0.003     1149.714    5578.346
          female |   551.2648   1259.344     0.44   0.662    -1933.997    3036.526
          id_age |   -63.3135   35.18227    -1.80   0.074    -132.7442    6.117205
     max_primary |  -604.7473   1184.893    -0.51   0.610    -2943.082    1733.588
   income_hh_ppp |   1.209866   .2699904     4.48   0.000     .6770514     1.74268
         farms_n |  -36.81365   422.8604    -0.09   0.931    -871.3106    797.6833
       land_size |   10.39533   4.730316     2.20   0.029     1.060255    19.73041
    trust_people |   278.3054   531.6895     0.52   0.601    -770.9611    1327.572
trust_townpeople |  -43.96001   534.0027    -0.08   0.934    -1097.791    1009.871
   trust_familiy |  -205.0619   346.9777    -0.59   0.555    -889.8075    479.6838
      civicorg_d |  -2094.605    1154.95    -1.81   0.071    -4373.849    184.6384
 pruductiveorg_d |   1232.969   1275.104     0.97   0.335    -1283.395    3749.332
        polspace |   868.7501   474.3524     1.83   0.069    -67.36407    1804.864
never_collective |   829.4278   1088.462     0.76   0.447    -1318.605    2977.461
     tropenbos_d |   2532.497   1959.863     1.29   0.198    -1335.208    6400.203
          gaia_d |   1589.654   1602.506     0.99   0.323    -1572.824    4752.131
        omacha_d |   2562.778   2722.406     0.94   0.348    -2809.775    7935.331
         dononce |  -166.2777   1638.624    -0.10   0.919    -3400.033    3067.478
         donmany |   637.7344   1575.673     0.40   0.686    -2471.788    3747.257
           _cons |   5885.235   2887.467     2.04   0.043     186.9427    11583.53
----------------------------------------------------------------------------------

. iegraph group_2 group_3, title("{bf: Panel A} Across groups", size(medium)) varlabels yla(0(1000)10000, nogrid) xla(, nogrid) barlabel  barlabelform
> at(%5.1f) mlabpos(11) mlabsize(medsmall) legend(ring(1) size(medsmall) pos(6) rows(1)) ysize(2) xsize(3.465) ytitle("Mean transfer in PHP", size(med
> small))

. 
end of do-file

. do "C:\Users\istei\AppData\Local\Temp\STDcbc_000000.tmp"

. iegraph group_2 group_3, title("{bf: Panel A} Across groups", size(medium)) varlabels yla(0(1000)20000, nogrid) xla(, nogrid) barlabel  barlabelform
> at(%5.1f) mlabpos(11) mlabsize(medsmall) legend(ring(1) size(medsmall) pos(6) rows(1)) ysize(2) xsize(3.465) ytitle("Mean transfer in PHP", size(med
> small))

. 
end of do-file

. do "C:\Users\istei\AppData\Local\Temp\STDcbc_000000.tmp"

. iegraph group_2 group_3, title("{bf: Panel A} Across groups", size(medium)) varlabels yla(0(5000)20000, nogrid) xla(, nogrid) barlabel  barlabelform
> at(%5.1f) mlabpos(11) mlabsize(medsmall) legend(ring(1) size(medsmall) pos(6) rows(1)) ysize(2) xsize(3.465) ytitle("Mean transfer in PHP", size(med
> small))

. 
end of do-file

. do "C:\Users\istei\AppData\Local\Temp\STDcbc_000000.tmp"

. *--------------------------------------------------
. * Title: Prosociality as response to slow- and fast-onset climate hazards
. * Code to replicate the results reported in the manuscript and SOM 
. * 08_analysis_GSUS.do
. * Last changes: 2022-01-05
. * Author: Ivo Steimanis, Philipps University Marburg
. *--------------------------------------------------
. 
. 
. *--------------------------------------------------
. * Program Setup
. *--------------------------------------------------
. version 16              // Set Version number for backward compatibility

. set more off            

. clear all               

. set linesize 80         

. macro drop _all        

. set matsize 2000
set matsize ignored.
    Matrix sizes are no longer limited by c(matsize) in modern Statas.  Matrix
    sizes are now limited by flavor of Stata.  See limits for more details.

. *ssc install schemepack // remove * to install the required graph scheme that 
> is set in the next line
. set scheme white_tableau

. * -------------------------------------------------
. 
. *--------------------------------------------------
. * Directory
. *--------------------------------------------------
. global workpath "C:\Users\istei\Google Drive\Promotion\2_Paper Drafts\WP3 - Sh
> adow of the Future\STATA\OUTPUT\pooled"

. global datapath "C:\Users\istei\Google Drive\Promotion\2_Paper Drafts\WP3 - Sh
> adow of the Future\STATA\DTA-FILES"

. global output "C:\Users\istei\Google Drive\Promotion\2_Paper Drafts\WP3 - Shad
> ow of the Future\STATA\OUTPUT\ncc"

. global xls "C:\Users\istei\Google Drive\Promotion\2_Paper Drafts\WP3 - Shadow 
> of the Future\STATA\XLS-FILES"

. * --------------------------------------------------
. 
. *--------------------------------------------------
. * Description
. *--------------------------------------------------
. /*
>  Study 1: Fast-onset hazards: Typhoon Haiyan (Philippines)
>         - Figure 2. Manipulation check  Worse social cohesion
>         - Figure 3.     Main treatment effects
>         - Supplementary Information: Summary statistics, robustness checks and
>  extented results, additional analysis
> 
> Study 2:  Slow-onset hazards: Sea-level rise (Solomon Islands, Bangladesh & Vi
> etnam)
>         - Figure 4.     Manipulation check  Negative emotions
>         - Table 1.       Main treatment effects and interactions with relocati
> on beliefs
>         - Supplementary Information: Summary statistics, robustness checks and
>  extented results, additional analysis
> */
. *--------------------------------------------------
. 
. 
. 
. 
. 
. *--------------------------------------------------------------
. *  Study 1: Fast-onset hazards: Typhoon Haiyan (Philippines)
. *--------------------------------------------------------------
. * Load dataset for study 1
. use "$datapath\sotp_full.dta", replace

. 
. 
end of do-file

. do "C:\Users\istei\AppData\Local\Temp\STDcbc_000000.tmp"

. reg transfer_primed_anonymous t2 t3 transfer_baseline_anonymous $socio $prefer
> ences, vce(cluster group_session) beta
options vce(cluster clustvar) and beta may not be combined
r(184);

end of do-file

r(184);

. do "C:\Users\istei\AppData\Local\Temp\STDcbc_000000.tmp"

. *--------------------------------------------------
. * Title: Prosociality as response to slow- and fast-onset climate hazards
. * Code to replicate the results reported in the manuscript and SOM 
. * 08_analysis_GSUS.do
. * Last changes: 2022-01-05
. * Author: Ivo Steimanis, Philipps University Marburg
. *--------------------------------------------------
. 
. 
. *--------------------------------------------------
. * Program Setup
. *--------------------------------------------------
. version 16              // Set Version number for backward compatibility

. set more off            

. clear all               

. set linesize 80         

. macro drop _all        

. set matsize 2000
set matsize ignored.
    Matrix sizes are no longer limited by c(matsize) in modern Statas.  Matrix
    sizes are now limited by flavor of Stata.  See limits for more details.

. *ssc install schemepack // remove * to install the required graph scheme that 
> is set in the next line
. set scheme white_tableau

. * -------------------------------------------------
. 
. *--------------------------------------------------
. * Directory
. *--------------------------------------------------
. global workpath "C:\Users\istei\Google Drive\Promotion\2_Paper Drafts\WP3 - Sh
> adow of the Future\STATA\OUTPUT\pooled"

. global datapath "C:\Users\istei\Google Drive\Promotion\2_Paper Drafts\WP3 - Sh
> adow of the Future\STATA\DTA-FILES"

. global output "C:\Users\istei\Google Drive\Promotion\2_Paper Drafts\WP3 - Shad
> ow of the Future\STATA\OUTPUT\ncc"

. global xls "C:\Users\istei\Google Drive\Promotion\2_Paper Drafts\WP3 - Shadow 
> of the Future\STATA\XLS-FILES"

. * --------------------------------------------------
. 
. *--------------------------------------------------
. * Description
. *--------------------------------------------------
. /*
>  Study 1: Fast-onset hazards: Typhoon Haiyan (Philippines)
>         - Figure 2. Manipulation check  Worse social cohesion
>         - Figure 3.     Main treatment effects
>         - Supplementary Information: Summary statistics, robustness checks and
>  extented results, additional analysis
> 
> Study 2:  Slow-onset hazards: Sea-level rise (Solomon Islands, Bangladesh & Vi
> etnam)
>         - Figure 4.     Manipulation check  Negative emotions
>         - Table 1.       Main treatment effects and interactions with relocati
> on beliefs
>         - Supplementary Information: Summary statistics, robustness checks and
>  extented results, additional analysis
> */
. *--------------------------------------------------
. 
. 
. 
. 
. 
. *--------------------------------------------------------------
. *  Study 1: Fast-onset hazards: Typhoon Haiyan (Philippines)
. *--------------------------------------------------------------
. * Load dataset for study 1
. use "$datapath\sotp_full.dta", replace

. 
. 
. *-------------------------
. * Study site description
. *-------------------------
. * Self-reported Affectedness by Haiyan
. sum h6need house_dmg damages_house_ppp damages_haiyan_ppp house_dmg, detail

              was in need of aid after yolanda
-------------------------------------------------------------
      Percentiles      Smallest
 1%            0              0
 5%            0              0
10%            1              0       Obs                 377
25%            1              0       Sum of Wgt.         377

50%            1                      Mean           .9257294
                        Largest       Std. Dev.      .2625591
75%            1              1
90%            1              1       Variance       .0689373
95%            1              1       Skewness      -3.247232
99%            1              1       Kurtosis       11.54451

                          house_dmg
-------------------------------------------------------------
      Percentiles      Smallest
 1%            0              0
 5%            0              0
10%            0              0       Obs                 378
25%            1              0       Sum of Wgt.         378

50%            1                      Mean           .8280423
                        Largest       Std. Dev.      .3778438
75%            1              1
90%            1              1       Variance       .1427659
95%            1              1       Skewness      -1.738693
99%            1              1       Kurtosis       4.023052

                      damages_house_ppp
-------------------------------------------------------------
      Percentiles      Smallest
 1%            0              0
 5%            0              0
10%     31.66728              0       Obs                 313
25%     158.3364              0       Sum of Wgt.         313

50%      527.788                      Mean           865.7026
                        Largest       Std. Dev.      1175.289
75%     1055.576        5277.88
90%     2111.152       7916.821       Variance        1381303
95%      2638.94       7916.821       Skewness       3.133378
99%      5277.88       8444.608       Kurtosis       16.70962

                     damages_haiyan_ppp
-------------------------------------------------------------
      Percentiles      Smallest
 1%            0              0
 5%            0              0
10%            0              0       Obs                 378
25%     105.5576              0       Sum of Wgt.         378

50%     451.2588                      Mean           967.4404
                        Largest       Std. Dev.      1417.425
75%      1319.47        7943.21
90%      2638.94       8444.608       Variance        2009095
95%     3166.728       8972.396       Skewness       3.421398
99%      7943.21       12666.91       Kurtosis       20.91617

                          house_dmg
-------------------------------------------------------------
      Percentiles      Smallest
 1%            0              0
 5%            0              0
10%            0              0       Obs                 378
25%            1              0       Sum of Wgt.         378

50%            1                      Mean           .8280423
                        Largest       Std. Dev.      .3778438
75%            1              1
90%            1              1       Variance       .1427659
95%            1              1       Skewness      -1.738693
99%            1              1       Kurtosis       4.023052

. * 93% of participants were in need of aid because of Haiyan and 83% of houses 
> were damaged
. * The estimated costs of the damages to their houses was $865+-1125(SD) PPP ad
> justed
. pwcorr h4finan damages_house_ppp damages_haiyan_ppp h6need , sig

             |  h4finan da~e_ppp da~n_ppp   h6need
-------------+------------------------------------
     h4finan |   1.0000 
             |
             |
damages_ho~p |   0.1085   1.0000 
             |   0.0552
             |
damages_ha~p |   0.1712   0.8893   1.0000 
             |   0.0008   0.0000
             |
      h6need |   0.1824   0.0494   0.1444   1.0000 
             |   0.0004   0.3840   0.0050
             |

. * Perceived financial pressure after haiyan is correlated with damages (both h
> ouse and overall) and being in need of aid
. 
. * TIME TO PREPARE
. sum h1hours 

    Variable |        Obs        Mean    Std. Dev.       Min        Max
-------------+---------------------------------------------------------
     h1hours |        377    5.612732    12.43146          0        140

. * Median 2 hours, 90% of participants had no more than 10 hours to prepare the
> mselves
. tab h1where 

     location at time of |
                 typhoon |      Freq.     Percent        Cum.
-------------------------+-----------------------------------
               own house |        291       77.19       77.19
another house in village |         18        4.77       81.96
           other village |          5        1.33       83.29
       evacuation center |         40       10.61       93.90
                   other |         23        6.10      100.00
-------------------------+-----------------------------------
                   Total |        377      100.00

. * 76% of participants were at their homes when they were hit by Haiyan and onl
> y 11% found shelter in evacuation centers
. sum h1prep h1rein h1prop h1food h1medi, detail

                  took preparatory measures
-------------------------------------------------------------
      Percentiles      Smallest
 1%            0              0
 5%            0              0
10%            0              0       Obs                 377
25%            1              0       Sum of Wgt.         377

50%            1                      Mean           .8965517
                        Largest       Std. Dev.      .3049482
75%            1              1
90%            1              1       Variance       .0929934
95%            1              1       Skewness      -2.604237
99%            1              1       Kurtosis       7.782051

                      reinforced house
-------------------------------------------------------------
      Percentiles      Smallest
 1%            0              0
 5%            0              0
10%            0              0       Obs                 377
25%            0              0       Sum of Wgt.         377

50%            1                      Mean           .6074271
                        Largest       Std. Dev.       .488972
75%            1              1
90%            1              1       Variance       .2390936
95%            1              1       Skewness      -.4399835
99%            1              1       Kurtosis       1.193586

               brought property to safe place
-------------------------------------------------------------
      Percentiles      Smallest
 1%            0              0
 5%            0              0
10%            0              0       Obs                 377
25%            0              0       Sum of Wgt.         377

50%            1                      Mean            .535809
                        Largest       Std. Dev.      .4993788
75%            1              1
90%            1              1       Variance       .2493792
95%            1              1       Skewness      -.1436048
99%            1              1       Kurtosis       1.020622

                stored additional food/drink
-------------------------------------------------------------
      Percentiles      Smallest
 1%            0              0
 5%            0              0
10%            0              0       Obs                 377
25%            0              0       Sum of Wgt.         377

50%            1                      Mean           .6923077
                        Largest       Std. Dev.      .4621518
75%            1              1
90%            1              1       Variance       .2135843
95%            1              1       Skewness      -.8333333
99%            1              1       Kurtosis       1.694444

                 stored additional medicine
-------------------------------------------------------------
      Percentiles      Smallest
 1%            0              0
 5%            0              0
10%            0              0       Obs                 377
25%            0              0       Sum of Wgt.         377

50%            0                      Mean           .2891247
                        Largest       Std. Dev.      .4539584
75%            1              1
90%            1              1       Variance       .2060782
95%            1              1       Skewness        .930286
99%            1              1       Kurtosis       1.865432

. * 90% stated to have taken some kind of preperation measures, such as storing 
> additional food (70%), reinforcing their houses (61%) or stacked up on medical
>  supplies (29%)
. sum income_hh_ppp, detail

                        income_hh_ppp
-------------------------------------------------------------
      Percentiles      Smallest
 1%     15.83364              0
 5%      52.7788       7.916821
10%     79.16821       10.55576       Obs                 376
25%     110.8355       15.83364       Sum of Wgt.         376

50%     204.5179                      Mean           271.6611
                        Largest       Std. Dev.       276.436
75%     316.6728       1583.364
90%      527.788       1847.258       Variance       76416.89
95%     791.6821       2111.311       Skewness       3.899564
99%     1583.364        2638.94       Kurtosis        25.7439

. *
. 
. 
. 
. *----------------------------------------------------------------
. * Figure 2.     Manipulation check: Worse togetherness due to Haiyan?
. *----------------------------------------------------------------
. * What did the priming evoke?
. ttest togetherness if priming < 3, by(priming)

Two-sample t test with equal variances
------------------------------------------------------------------------------
   Group |     Obs        Mean    Std. Err.   Std. Dev.   [95% Conf. Interval]
---------+--------------------------------------------------------------------
 Control |     125       4.424    .3080142    3.443704    3.814354    5.033646
T1: Supp |     126    3.507937    .2384463    2.676553    3.036022    3.979851
---------+--------------------------------------------------------------------
combined |     251    3.964143    .1963279    3.110419    3.577476    4.350811
---------+--------------------------------------------------------------------
    diff |            .9160635    .3891402                .1496375     1.68249
------------------------------------------------------------------------------
    diff = mean(Control) - mean(T1: Supp)                         t =   2.3541
Ho: diff = 0                                     degrees of freedom =      249

    Ha: diff < 0                 Ha: diff != 0                 Ha: diff > 0
 Pr(T < t) = 0.9903         Pr(|T| > |t|) = 0.0193          Pr(T > t) = 0.0097

. ttest togetherness if priming !=2, by(priming)

Two-sample t test with equal variances
------------------------------------------------------------------------------
   Group |     Obs        Mean    Std. Err.   Std. Dev.   [95% Conf. Interval]
---------+--------------------------------------------------------------------
 Control |     125       4.424    .3080142    3.443704    3.814354    5.033646
T2: Conf |     126    3.809524    .2613067     2.93316    3.292365    4.326682
---------+--------------------------------------------------------------------
combined |     251    4.115538    .2023625    3.206025    3.716985     4.51409
---------+--------------------------------------------------------------------
    diff |            .6144762    .4036662               -.1805593    1.409512
------------------------------------------------------------------------------
    diff = mean(Control) - mean(T2: Conf)                         t =   1.5222
Ho: diff = 0                                     degrees of freedom =      249

    Ha: diff < 0                 Ha: diff != 0                 Ha: diff > 0
 Pr(T < t) = 0.9354         Pr(|T| > |t|) = 0.1292          Pr(T > t) = 0.0646

. ttest togetherness if priming !=1, by(priming)

Two-sample t test with equal variances
------------------------------------------------------------------------------
   Group |     Obs        Mean    Std. Err.   Std. Dev.   [95% Conf. Interval]
---------+--------------------------------------------------------------------
T1: Supp |     126    3.507937    .2384463    2.676553    3.036022    3.979851
T2: Conf |     126    3.809524    .2613067     2.93316    3.292365    4.326682
---------+--------------------------------------------------------------------
combined |     252     3.65873    .1767778    2.806261    3.310573    4.006887
---------+--------------------------------------------------------------------
    diff |           -.3015873    .3537482               -.9982939    .3951193
------------------------------------------------------------------------------
    diff = mean(T1: Supp) - mean(T2: Conf)                        t =  -0.8525
Ho: diff = 0                                     degrees of freedom =      250

    Ha: diff < 0                 Ha: diff != 0                 Ha: diff > 0
 Pr(T < t) = 0.1974         Pr(|T| > |t|) = 0.3947          Pr(T > t) = 0.8026

. 
. 
. ranksum togetherness if priming < 3, by(priming)

Two-sample Wilcoxon rank-sum (Mann-Whitney) test

     priming |      obs    rank sum    expected
-------------+---------------------------------
     Control |      125       16671       15750
 T1: Support |      126       14955       15876
-------------+---------------------------------
    combined |      251       31626       31626

unadjusted variance   330750.00
adjustment for ties   -21887.48
                     ----------
adjusted variance     308862.52

Ho: togeth~s(priming==Control) = togeth~s(priming==T1: Support)
             z =   1.657
    Prob > |z| =   0.0975

Note: Exact p-value is not computed by default for sample sizes > 200.
      Use option exact to compute it.

. ranksum togetherness if priming !=2, by(priming)

Two-sample Wilcoxon rank-sum (Mann-Whitney) test

     priming |      obs    rank sum    expected
-------------+---------------------------------
     Control |      125     16397.5       15750
T2: Conflict |      126     15228.5       15876
-------------+---------------------------------
    combined |      251       31626       31626

unadjusted variance   330750.00
adjustment for ties   -22912.67
                     ----------
adjusted variance     307837.33

Ho: togeth~s(priming==Control) = togeth~s(priming==T2: Conflict)
             z =   1.167
    Prob > |z| =   0.2432

Note: Exact p-value is not computed by default for sample sizes > 200.
      Use option exact to compute it.

. ranksum togetherness if priming !=1, by(priming)

Two-sample Wilcoxon rank-sum (Mann-Whitney) test

     priming |      obs    rank sum    expected
-------------+---------------------------------
 T1: Support |      126       15629       15939
T2: Conflict |      126       16249       15939
-------------+---------------------------------
    combined |      252       31878       31878

unadjusted variance   334719.00
adjustment for ties   -21750.06
                     ----------
adjusted variance     312968.94

Ho: togeth~s(priming==T1: Support) = togeth~s(priming==T2: Conflict)
             z =  -0.554
    Prob > |z| =   0.5795

Note: Exact p-value is not computed by default for sample sizes > 200.
      Use option exact to compute it.

. 
. cibar togetherness, over1(priming)  bargap(10) barlabel(on) blfmt(%5.1f) blpos
> (11) blsize(8pt) blgap(0.03) graphopts(ysize(3.165) xsize(2.5)  legend(ring (1
> ) pos(6) rows(1) size(8pt)) yla(1(1)6, nogrid) xla(, nogrid) ytitle("Mean", ))
>  ciopts(lcolor(black) lpattern(dash)) 

. gr save "$output\figure2_fast_manipulation.gph", replace
(file C:\Users\istei\Google Drive\Promotion\2_Paper Drafts\WP3 - Shadow of the F
> uture\STATA\OUTPUT\ncc\figure2_fast_manipulation.gph saved)

. gr export "$output\01_main-manuscript\figure2_fast_manipulation.tif", replace 
> width(3465)
(file C:\Users\istei\Google Drive\Promotion\2_Paper Drafts\WP3 - Shadow of the F
> uture\STATA\OUTPUT\ncc\01_main-manuscript\figure2_fast_manipulation.tif writte
> n in TIFF format)

. gr export "$output\01_main-manuscript\figure2_fast_manipulation.svg", replace
(file C:\Users\istei\Google Drive\Promotion\2_Paper Drafts\WP3 - Shadow of the F
> uture\STATA\OUTPUT\ncc\01_main-manuscript\figure2_fast_manipulation.svg writte
> n in SVG format)

. 
. 
. * Do participants who recalled conflicts perceive that Haiyan resulted in wors
> e togetherness?
. ttest social_cohesion if priming==3, by(primed_conflict)
variable social_cohesion not found
r(111);

end of do-file

r(111);

. do "C:\Users\istei\AppData\Local\Temp\STDcbc_000000.tmp"

. *set globals for groups of explanatory variables
. global socio female married age only_elementary people_hh income_hh_ppp100 h1h
> ours

. global preferences survey_riskaversion survey_time a1trust

. 
end of do-file

. do "C:\Users\istei\AppData\Local\Temp\STDcbc_000000.tmp"

. reg transfer_primed_anonymous t2 t3 transfer_baseline_anonymous $socio $prefer
> ences, vce(cluster group_session) beta
options vce(cluster clustvar) and beta may not be combined
r(184);

end of do-file

r(184);

. help egen

. do "C:\Users\istei\AppData\Local\Temp\STDcbc_000000.tmp"

. egen z_transfer_primed_ano = std(transfer_primed_anonymous)

. 
end of do-file

. do "C:\Users\istei\AppData\Local\Temp\STDcbc_000000.tmp"

. reg z_transfer_primed_ano t2 t3 transfer_baseline_anonymous $socio $preference
> s, vce(cluster group_session) 

Linear regression                               Number of obs     =        376
                                                F(13, 92)         =      19.45
                                                Prob > F          =     0.0000
                                                R-squared         =     0.3651
                                                Root MSE          =     .81241

                          (Std. Err. adjusted for 93 clusters in group_session)
-------------------------------------------------------------------------------
              |               Robust
z_transfer_~o |      Coef.   Std. Err.      t    P>|t|     [95% Conf. Interval]
--------------+----------------------------------------------------------------
           t2 |   .3099512   .1195586     2.59   0.011     .0724974     .547405
           t3 |   .2193906   .1090157     2.01   0.047     .0028761    .4359051
transfer_ba~s |   .0264141   .0024558    10.76   0.000     .0215366    .0312916
       female |   .0673816   .1020136     0.66   0.511    -.1352262    .2699895
      married |   .0783665   .1163811     0.67   0.502    -.1527763    .3095094
          age |   .0031933   .0043498     0.73   0.465    -.0054457    .0118323
only_elemen~y |  -.0739899   .1015663    -0.73   0.468    -.2757093    .1277294
    people_hh |    .006716   .0230201     0.29   0.771    -.0390039    .0524358
income_hh~100 |   .0350646   .0154338     2.27   0.025     .0044118    .0657174
      h1hours |    .000755   .0029328     0.26   0.797    -.0050697    .0065798
survey_risk~n |  -.0211486    .015784    -1.34   0.184     -.052497    .0101998
  survey_time |   .0011638   .0045081     0.26   0.797    -.0077897    .0101173
      a1trust |  -.3554222   .1068076    -3.33   0.001    -.5675513   -.1432931
        _cons |  -1.029713   .2885361    -3.57   0.001     -1.60277    -.456655
-------------------------------------------------------------------------------

. 
end of do-file

